{
    "article_id": 63,
    "url": "https://reuters.com/technology/space/china-may-launch-next-generation-crewed-spacecraft-early-2027-2023-07-18/",
    "title": "China may launch next-generation crewed spacecraft as early as 2027",
    "text": "BEIJING, July 18 (Reuters) - China's next-generation crewed spacecraft, which can transport up to seven astronauts, may fly for the first time between 2027 and 2028, a veteran Chinese astronaut said.\nChina's manned space flights began in 2003 when former fighter pilot, Yang Liwei, was sent into orbit in a small bronze-coloured capsule, the Shenzhou-5, becoming China's first man in space and an instant hero cheered by millions at home.\n\"In the future, a new generation of spacecraft will be used on crewed lunar missions, to build our space station, and for deep-space exploration,\" the state-run Guangzhou Daily cited Yang as saying at a Chinese university on Monday.\nRecent tests on the return capsule of the next-generation spacecraft have been \"very successful\", with their first flights estimated to take place between 2027 and 2028, said Yang, currently deputy chief designer of China's manned spaceflight project.\nThe next-generation spacecraft was first tested in 2020.\nSince China's space station became operational late last year, the focus has returned to a project to send astronauts to the moon by 2030, with engineers recently disclosing more details of the plan - from the type of carrier rockets to be used to the spacecraft transporting astronauts and other equipment.\nChina's current Shenzhou spacecraft, based on Russia's Soyuz, can transport up to three astronauts to low-Earth orbit. It consists of a life-support and propulsion module, an in-orbit module for short-term human habitation, and a re-entry capsule for their return to earth.\nThe new generation of crewed spacecraft will comprise just two parts - the propulsion and the return modules - to allow for bigger modules and larger carrying capacity of up to seven people, Zhang Bainan, chief designer of the trial version of the new-generation spacecraft, said in 2020.\nThe return module's high heat resistance also allows much of it to be re-used.\nReporting by Ryan Woo; Editing by Sharon Singleton\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-18 07:59:56"
}