{"article_id": 45, "url": "https://www.businesswire.com/news/home/20230221005917/en/Alcott-Enterprises-and-Flourish-Software-Partner-to-Deliver-Leading-I.T.-Solutions-for-Cannabis-Operators", "title": "Alcott Enterprises and Flourish Software Partner to Deliver Leading I.T. Solutions for Cannabis Operators", "text": "LOS ANGELES--(BUSINESS WIRE)--Alcott Enterprises, a national information technology consulting and managed service company, is pleased to announce its partnership with Flourish Software, a leading cannabis ERP and supply chain seed-to-sale tracking solution.\nAs the cannabis industry continues to expand rapidly, operators are under pressure to be capital efficient, especially as certain markets mature and require sophisticated I.T. systems to remain competitive. The Alcott Enterprises team will work alongside the Flourish team to provide enhanced technical expertise, implementation services, support, and integration capabilities for Flourish customers. The partnership elevates and streamlines Flourish implementations by providing technical advice and managed infrastructure support for Flourish's current and future customers. The collaboration between Alcott and Flourish is already helping Kurvana®, a top California brand, better drive revenue and rationalize its I.T. spending.\n\"We are excited to be partnering with the Flourish team. Their industry-leading cannabis ERP and supply chain solution is critical for many cannabis organizations. This partnership will add tremendous value to Flourish's customer base. By having a go-to technical team with cannabis industry knowledge, the Alcott team can help speed up implementations, integrate additional systems, and support customers' infrastructures,\" said Jordan Alcott, Founder and CEO of Alcott Enterprises.\n\"Partnerships and integrations are core to providing customers with the tools and services they need to succeed in this rapidly growing market,\" said Colton Griffin, CEO of Flourish Software. \"We are thrilled to partner with Alcott Enterprises, a company with a proven track record of delivering exceptional I.T. solutions to help drive measurable returns for leading cannabis operators across the country.\"\nAbout Alcott Enterprises\nBased in Los Angeles, CA, Alcott Enterprises offers over 50+ years of combined industry experience developing strategic alignment of business and technology, enabling digital transformations, and managing technical infrastructures working with startups to Fortune 500 companies. Our experts have been providing information technology consulting services for companies of all sizes across various industries and building next-generation company infrastructures that leverage the Cloud, A.I., and Machine Learning. For more information and updates, visit www.alcottenterprises.com.\nAbout Flourish Software\nFlourish Software is a leading seed-to-sale supply tracking and chain management platform built specifically for the cannabis, CBD, and hemp industries and deployed across 20+ states and Canada. Companies that cultivate, extract, manufacture, distribute, or retail cannabis, CBD, or hemp use Flourish's software to drive their supply chain operations, manage costs, and stay compliant. Find out more by visiting www.flourishsoftware.com", "date": null}