{
    "article_id": 84,
    "url": "https://techcrunch.com/2023/07/19/netflix-account-password-sharing-crackdown/",
    "title": "Netflix brings password-sharing crackdown to India and every other market",
    "text": "Netflix is bringing password-sharing crackdown to consumers in India and every other market starting today, the global streaming giant said after a limited rollout of the restriction helped the firm sign up nearly 6 million subscribers in the quarter ending June.\nThe streaming giant said it will start to address account sharing between households in almost all of its remaining countries starting Thursday. Netflix, which once supported the practice of account password-sharing, now finds it posing complex challenges to its business prospects.\nIt began testing the restriction last year, much to many subscribers’ chagrin, and expanded it to a number of other countries including Canada, New Zealand, Portugal, Spain and the U.S. in 2023. In some aforementioned markets, Netflix allowed those sharing the password to pay extra to accommodate their friends.\nThe firm has clarified that it won’t be introducing an additional membership option for customers in countries where it’s newly enforcing account sharing restrictions. The reason behind this decision is the relatively low market penetration in these markets, along with the availability of more economical Netflix subscription tiers, the company wrote in a letter to shareholders.\n“In these markets, we’re not offering an extra member option given that we’ve recently cut prices in a good number of these countries (for example, Indonesia, Croatia, Kenya, and India) and penetration is still relatively low in many of them so we have plenty of runway without creating additional complexity. Households borrowing Netflix will be able to transfer existing profiles to new and existing accounts.”\nNetflix’s password-sharing crackdown helped deliver a robust subscriber growth in the quarter ending June, the company said on Wednesday. Following a loss of nearly 1 million customers in the same quarter last year, the company said it now gained 5.9 million subscribers. This increase is largely due to individuals who, no longer able to share the service at no cost, have chosen to pay for their own accounts.\nNetflix CFO Spence Neumann said that the revenue growth for the firm is “largely driven by our paid sharing rollout.” He added: “It is our primary revenue accelerator in the year, and we expect that impact … to build over several quarters.”\nThe ongoing effort against password-sharing could potentially further challenge Netflix’s competitive edge in various markets. Take India, for example, where Netflix faces stiff competition from JioCinema, a platform backed by James Murdoch and Mukesh Ambani. JioCinema not only streams numerous popular shows and movies from NBC, HBO, and Warner Bros., but it also hosts some of the region’s most sought-after sporting events. JioCinema’s annual subscription costs about $12.",
    "date": "2023-07-19 00:00:00"
}