{"article_id": 47, "url": "https://www.businesswire.com/news/home/20230224005011/en/%C2%A0Crystal-Group-adds-speed-density-and-memory-to-compute-solutions-with-latest-generation-Intel-Xeon%C2%AE-Scalable-processor", "title": "Crystal Group adds speed, density and memory to compute solutions with latest generation Intel Xeon® Scalable processor", "text": "Sapphire Rapids delivers an average of 53% performance gain over the prior generation.* (Photo: Business Wire)\nSapphire Rapids delivers an average of 53% performance gain over the prior generation.* (Photo: Business Wire)\nHIAWATHA, Iowa--(BUSINESS WIRE)--Crystal Group, Inc., the most trusted designer and manufacturer of rugged high-performance edge compute solutions, announced today the integration of the 4th generation Intel® Xeon® scalable processor (code named Sapphire Rapids) into their portfolio of rugged hardware.\nThe 4th Gen Intel Xeon Scalable processors are Intel’s most sustainable data center processors ever, delivering a range of features for managing power and performance, and bringing support for PCIe 5.0, DDR5, Computer Express Link (CXL) and solution security.\nPCIe 5.0 doubles the speed over PCIe 4.0 by adding more lanes to the CPU, in turn increasing speed. More speed is essential for functions like inference, encryption, decryption and processing.\nDDR5 increases density, which improves system size, weight and power (SWaP). It also brings memory at a lower voltage, which means less power lost to heat.\nCXL reduces the need for the CPU to be involved in PCIe transactions, making the CPU available for more data processing.\nCompute system security is enhanced with the addition of Total Memory Encryption (TME) and Trust Domain Extensions (TDX). Software Guard Extensions (SGX) was introduced with the previous generation, Ice Lake, and will also be included in Sapphire Rapids.\n“Sapphire Rapids provides a leap forward in CPU performance that can be used for edge computing when latency is critical,” says Jim Shaw, executive vice president at Crystal Group. “We see immediate applications in the artificial intelligence (AI) space for these technologies and have delivered several customer demo units which have been enthusiastically received.”\nCrystal Group’s unique thermal management techniques and extensive experience in putting high Thermal Design Power (TDP) processors into rugged servers—like the FG2 1U, 2U and 3U servers—are essential to successfully navigating the Sapphire Rapids implementation in the industry.\nAbout Crystal Group, Inc.\nCrystal Group, Inc. is a leading provider of high-performance, rugged compute solutions for defense, government, and industrial markets. Founded in 1987, this small, employee-owned business specializes in the design, customization, build and testing of rugged servers, embedded computers, networking devices, displays, and data storage for high reliability in harsh environments.\nTheir integrated solutions meet or exceed IEEE, IEC, and military standards, including MIL-STD-810, 167-1, 461, and MIL-S-901, to bring seamless, real-time artificial intelligence, autonomy and cybersecurity to demanding edge applications. All products are manufactured in the company’s U.S. facility, certified to ISO 9001:2015/AS9100D standards and are backed by a five-plus-year warranty.\n©2023 Crystal Group, Inc. All rights reserved. All marks are property of their respective owners. Design and specifications are subject to change.\n*See [G1] at intel.com/processorclaims: 4th Gen Intel® Xeon® Scalable processors. Results may vary.", "date": null}