{
    "article_id": 95,
    "url": "https://techcrunch.com/2023/07/19/chinas-openai-challenger-zhipu-ai-gets-meituan-funding/",
    "title": "China’s OpenAI challenger Zhipu AI gets Meituan funding",
    "text": "Zhipu AI, one of China’s most promising challengers to OpenAI, has received funding from the country’s food delivery giant Meituan, which has a market cap of around $100 billion at the time of writing.\nAn affiliate of Zhipu AI recently added a Meituan subsidiary as its shareholder, which now owns a 10% stake in the firm, local media reported citing business filing information. The startup hasn’t disclosed its exact funding to date, only saying it raised “hundreds of million yuan” ($1 = 7.23 yuan) from a Series B round last September. Its investors include Qiming Venture Partners, Legend Capital and Tsinghua Holdings.\nA multitude of Chinese companies are working to develop large language models (LLMs) that could potentially challenge their Western equivalents. One such company, Zhipu AI, hails from the academic realm, having spun out of the country’s prestigious Tsinghua University. Founded in 2019, the startup is led by Tang Jie, a professor in the university’s Department of Computer Science and Technology.\nZhipu recently open-sourced its bilingual (Chinese and English) conversational AI model ChatGLM-6B, which is trained on six billion parameters and claims to be able to carry out inferences on a single consumer-grade graphics card, significantly lowering the cost of running an LLM. It also previously open-sourced a more robust, general-purpose variant, the GLM-130B trained on 130 billion parameters. Its user-facing chatbot app ChatGLM is currently in a close beta phase. first targeted at academic and industry players.\nMeituan’s investment came at a curious time. Just three weeks ago, the Chinese internet giant announced it would be acquiring Light Years Beyond, another prominent LLM player in China, for a hefty $234 million, despite the startup’s inception only four months prior. The change in ownership came after Light Years Beyond’s founder, Wang Huiwen, who’s also the billionaire co-founder of Meituan, announced his resignation from all corporate roles at the food delivery giant due to health reasons.\nThese investments are expected to give Meituan’s AI capabilities a big talent boost. In turn, the AI firms stand to gain by potentially tapping Meituan’s vast reach of 450 million users ordering food, buying groceries, or booking hotels with the on-demand platform.",
    "date": "2023-07-19 00:00:00"
}