{"article_id": 29, "url": "https://apnews.com/article/technology-microsoft-corp-european-union-europe-business-9fb6512145324350ffe56c98968b0af8", "title": "Microsoft makes case for Activision merger amid EU scrutiny", "text": "Microsoft President Brad Smith addresses a media conference regarding Microsoft's acquisition of Activision Blizzard and the future of gaming in Brussels, Tuesday, Feb. 21, 2023. (AP Photo/Virginia Mayo)\nMicrosoft President Brad Smith addresses a media conference regarding Microsoft's acquisition of Activision Blizzard and the future of gaming in Brussels, Tuesday, Feb. 21, 2023. (AP Photo/Virginia Mayo)\nBRUSSELS (AP) — Microsoft’s Xbox video game division on Tuesday announced new partnerships with Nintendo and chipmaker Nvidia as it tries to persuade European regulators to approve its planned $68.7 billion takeover of game publishing giant Activision Blizzard.\nA key audience for the announcements were the European Union antitrust regulators who held a closed-door meeting Tuesday with executives from Microsoft and some of its competitors, including Sony and Google.\nMicrosoft announced a 10-year agreement with chipmaker Nvidia to bring Xbox games to Nvidia’s cloud gaming service. Microsoft also said it has now signed a similar deal with Nintendo, formalizing a commitment it revealed late last year .\nWhat it does not have is an agreement with Xbox’s chief rival, PlayStation-maker Sony, which has sought to convince antitrust regulators around the world to stop the Activision Blizzard merger.\nThe all-cash deal, which is set to be the largest in the history of the tech industry, faces pushback from regulators in the U.S. and Europe because it would give Microsoft control of popular game franchises such as Call of Duty, World of Warcraft and Candy Crush.\nThe European Commission, the 27-nation bloc’s executive arm, has been investigating whether the merger would distort fair competition to popular Activision Blizzard game titles. It’s scheduled to make a decision by March 23.\nMicrosoft first announced the agreement to buy the California-based game publisher early last year, but the takeover has also been stalled in the U.S., where the Federal Trade Commission has sued to block the deal, and in Britain, where an antitrust watchdog’s provisional report said it will stifle competition and hurt gamers.\nMicrosoft, which is based in Redmond, Washington, has been counting on getting approval in either the EU or Britain to help advance its case in the U.S.\nMicrosoft’s president, Brad Smith, said at a Brussels news conference after meeting with regulators Tuesday that he was “not in a position to say exactly what was said in the hearing room” but emphasized that Xbox has a much smaller share of the market than PlayStation does in Europe, and asserted that the deal would be good for the industry by bringing more games to more people.\n“For us at Microsoft, this has never been about spending $69 billion so that we could acquire titles like Call of Duty and make them less available to people,” Smith said. “That’s actually not a great way to turn a $69 billion asset into something that will become more valuable over time.”", "date": "2023-02-21 20:28:38"}