{"article_id": 55, "url": "https://apnews.com/article/france-macron-pensions-strikes-protests-7a0a5de9d2073c413615e571d852ba42", "title": "French protests drag on after Macron’s pension plan push", "text": "Oil workers stand in the tear gas thrown by riot police as they block the access to an oil depot in Fos-sur-Mer, southern France, Tuesday, March 21, 2023. The bill pushed through by President Emmanuel Macron without lawmakers' approval still faces a review by the Constitutional Council before it can be signed into law. Meanwhile, oil shipments in the country were disrupted amid strikes at several refineries in western and southern France. (AP Photo/Daniel Cole)\nOil workers stand in the tear gas thrown by riot police as they block the access to an oil depot in Fos-sur-Mer, southern France, Tuesday, March 21, 2023. The bill pushed through by President Emmanuel Macron without lawmakers' approval still faces a review by the Constitutional Council before it can be signed into law. Meanwhile, oil shipments in the country were disrupted amid strikes at several refineries in western and southern France. (AP Photo/Daniel Cole)\nPARIS (AP) — French garbage collectors, refinery workers and others were striking again on Tuesday against President Emmanuel Macron’s decision to force the divisive bill raising the retirement age from 62 to 64 through without a vote in parliament.\nMacron’s move infuriated many in the country.\nParis police said Tuesday that 234 people were arrested overnight in the capital mostly for setting fire to garbage in the streets.\nMostly small, scattered protests were held in cities around France, some degenerating into violence late Monday. In Paris, small groups took to the streets to set fire to piles of trash that have formed because of a strike by garbage collectors in the capital that is in its 16th day.\nParis police prefect Laurent Nunez said the violence was caused by groups of up to 300 people quickly moving through the capital.\nNunez news broadcaster BFM TV that he ordered an internal investigation after an officer was filmed punching a man who was walking backwards, making him fall to the ground. The video has been widely shared on French social media.\nPrime Minister Elisabeth Borne expressed the government’s “solidarity” towards 400 police officers who have been injured in recent days, including 42 overnight.\nMacron has planned a series of political meetings on Tuesday with the prime minister, parliamentary leaders and lawmakers from his centrist alliance, one day after the government survived to two no-confidence motions .\nThe 45-year-old French president, who made the pension plan a centerpiece of his second term, will speak Wednesday on national television — the first time since he made the decision last week to use a government’s special constitutional power to force the bill through parliament. He’s expected to back his government.\nSpeaking at the lower chamber of parliament Tuesday, Borne vowed to continue to work “in the coming months to seek the best responses to the concerns of the French” including through “compromises and work with lawmakers.”\nBut leftist lawmaker Mathilde Panot warned Borne that “you will yield.”\n“There are not many options left to Emmanuel Macron,” Panot added, demanding that the pension bill be withdrawn or new legislative elections be called.\nThe bill still faces a review by the Constitutional Council before it can be formally signed into law.\nPrime Minister Elisabeth Borne is going to refer the issue to the body to accelerate the process, her office said. Some opposition lawmakers from the far right also have filed a request, and leftists are expected to do the same.\nThe Constitutional Council can reject articles within the measure if they aren’t in line with the constitution. Opponents argue that the text as a whole should be rejected.\nParis police authorities said in a statement Tuesday that they ordered garbage employees to work in order to ensure a “minimum service.” It said that 674 staff have been covered by the orders, allowing 206 garbage trucks to operate since last week.\nMeanwhile, oil shipments in the country were partially disrupted amid strikes at several refineries in western and southern France.\nThe Energy Transition Ministry said Tuesday that it would require some employees who are “indispensable to the functioning” of the Fos-sur-Mer oil depot, in southern France, to return to work. The move led some protesters to head to the site to support strikers.\nSome tensions have erupted between protesters trying to block access to the site, some throwing stones, and police using tear gas to move them away.\nThe Fos-sur-Mer depot supplies fuel for gas stations in the southeast of France, which currently are the most affected by shortages. French government spokesperson Olivier Veran warned that more orders may follow in the coming days for other sites.\nUnions have called for new nationwide protests on Thursday to demand the government simply withdraw the retirement bill.", "date": "2023-03-21 11:00:40"}