{
    "article_id": 97,
    "url": "https://techcrunch.com/2023/07/19/with-37m-seed-round-maka-motors-begins-ev-pilot-on-indonesias-streets/",
    "title": "With $37M seed round, Maka Motors begins EV pilot on Indonesia’s streets",
    "text": "A recent report said that Indonesia’s electric vehicle (EV) market is projected to reach $20 billion by 2029, up from $533 million in 2022. Moreover, as much as half of the overall motorbike market in Southeast Asia could be replaced by electric two-wheelers by 2030, McKinsey associate partner Rahul Gupta said at the G20 summit last year.\nToday, an Indonesian electric vehicle maker called Maka Motors said it has raised a $37.6 million seed round, one of Southeast Asia’s biggest seed fundings, to mass produce its two-wheeled EVs, aiming for late 2024. Maka will start deploying its first pilot electric vehicles this month.\nThe seed money will also enable Maka to continue R&D for its in-house development of EVs, which started last year, as well as to build its factory in West Java, starting later in 2023.\nAC Ventures, Korea’s SV Investment and East Ventures co-led the latest capital. Other investors in the round include Northstar Group, Provident, Alfa Crop, Skystar Capital, Peak XV Partners (formerly known as Sequoia India and SEA), Openspace Ventures, Shinhan Venture Investment, Beenext, Kinesys and M Venture Partners (MVP).\nMaka Motors CEO Raditya Wibowo and CTO Arief Fadillah, who previously worked at Gojek, founded Maka in 2021 to accelerate electric motorcycle adoption in Indonesia.\n“Like many Indonesians, we, founders, have been motorcycle users since a young age and we have also worked extensively with ride-hailing drivers at Gojek since 2015,” Wibowo said in an email interview with TechCrunch. “Indonesia is the world’s third-largest market for powered two-wheeled [vehicles], but EV penetration is still relatively low.”\nThe startup says existing players in Indonesia, with only a fleet of 43,000 registered electric motorcycles, have not fully met the country’s goal, which aims to produce 600,000 electric vehicles by 2030. Indonesia has more than 127 million motorbikes, most of which work on gasoline.\n“Many current two-wheeled EV products are imported as Completely Knocked Down (CKD) kits from China and are designed for the needs of users in China,” the CEO said. “These 2W [two-wheel] vehicles designed in China, though relatively affordable, are not yet able to replace the gasoline motorcycles most Indonesian users use today.”\nIn Indonesia, 2W vehicles require enough power to overtake cars as riders share the same lane as cars, the average travel distances are longer (than in China), and it is common to carry adult passengers, unlike China. Another pain point is cost, Wibowo said. Most 2W EV products with larger batteries and more motor power are more expensive than a gasoline bike.\nMaka’s mission is to build the best electric motorcycle, which can benefit Indonesian users to save money on gas. The two-year-old startup says it wants to offer a blend of driving range, power, usability, and durability at a competitive price compared to current bikes for Indonesian riders.\nRide-hailing company Gojek mapped out to switch every vehicle to electric by 2030, and Grab Indonesia targeted to operate at least 85,000 EVs in Indonesia this year.\n“Indonesia’s EV two-wheeler penetration currently sits at 0.2% of the market (relative to internal combustion engine motorbikes), with an opportunity to exceed 10% over the next five years, provided that public and private stakeholders work together to build a conducive local EV sector,” said Michael Soerijadji, founder and managing partner at AC Ventures. “We believe that Maka Motors will be a game-changer in one of the world’s biggest two-wheeler markets. We stand behind the team’s deep knowledge of the local market, gained through comprehensive research and industry experience.”\nThe company has around 40 staff members on its team. Many of its team have previously worked for gasoline motorcycle manufacturers in Indonesia and global automotive companies in Japan and Germany.",
    "date": "2023-07-19 00:00:00"
}