{"article_id": 35, "url": "https://apnews.com/article/amazon-layoffs-jobs-cuts-jassy-0e857f39702de134c8f677c5b5731688", "title": "Amazon cuts 9,000 more jobs, bringing 2023 total to 27,000", "text": "FILE - An Amazon logo appears on a delivery van, Oct. 1, 2020, in Boston. Amazon plans to eliminate 9,000 more jobs in the next few weeks, the company's CEO Andy Jassy said in a memo to staff on Monday, March 20, 2023. The job cuts would mark the second largest round of layoffs in the company's history, adding to the 18,000 employees the company said it would lay off in January. (AP Photo/Steven Senne, File)\nFILE - An Amazon logo appears on a delivery van, Oct. 1, 2020, in Boston. Amazon plans to eliminate 9,000 more jobs in the next few weeks, the company's CEO Andy Jassy said in a memo to staff on Monday, March 20, 2023. The job cuts would mark the second largest round of layoffs in the company's history, adding to the 18,000 employees the company said it would lay off in January. (AP Photo/Steven Senne, File)\nNEW YORK (AP) — Amazon plans to eliminate 9,000 more jobs in the next few weeks, CEO Andy Jassy said in a memo to staff on Monday.\nThe job cuts would mark the second largest round of layoffs in the company’s history, adding to the 18,000 employees the tech giant said it would lay off in January. The company’s workforce doubled during the pandemic, however, in the midst of a hiring surge across almost the entire tech sector.\nTech companies have announced tens of thousands of job cuts this year.\nIn the memo, Jassy said the second phase of the company’s annual planning process completed this month led to the additional job cuts. He said Amazon will still hire in some strategic areas.\n“Some may ask why we didn’t announce these role reductions with the ones we announced a couple months ago. The short answer is that not all of the teams were done with their analyses in the late fall; and rather than rush through these assessments without the appropriate diligence, we chose to share these decisions as we’ve made them so people had the information as soon as possible,” Jassy said.\nThe job cuts announced Monday will hit profitable areas for the company including its cloud computing unit AWS and its burgeoning advertising business. Twitch, the gaming platform Amazon owns, will also see some layoffs as well as Amazon’s PXT organizations, which handle human resources and other functions.\nPrior layoffs had also hit PXT, the company’s stores division, which encompasses its e-commerce business as well as company’s brick-and-mortar stores such as Amazon Fresh and Amazon Go, and other departments such as the one that runs the virtual assistant Alexa.\nEarlier this month, the company said it would pause construction on its headquarters building in northern Virginia, though the first phase of that project will open this June with 8,000 employees.\nLike other tech companies, including Facebook parent Meta and Google parent Alphabet , Amazon ramped up hiring during the pandemic to meet the demand from homebound Americans that were increasingly buying stuff online to keep themselves safe from the virus.\nAmazon’s workforce, in warehouses and offices, doubled to more than 1.6 million people in about two years. But demand slowed as the worst of the pandemic eased. The company began pausing or cancelling its warehouse expansion plans last year.\nAmid growing anxiety over the potential for a recession, Amazon in the past few months shut down a subsidiary that’s been selling fabrics for nearly 30 years and shuttered its hybrid virtual, in-home care service Amazon Care among other cost-cutting moves.\nJassy said Monday given the uncertain economy and the “uncertainty that exists in the near future,” the company has chosen to be more streamlined.\nHe said the teams that will be impacted by the latest round of layoffs are not done making final decisions on which roles will be eliminated. The company plans to finalize those decisions by mid to late April and notify those who will be laid off.", "date": "2023-03-20 14:54:34"}