{
    "article_id": 88,
    "url": "https://techcrunch.com/2023/07/20/indrive-brings-its-bid-based-ride-hail-app-to-the-us/",
    "title": "InDrive brings its ‘bid-based’ ride-hail app to the US",
    "text": "InDrive (formerly inDriver) is bringing a new type of ride-hailing app to South Florida. The startup operates a “bid-based” platform wherein passengers can name their own fare for a ride, and nearby drivers can accept, decline or counter the offer.\nAt a time when ride-hail customers are feeling squeezed by higher fares and drivers are classified as independent contractors but given no say over how much they charge for rides, such a business model can be attractive.\nInDrive officially launched in Miami, its first U.S. market, Thursday. The company says it has more than 175 million downloads and is present in 655 cities across 48 countries.\nIf you’ve never heard of InDrive, it might be because the company has more of a presence outside the traditional Western world. Originally from Siberia, InDrive divested its Russian entity in July 2022 after Russia’s war with Ukraine began in March that year. The company says it has no other plans for investment in Russia.\nInDrive’s top markets are in Latin America (Mexico, Colombia, Peru, Brazil, Chile, Ecuador) and Asia (Kazakhstan, Indonesia, Pakistan, India).\nIn February InDrive raised $150 million in debt financing from General Catalyst, and since then has been expanding aggressively into new territories. The company recently announced plans to expand to 15 new cities in Nigeria, and has had a presence in Africa for years.\nSo why America, and why now? Adam Warner, U.S. country manager, told TechCrunch that InDrive’s strong foothold in LatAm was one of the drivers for launching in South Florida, specifically Miami.\n“We’ve really built our entire business model guided on freedom of choice,” said Warner. “Our pricing is not determined by some kind of computer program. It’s really open for drivers and passengers to negotiate the price of each ride, while drivers are also not penalized for declining orders. So unlike my peers, we put the drivers and consumers first by bringing transparency and fairness to ride-sharing.”\nSounds great! What could go wrong?\nApparently a few things.\nA quick perusal of app reviews demonstrate a plethora of issues customers have had with the app and the service — issues that probably won’t fly with an American audience.\nUber and Lyft, for all their questionable ethics, ensure reliable rides and service by hitting drivers with a combination of incentives and punishments for accepting or declining rides. InDrive has more of a conscience, but that could lead to longer wait times for riders or riders repeatedly getting canceled on.\nWarner said InDrive is working on its marketing push to get as many drivers signed up as possible so that if one driver cancels, there will be another waiting in the wings. One way the company is attracting drivers is by refraining from charging a commission from July 2023 to January 2024, meaning the drivers will take home up to 100% of each fare (subject to airport fees and highway tolls). InDrive’s usual fee is around 10% of each ride. Uber and Lyft take 25%.\nThe company is also promising to maintain a minimum ride price of $10 in Miami. Today, InDrive has 3,500 drivers in South Florida signed up for launch.\nCustomers also complained about InDrive’s customer service being sub-par when dealing with issues like frequent driver cancellations, or drivers changing up the agreed upon fare at pickup. Warner said InDrive has customer service teams in Mexico and Malaysia (but crucially not in the U.S.) to deal with any issues that come up.\nInDrive has raised about $387 million in total, according to Crunchbase. That’s not a small number, but compared to competitors, it does mean InDrive has had to stay lean, which can affect the quality of the product. Customers reviewing the app also complained that it was buggy, that ETAs were off, and that drivers didn’t always know how to get from A to B. Part of that last problem is because InDrive doesn’t have its own proprietary mapping and GPS system, as its peers do, which Warner says is a huge cost.\n“We give the drivers the freedom of choice to be able to switch on their own mapping services,” said Warner. “We’re not heavily invested into that particular part of it. We rely pretty heavily on partnerships with Google Maps, Waze, Apple Maps, et cetera.”\nIf InDrive wants to compete with the likes of Uber and Lyft, it’ll have to get its customer service and app sorted. But that’s not impossible, and InDrive isn’t in a huge rush to take over the U.S.\nWarner said the company is focused on solving the transportation needs in South Florida first, and doing so in a way that’s sustainable.\n“InDrive is definitely open to expanding its footprint in the United States, really focusing on markets with insufficient mobility and public transportation options,” said Warner. “Also markets that have high travel costs and emerging tourism.”",
    "date": "2023-07-20 00:00:00"
}