{"article_id": 11, "url": "https://www.reuters.com/business/autos-transportation/volkswagen-build-own-plant-us-scout-brand-automobilwoche-2023-02-24/", "title": "Volkswagen to build own US plant for Scout brand - Automobilwoche", "text": "BERLIN, Feb 24 (Reuters) - Volkswagen Group (VOWG_p.DE) will build its own production plant in the United States for its new Scout brand rather than collaborating with a partner, industry publication Automobilwoche reported on Friday, citing company sources.\nVolkswagen said last May it planned to reintroduce the Scout off-road brand, creating a separate, independent company to build Scout trucks and SUVs starting in 2026 that will be designed, engineered, and manufactured in the United States for U.S. customers.\nAutomobilwoche had reported in November that the carmaker was in talks with Foxconn (2317.TW), which has expanded into building electric vehicles (EVs) for auto brands, and Magna International subsidiary Magna Steyr (MG.TO) about building a joint plant.\nBuilding its own plant was the least likely option, the publication reported at the time, also citing company sources.\nVolkswagen is expanding its existing U.S. plant in Chattanooga, Tennessee, to produce the ID. Buzz. However, the Scout brand will build off-road electric pick-up trucks and SUVs that require a new platform and the Chattanooga plant does not have enough space to do it all, a source told Reuters last May.\nA spokesperson for Volkswagen said that a decision on whether to open a plant for Scout had not yet been made but that production was still due to begin 2026 as previously stated.\nVolkswagen-owned Audi's CEO Markus Duesmann said in an interview on Friday that the premium brand could build a plant in the U.S. either alone or together with the Volkswagen Group for EVs, though no decision had been made on that either.\nReporting by Jan Schwartz, Victoria Waldersee, Writing by Friederike Heine, Editing by Paul Carrel, Miranda Murray and Keith Weir\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-24 00:00:00"}