{"article_id": 26, "url": "https://apnews.com/article/technology-mobile-phones-business-software-522a2225391a968ee1d791e32d8b91eb", "title": "Microsoft brings Bing chatbot to phones after curbing quirks", "text": "FILE - The Microsoft Bing logo and the website's page are shown in this photo taken in New York on Tuesday, Feb. 7, 2023. Microsoft is ready to take its new Bing chatbot mainstream — less than a week after making major fixes to stop the artificially intelligent search engine from going off the rails. The company said Wednesday, Feb. 22, it is bringing the new AI technology to its Bing smartphone app, as well as the app for its Edge internet browser. (AP Photo/Richard Drew)\nFILE - The Microsoft Bing logo and the website's page are shown in this photo taken in New York on Tuesday, Feb. 7, 2023. Microsoft is ready to take its new Bing chatbot mainstream — less than a week after making major fixes to stop the artificially intelligent search engine from going off the rails. The company said Wednesday, Feb. 22, it is bringing the new AI technology to its Bing smartphone app, as well as the app for its Edge internet browser. (AP Photo/Richard Drew)\nMicrosoft is ready to take its new Bing chatbot mainstream — less than a week after making major fixes to stop the artificially intelligent search engine from going off the rails .\nThe company said Wednesday it is bringing the new AI technology to its Bing smartphone app, as well as the app for its Edge internet browser, though it is still requiring people to sign up for a waitlist before using it.\nPutting the new AI-enhanced search engine into the hands of smartphone users is meant to give Microsoft an advantage over Google, which dominates the internet search business but hasn’t yet released such a chatbot to the public.\nIn the two weeks since Microsoft unveiled its revamped Bing, more than a million users around the world have experimented with a public preview of the new product after signing up for a waitlist to try it. Microsoft said most of those users responded positively, but others found Bing was insulting them, professing its love or voicing other disturbing or bizarre language.\nPowered by some of the same technology behind the popular writing tool ChatGPT, built by Microsoft partner OpenAI , the new Bing is part of an emerging class of AI systems that have mastered human language and grammar after ingesting a huge trove of books and online writings. They can compose songs, recipes and emails on command, or concisely summarize concepts with information found across the internet. But they are also error-prone and unwieldy.\nReports of Bing’s odd behavior led Microsoft to look for a way to curtail Bing’s propensity to respond with strong emotional language to certain questions. It’s mostly done that by limiting the length and time of conversations with the chatbot, forcing users to start a fresh chat after several turns. But the upgraded Bing also now politely declines questions that it would have responded to just a week ago.\n“I’m sorry but I prefer not to continue this conversation,” it says when asked technical questions about how it works or the rules that guide it. “I’m still learning so I appreciate your understanding and patience.”\nMicrosoft said its new technology will also be integrated into its Skype messaging service.", "date": "2023-02-22 13:01:19"}