{"article_id": 49, "url": "https://www.reuters.com/lifestyle/science/nasa-spacex-postpone-launch-next-space-station-crew-2023-02-27/", "title": "NASA, SpaceX postpone launch of next space station crew at 11th hour", "text": "[1/3] A Falcon 9 rocket is readied before launch on NASA's SpaceX Crew-6 mission, which will take four crew members to the International Space Station, from the Kennedy Space Center in Cape Canaveral, Florida, U.S., February 26, 2023. REUTERS/Joe Skipper\nCAPE CANAVERAL, Fla., Feb 27 (Reuters) - NASA and SpaceX early on Monday postponed the launch of a capsule containing two U.S. astronauts, a Russian cosmonaut and a United Arab Emirates crewmate minutes before scheduled lift-off from Florida on a flight to the International Space Station.\nThe U.S. space agency and SpaceX, the private rocket company founded by billionaire Elon Musk, cited a technical glitch concerning the ignition fluid used to start the spacecraft's engines.\nThe countdown had seemed to be progressing smoothly until about two and a half minutes before blastoff, when NASA announced on its live webcast that the launch of the four crew members on a six-month science mission would be postponed.\nThe SpaceX Falcon 9 rocket topped with a Crew Dragon capsule had been scheduled for liftoff at 1:45 a.m. EST (0645 GMT) from NASA's Kennedy Space Center in Cape Canaveral, Florida.\nThe first backup launch opportunity for the mission was set for early Tuesday, about 24 hours from the initial attempt to get the rocket off the ground.\nNeither NASA nor SpaceX immediately said how long it might actually take before they would be ready to try again. Eleventh-hour launch scrubs are fairly routine in the highly complex and risky endeavor of human spaceflight.\nHad Monday's launch been a success, it was expected to take the crew about 25 hours to reach their destination at the International Space Station (ISS), a laboratory orbiting about 250 miles (420 km) above Earth.\nDesignated Crew 6, the mission will carry the sixth long-duration ISS team that NASA has flown aboard SpaceX since Musk's California-based company began sending American astronauts to orbit in May 2020.\nThe latest ISS crew is led by mission commander Stephen Bowen, 59, a one-time U.S. Navy submarine officer who has logged more than 40 days in orbit as a veteran of three space shuttle flights and seven spacewalks.\nFellow NASA astronaut Warren \"Woody\" Hoburg, 37, an engineer and commercial aviator designated as the Crew 6 pilot, will be making his first spaceflight.\nThe Crew 6 mission also is notable for its inclusion of UAE astronaut Sultan Alneyadi, 41, only the second person from his country to fly to space and the first to launch from U.S. soil as part of a long-duration space station team. UAE's first-ever astronaut launched to orbit in 2019 aboard a Russian spacecraft.\nRounding out the four-man Crew 6 is Russian cosmonaut Andrey Fedyaev, 41, who like Alneyadi is an engineer and spaceflight rookie designated as a mission specialist for the team.\nFedyaev is the latest cosmonaut to fly aboard an American spacecraft under a ride-sharing deal signed in July by NASA and the Russian space agency Roscosmos, despite heightened tensions between Washington and Moscow over Russia's invasion of Ukraine.\nThe Crew 6 team will be welcomed aboard the space station by seven current ISS occupants - three U.S. NASA crew members, including commander Nicole Aunapu Mann, the first Native American woman to fly to space, along with three Russians and a Japanese astronaut.\nThe ISS, about the length of a football field and the largest human-made object in space, has been continuously operated by a U.S.-Russian-led consortium that includes Canada, Japan and 11 European countries.\nReporting by Joe Skipper in Cape Canaveral and Steve Gorman in Los Angeles; Editing by Will Dunham, John Stonestreet, Gerry Doyle and Nick Macfie\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-27 00:00:00"}