{"article_id": 31, "url": "https://www.cnbc.com/2023/02/23/china-tech-companies-are-closely-watching-chatgpts-ai-skills.html", "title": "China tech companies are closely watching ChatGPT’s A.I. skills. Here’s what they’re doing about it", "text": "A display at the World Artificial Intelligence Conference (WAIC) in Shanghai, China, on Friday, Sept. 2, 2022. Bloomberg | Bloomberg | Getty Images\nBEIJING — The business story of ChatGPT right now is more about what isn't known. Big tech companies in the U.S. and China rushed this month to announce they are working on similar AI tools. Their announcements often referenced Microsoft-backed ChatGPT, while disclosing few details on what they themselves were working on. The artificial intelligence-powered chatbot ChatGPT has taken the tech world by storm in the last few months with its ability to generate everything from poems to business strategies in a human-like conversation. Still, analysts say the tech is transformative, something that's also been said about blockchain and the metaverse.\nCompetitive landscape\nHere's what companies — including those in China — are doing in this specialized area of AI: U.S. startup OpenAI raced to beat rivals by launching ChatGPT in November, according to The New York Times, citing sources. The public interface skyrocketed in popularity for everything from homework help to strategy development. An OpenAI spokesperson said the company did not have anything to add regarding the Times' report.\nwatch now\nwatch now\nChatGPT for business software\nDatabase software startup PingCap already has a ChatGPT-based product on the market. The company has offices in Beijing and San Mateo, California. PingCap launched \"Chat2Query\" for customers outside China in January that uses a publicly available application programming interface from OpenAI. The product lets clients analyze in seconds their companies' operating data — such as best-selling car models — without needing to know a computer programming language, said Liu Song, vice president of PingCap. He said Chat2Query is free for clients processing up to 5 gigabytes of data. \"We think the revolution may not be in AI search but in every business,\" he said in Mandarin, translated by CNBC. However, he noted that those data need to be organized in a standardized way.\nWe think the revolution may not be in AI search but in every business Liu Song PingCap, vice president\nBaidu , the Chinese search engine and tech giant, said Wednesday its AI chatbot project will be embedded into search first, and opened to the public in March. The product is named \"Ernie bot\" in English or \"Wenxin Yiyan\" in Chinese, the company said previously. While little is known about Ernie bot's capabilities — and how they compare with ChatGPT's — Baidu-backed video streaming platform iQiyi has announced plans for connecting to the bot for search and AI-generated content. Baidu-backed electric car startup Jidu — which hasn't started delivering cars yet — also said it plans to incorporate Ernie bot.\nA.I. creative content\nKunlun Tech expects to release an open source Chinese version of ChatGPT, as early as the middle of this year, its president Han Fang told CNBC last week. Open source software is available to the public and allows anyone to see, change or distribute the code. The company, which generates most of its revenue outside China, previously said its niche web browser Opera is planning to incorporate ChatGPT into its products, although it's unclear when or with what functions. Kunlun Tech is already working in the field of AI-generated content, such as music. Fang said his commercialization plan is to first develop those AI tools. Creators can then use the tools to make their own work and publish them on designated platforms for public viewing, following which the company can then sell ads, he said. He expects to launch the platforms later this year.\nTransformative potential\nFang said he was directly inspired by OpenAI's early version of ChatGPT tech in 2020. \"We all talk about the metaverse, but who is in it?\" he said in Mandarin, translated by CNBC. \"It only changed our news. It didn't change our lives.\" In contrast, he said generative AI tech can immediately provide value since it operates where users are already producing and consuming content. Generative AI can also lower production costs, allowing animators and speakers of minority languages to easily create their own content, Fang said.\nThe implications for jobs and industries remain significant.\nThe arrival of AI such as ChatGPT means many “cognitive tasks” look easier to automate than manual work such as in factories — a surprise to many economists, said Anton Korinek, professor at the Department of Economics and Darden School of Business, University of Virginia.\n“The impressive but also little bit scary part is that the power of these systems has been progressing steadily over the past couple of years,” he said, adding that he expects more powerful AI tech this year alone.\n“That will really imply that these models will have a revolutionary impact on our economy, on productivity, on labor markets and ultimately on society in general.”\n— CNBC’s Arjun Kharpal and Lauren Feiner contributed to this report.", "date": "2023-02-23 00:00:00"}