{
    "article_id": 100,
    "url": "https://techcrunch.com/2023/07/19/beijing-robotics-firm-forwardxs-series-c-hits-61-million/",
    "title": "Beijing robotics firm ForwardX’s Series C hits $61 million",
    "text": "ForwardX this week announced an additional $30 million in funding, bringing the Beijing-based firm’s Series C up to $61 million. The funding follows an initial tranche announced way back in December 2021. It brings the warehouse robotics firm’s total funding up to $140 million since its 2016 launch.\nThe last few years have been a good time to be running an autonomous mobile robotics (AMR) company, of course. The early days kicked things into overdrive for companies looking to automate, and the venture capital has followed suit. Even after most geographies have reopened, plenty of factors have continued to drive adoption from the supply chain crunch to labor shortages.\n“Our success in securing this funding reflects the positive momentum we have built over the past few years,” CEO Nicolas Chee said in a release. “ForwardX Robotics has experienced substantial growth across key markets, and we are excited to expand our footprint globally.\nFor its part, ForwardX already boasts an impressive client list, including L’Oréal, IKEA, SF DHL, UNIQLO, Walmart and Mitsubishi. Those are the sorts of names that keep VCs interested. All told, the company says it’s deployed some 3,000 robots across 150 sites on four continents. Presently it’s seeking further expansion into the North American, European, Asian and Australian markets.\nWarehouse, logistics and manufacturing are the primary targets for the company’s ARMs. Unlike much of the competition — which has drilled down on perfecting a single task — ForwardX has been quick to diversify its robot portfolio, with systems that transport, store, pick and dock. Those are maintained by a proprietary fleet management software. It’s effectively a brownfield solution for companies that are looking to automate several steps of the process with robots that can work in concert with one another.\nThere are a lot of different approaches in the space currently. There’s still surprisingly limited penetration of automated systems into warehouses, so there’s a lot of space for a number of different solutions to thrive.",
    "date": "2023-07-19 00:00:00"
}