{"article_id": 14, "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/pfizerbiontech-apply-full-approval-updated-covid-vaccine-2023-02-24/", "title": "Pfizer/BioNTech apply for full FDA approval of updated COVID vaccine", "text": "Feb 24 (Reuters) - Pfizer Inc (PFE.N) and its German partner BioNTech SE (22UAy.DE) said on Friday they filed an application to the U.S Food and Drug Administration (FDA) for a full approval of their Omicron-adapted COVID-19 vaccine.\nThe companies are seeking approval of the updated vaccine both as a primary course and a booster dose for individuals 12 years of age and above.\nAdvisers to the FDA in January had unanimously voted in favor of using the same coronavirus strain for the initial COVID-19 vaccine doses and the boosters to simplify the vaccination regimen in the United States.\nIf the application is approved, individuals will be able to receive the Omicron-adapted vaccine for their primary dose, rather than using the original vaccine for the primary course before having access to the bivalent vaccine, the company said.\nThe updated vaccine is currently available in the United States under emergency-use authorization as a single booster dose for people aged 5 years and above, and as the third dose in the three-dose primary series for children 6 months through 4 years of age.\nU.S. Centers for Disease Control officials in January had said the updated COVID-19 boosters helped prevent symptomatic infections against the new XBB-related subvariants, offering new evidence of how the vaccines perform against these fast-spreading strains.\nIn Europe, the Omicron-tailored vaccine is already authorized by the European Commission for individuals aged 12 years and above.\nThe companies plan to submit applications to the European Medicines Agency to also include the updated vaccine as a primary course of vaccination in individuals aged 5 and older and as a primary course of vaccination and booster dose for children aged 6 months through 4 years.\nReporting by Sriparna Roy in Bengaluru; Editing by Sherry Jacob-Phillips\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-24 00:00:00"}