{"article_id": 25, "url": "https://www.reuters.com/technology/nvidia-forecasts-first-quarter-revenue-above-expectations-2023-02-22/", "title": "As chatbots boom, Nvidia sales outlook beats Wall Street expectations", "text": "Feb 22 (Reuters) - Chip designer Nvidia Corp (NVDA.O) forecast first-quarter revenue above Wall Street estimates on Wednesday as its CEO said use of its chips to power artificial intelligence (AI) services like chatbots had \"gone through the roof in the last 60 days.\"\nThe sales outlook drove Nvidia's shares up 8% in extended trading. The world's largest supplier of chips used in data centers for training AI has become a key hardware supplier for large tech companies such as Microsoft Corp (MSFT.O) that are building services like chat-powered search engines.\nAI is one of the few areas where tech companies are still spending even as the sector slashes jobs. Microsoft and Alphabet Inc (GOOGL.O), for example, are both laying off thousands of employees but are also locked in a race to imbue their search engines with chatbot technology - despite the fact that doing so is likely to add billions of dollars to their operating costs.\nAnalysts believe that Nvidia, more than any other company, is best positioned to benefit from such increased costs as it dominates roughly 80% of the market for graphics processing units, or GPUs, used to speed up AI work.\nOn a conference call with investors, Nvidia Chief Executive Jensen Huang announced a new service in which Nvidia will directly offer its cloud computing service for companies to rent all of its technologies to develop their own \"generative\" AI services that can create text, images and other forms of data.\nAI is still \"not deployed in enterprises broadly, but we believe that by hosting everything in the cloud, from the infrastructure through the operating system software, all the way through pre-trained models, we can accelerate the adoption of generative AI in enterprises,\" Huang said.\nThe company forecast current-quarter revenue of $6.50 billion, plus or minus 2%. Analysts on average expect $6.33 billion in revenue, according to Refinitiv data.\nRevenue in the quarter ended Jan. 29 was $6.05 billion, compared with analysts' average estimate of $6.01 billion.\n\"The launch of generative AI models and the AI arms race taking place should drive accelerated adoption of the company's new H100 products,\" said Logan Purk, an analyst with Edward Jones.\nNvidia's outlook also helped boost the share prices of competitors such as Advanced Micro Devices (AMD.O), whose stocks were up 3% after Nvidia's results.\nThe Santa Clara, California, company got its start in the graphics chip business for PCs by helping video games look more realistic. While its revenue beat Wall Street expectations, Nvidia's sales were still down overall year-on-year as the company weathers a downturn in the PC market.\nBut growth has remained brisk in the market for data center chips. Analysts at Bank of America Global research believe the boom in so-called generative AI like chatbot and image creation services could add $14 billion more to Nvidia's revenue by 2027.\nNvidia's revenue from the data center business was $3.62 billion for the fourth quarter, slightly below analyst estimates of $3.84 billion. Gaming chip sales were $1.83 billion, beating analyst estimates of $1.52 billion, according to Refinitiv data.\nAdjusted profit was 88 cents per share for the fourth quarter, beating analyst estimates of 81 cents.\nReporting by Chavi Mehta in Bengaluru, Stephen Nellis in San Francisco and Jane Lee in Oakland, Calif.; Editing by Shinjini Ganguli, Peter Henderson, Matthew Lewis and Himani Sarkar\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-22 00:00:00"}