{
    "article_id": 72,
    "url": "https://reuters.com/technology/space/ferocious-black-holes-reveal-time-dilation-early-universe-2023-07-03/",
    "title": "Ferocious black holes reveal 'time dilation' in early universe",
    "text": "WASHINGTON, July 3 (Reuters) - Time is a slippery thing, as profound thinkers like physicist Albert Einstein and, well, fictional time traveler Dr. Who plainly understood. The latter, in a 2007 episode of the British sci-fi series, accurately described time as \"wibbly wobbly.\"\nScientists made that point anew on Monday in a study that used observations of a ferocious class of black holes called quasars to demonstrate \"time dilation\" in the early universe, showing how time then passed only about a fifth as quickly as it does today. The observations stretch back to about 12.3 billion years ago, when the universe was roughly a tenth its present age.\nQuasars - among the brightest objects in the universe - were used as a \"clock\" in the study to measure time in the deep past. Quasars are tremendously active supermassive black holes millions to billions of times more massive than our sun, usually residing at centers of galaxies. They devour matter drawn to them by their immense gravitational pull and unleash torrents of radiation including jets of high-energy particles, while a glowing disk of matter spins around them.\nThe researchers used observations involving the brightness of 190 quasars across the universe dating to about 1.5 billion years after the Big Bang event that gave rise to the cosmos. They compared the brightness of these quasars at various wavelengths to that of quasars existing today, finding that certain fluctuations that occur in a particular amount of time today did so five times more slowly in the most ancient quasars.\nEinstein, in his general theory of relativity, showed that time and space are intertwined and that the universe has been expanding outward in all directions since the Big Bang.\nAstrophysicist Geraint Lewis of the University of Sydney in Australia, lead author of the study published in the journal Nature Astronomy, said this continual expansion explains how time flowed more slowly earlier in the universe's history relative to today.\nIt is not as if everything was in slow motion. If you could be transported back to that time, a second would still feel like a second to you. But from the perspective of a person today, a second back then would unfold in five seconds now.\n\"In modern physics, time is a complicated thing,\" Lewis said. \"Dr. Who had it right, that time is best described as 'wibbly-wobbly, timey-wimey stuff.' This means that we don't really understand time and its limitation, and some things are still not ruled out: time travel, warp drives, etc. The future could be very exciting, though maybe not.\"\nBy looking at faraway objects, scientists peer back in time because of how long it takes for light to travel through space.\nScientists previously documented time dilation dating to roughly 7 billion years ago, based on observations of stellar explosions called supernovas. Already knowing the time it takes for today's supernovas to brighten and fade, they studied these explosions in the past - those at great distances from Earth - and found that these events unfolded more slowly then from our time perspective.\nThe explosion of individual stars cannot be seen beyond a certain distance away, limiting their use in studying the early universe. Quasars are so bright that they can be observed back to the universe's infant stages.\n\"What is observed over time is the quasar brightness. This fluctuates up and down, the result of lots of complicated physics in the disk of matter spinning around a black hole at almost light speed. This change in brightness is not simply a bright, fade, bright, fade. It looks more like the stock market, with small scale jitters on longer-term changes, with some sharp fluctuations,\" Lewis said.\n\"The statistical properties of the light variations contain a time scale - a typical time for the fluctuations to possess a particular statistical property. And it is this we use to set the ticking of each quasar,\" Lewis added.\nReporting by Will Dunham, Editing by Rosalba O'Brien\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-03 00:00:00"
}