{
    "article_id": 64,
    "url": "https://reuters.com/technology/space/india-readies-rocket-aimed-landing-moons-south-pole-2023-07-14/",
    "title": "India blasts Chandrayaan-3 lander toward moon's south pole",
    "text": "BENGALURU, July 14 (Reuters) - India's space agency launched a rocket on Friday that sent a spacecraft into orbit and toward a planned landing next month on the lunar south pole, an unprecedented feat that would advance India's position as a major space power.\nThe Indian Space Research Organisation's (ISRO) LVM3 launch rocket blasted off from the country's main spaceport in the southern state of Andhra Pradesh on Friday afternoon, leaving behind a plume of smoke and fire.\nAbout 16 minutes later, ISRO's mission control announced that the rocket had succeeded in putting the Chandrayaan-3 lander into an Earth orbit that will send it looping toward a moon landing next month.\nIf the mission succeeds, India would join a group of three other countries that have managed a controlled lunar landing, including the United States, the former Soviet Union and China.\nThe Chandrayaan-3 spacecraft would also be the first to land at the lunar south pole, an area of special interest for space agencies and private space companies because of the presence of water ice that could support a future space station.\nThe rocket blasted off from India's main spaceport at 2:35 p.m. local time (0905 GMT). Over 1.4 million people watched the launch on ISRO's YouTube channel, many offering congratulations and the patriotic slogan \"Jai Hind\" (Victory to India).\nIndia's much-awaited moon mission Chandrayaan-3 has been scheduled for launch on July 14, 2023.\n[1/5]India's LVM3-M4 lifts off carrying the Chandrayaan-3 lander from the Satish Dhawan Space Centre at Sriharikota, India, July 14, 2023. REUTERS/Stringer\nIn 2019, ISRO's Chandrayaan-2 mission successfully deployed an orbiter but its lander and rover were destroyed in a crash near where the Chandrayan-3 will attempt a touchdown.\nChandrayaan, which means \"moon vehicle\" in Sanskrit, includes a 2-metre-(6.6-foot)-tall lander designed to deploy a rover near the moon's south pole, where it is expected to remain functional for two weeks running a series of experiments.\nThe lunar landing is expected on Aug. 23, ISRO has said.\nThe launch is India's first major mission since Prime Minister Narendra Modi's government announced policies to spur investment in space launches and related satellite-based businesses.\nModi had earlier said on Twitter that the moon mission \"will carry the hopes and dreams of our nation\".\n\"As Mother India enters into the next 25 years, she pledges to play a leading global role in the emerging world scenario,\" Deputy Minister of State for Science and Technology Jitendra Singh said in an event at the spaceport to celebrate the launch.\nSince 2020, when India opened to private launches, the number of space startups has more than doubled. Late last year, Skyroot Aerospace, whose investors include Singapore's sovereign wealth fund GIC, launched India's first privately built rocket.\n(This story has been refiled to say Chandrayaan-2 mission was launched in 2019, not 2020 in paragraph 7)\nReporting by Nivedita Bhattacharjee in Bengaluru; Editing by Kevin Krolicki, Jamie Freed and Mark Heinrich\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-14 00:00:00"
}