{
    "article_id": 79,
    "url": "https://reuters.com/technology/ibm-misses-second-quarter-revenue-estimates-it-spending-cools-2023-07-19/",
    "title": "IBM misses second-quarter revenue estimates as tech spending cools",
    "text": "July 19 (Reuters) - Enterprise software provider IBM's (IBM.N) second-quarter revenue fell short of Wall Street expectations on Wednesday, bogged down by a decline in sales of its mainframe computers as businesses cut tech spending.\nIT companies have warned of more pain as businesses striving to cut costs in the face of rising inflation snip tech budgets, hurting the industry that saw rapid growth during the COVID-19 pandemic when businesses rushed to adopt hybrid work.\nIT majors such as Accenture and India's Tata Consultancy Services (TCS.NS) have also flagged demand weakness, with the former missing market estimates for quarterly revenue last month after its North America revenue grew at its slowest rate in about three years.\nRevenue growth in the U.S. and Western Europe was \"muted\" as the company wrapped up the cycle for its mainframe computers it launched last year, Chief Financial Officer James Kavanaugh said in an interview.\nIBM reported the top line of its business that houses the mainframe computers shrank by 14.6%.\nGrowth in RedHat software and consulting segment slowed likely due to a tougher IT spending environment, said Wedbush Securities analyst Moshe Katri.\nTotal revenue for the quarter ended June 30 fell 0.4% to $15.48 billion compared with analysts' average estimate of $15.58 billion, according to Refinitiv data.\nIBM has joined tech firms in boosting its artificial intelligence offerings, launching a platform, watsonx, in May to help companies integrate generative AI into their products and services after chatbot ChatGPT's stellar success.\nAnalysts expect watsonx to aid the software business, which grew 7.2% to $6.6 billion during the reported quarter, thanks to enterprise digitization projects.\nExcluding items, the company earned $2.18 per share, beating estimates of $2.01 per share.\nReporting by Chavi Mehta in Bengaluru Editing by Vinay Dwivedi\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-19 00:00:00"
}