{
    "article_id": 62,
    "url": "https://reuters.com/technology/netflix-tumbles-revenue-hit-overshadows-subscriber-jump-2023-07-20/",
    "title": "Netflix falls as benefits from password sharing crackdown to take time",
    "text": "July 20 (Reuters) - Netflix (NFLX.O) tumbled 6% on Thursday after lackluster revenue growth sparked concerns it could take longer for the video-streaming pioneer's new money-making ventures to drive growth.\nThe company added nearly 6 million subscribers in the second quarter - almost triple of what Wall Street expected - thanks to a crackdown on password-sharing and the introduction of a cheaper subscription tier that comes with advertising.\nHowever, quarterly revenue growth and forecast lagged estimates and co-Chief Executive Officer Greg Peters it would take \"several quarters\" to see returns from those efforts.\nInvestors dumped the stock on Thursday, setting it on course for its worst day in 2023. The drop will erase nearly $13 billion from the company's market value if premarket losses hold.\nShares have risen more than 60% this year.\n\"Netflix needs to squeeze as much juice as it can from different avenues,\" said Hargreaves Lansdown analyst Sophie Lund-Yates, adding the market was \"realms away from knowing\" if the ad tier could become the cash cow it has been sold as.\nReuters Graphics\nSmartphone with Netflix logo is placed on a keyboard in this illustration taken April 19, 2022. REUTERS/Dado Ruvic/\nNetflix has been fighting off rivals Disney+ and Amazon's Prime Video in an industry that is showing signs of saturation in the United States. Many of its new sign-ups are in countries where it charges lower prices.\nHowever, analysts remained broadly upbeat, with at least 23 of them lifting their price target on Netflix stock to push the median view to $445, about 7% lower than its last closing price.\nThe company has a 12-month forward price-to-earnings ratio of 36.16, more pricey than Disney's 18.12 and the industry mean of 15.47.\n\"Every other streamer is now increasing prices, while Netflix is now extremely competitive with its ad tier. It is putting all the building blocks in place for future revenue growth,\" said Paolo Pescatore, analyst at PP Foresight.\nHe added the company will also benefit from its move to remove the cheapest plan without ads tier in core markets, which should help support declining average revenue per user.\nThe ongoing strike in Hollywood could be a positive as well, analysts said, as Netflix already has a pipeline of completed titles, as well as a major international presence where the strike has no impact.\nNetflix on Wednesday raised its 2023 free-cash flow forecast to at least $5 billion from an earlier estimate of about $3.5 billion as a result of the strike.\nReporting by Samrhitha Arunasalam in Bengaluru; Editing by Nivedita Bhattacharjee\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-20 00:00:00"
}