{"article_id": 57, "url": "https://www.reuters.com/business/autos-transportation/eu-proposes-exception-e-fuel-combustion-engines-2035-2023-03-21/", "title": "Exclusive: EU drafts plan to allow e-fuel combustion engine cars", "text": "Summary Brussels proposes exception for e-fuels cars from 2035\nGermany still examining EU draft proposal\nBerlin sees technology condition as problematic\nGoal to reach decision by Thursday\nBERLIN/BRUSSELS, March 21 (Reuters) - The European Commission has drafted a plan to allow sales of new cars with internal combustion engines after 2035 if they run only on climate neutral e-fuels, as it tries to resolve a spat with Germany over moves to phase out combustion engine cars.\nThe draft proposal, seen by Reuters on Tuesday, suggests creating a new type of vehicle category in the European Union for cars that can only run on carbon neutral fuels.\nSuch vehicles would have to use technology that would prevent them from driving if other fuels are used, the draft said.\nThe proposal could offer a route for carmakers to keep selling combustion engine vehicles after 2035, the date when a planned EU law is set to ban the sale of new CO2-emitting cars.\nAfter months of negotiations, EU countries and the European Parliament agreed the law last year. But Germany's Transport Ministry surprised other countries this month by lodging last-minute objections to the law, days before a final vote that would have seen it enter into force.\nThe Ministry's core demand is that the EU allow sales of new cars running on e-fuels after 2035. On Tuesday, it said it was in contact with the Commission to try to reach a solution on an issue being closely watched by Germany's powerful car industry.\n\"We are interested in a quick clarification, but it must be resilient and binding. We are currently examining this carefully,\" a spokesperson said.\nTwo sources familiar with the matter said the Commission's condition that cars must be able to recognise CO2-neutral fuels from fossil fuels was problematic for Germany because it would largely force automakers to develop new engines.\nGerman Transport Minister Volker Wissing did not want to completely reject the Commission's proposal, but rather make some improvements to it, the sources told Reuters.\nThe parties are aiming to secure an agreement by Thursday's EU summit.\nA Commission spokesperson declined to comment on the draft document, but referred to comments by EU climate policy chief Frans Timmermans, who said last week any solution must comply with the 2035 phaseout law agreed last year.\n\"The talks are ongoing between the Commission and the German authorities,\" the spokesperson said.\nAn EU official told Reuters on Monday that any proposal on registering e-fuel cars would only be made after the combustion engine phaseout law was finally adopted.\nE-fuels are made by synthesizing captured CO2 emissions and hydrogen produced using CO2-free electricity.\nThey are not yet produced at scale. A study published on Tuesday by the Potsdam Institute for Climate Research found that all planned e-fuel projects worldwide would only produce enough fuel to cover 10% of Germany's demand for e-fuel use in aviation, shipping and chemicals in the next few years.\nReporting by Markus Wacket, Kate Abnett and Riham Alkousaa Editing by Rachel More and Mark Potter\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-03-21 14:50:39"}