{"article_id": 44, "url": "https://www.suasnews.com/2023/02/uavos-gradeone-group-launch-strategic-partnership/", "title": "UAVOS & GradeOne Group Launch Strategic Partnership", "text": "UAVOS Inc., a developer and manufacturer of advanced unmanned systems, and GradeOne Group, a part of the EDGE the UAE’s world’s leading advanced technology groups, started a major new chapter in their partnerships when Vadim Tarasov, Board Chair of UAVOS, and Khalifa AI Ali, Managing Director at GradeOne Group, agreed to create a unique, strategic relationship between the two companies. The new\nagreement provides a tactical framework for current and future cooperation that leverages the resources, talent, and ideas of both companies to produce innovative solutions for the industry of autonomous systems as part of the joint R&D Laboratory.\nA Memorandum of Understanding was signed at IDEX 2023, one of the largest tri-service defense exhibitions in the world, which is being held in Abu Dhabi, UAE, until 24 February.\nThe agreement ensures work in three key areas related to development and adoption of security technology for uncrewed land and air platforms. Developing, testing and manufacturing an anti-drone laser system, Refinement of a family of uncrewed jet powered Arrow aerial targets, and Program of piloted aircraft into drones conversion. The cooperation will be geared towards developing the products for the UAE market as well as other countries.\n“UAVOS is thrilled to be formalizing our long-term partnership with the GradeOne Group.\nOur combined strength will provide capacity for innovation needed to respond to complex global issues and autonomous systems industry challenges,” said Vadim Tarasov. “Our strategic relationship will leverage the best talent and ideas from both companies to produce innovative solutions for our future.”\nAbout UAVOS\nUAVOS is a developer and manufacturer of security and commercial solutions based on advanced Unmanned Systems with an international investor base. UAVOS technology, products, and tailored services include multi-role UAVs, unique proprietary autopilots advanced communication systems, UAV components, and experiential training. UAVOS is involved in stratospheric R&D projects having developed the HAPS ApusDuo autonomous aircraft and the HiDRON meteo- missions stratospheric glider ready to deploy missions to the stratosphere. UAVOS’ mission statement is to create the right partnerships and shared goals with customers worldwide in order to build mutual technology and innovation capabilities for the benefit of our partners and customers.\nAbout GradeOne Group\nGradeOne Group, Abu Dhabi, the United Arab Emirates, specializes in providing military technology, equipment, pyrotechnics, ammunition, and services to various military and defense sectors – army, special forces, navy, air force, law enforcement and search and rescue services.", "date": "2023-02-23 10:10:45"}