{
    "article_id": 99,
    "url": "https://techcrunch.com/2023/07/19/tesla-to-license-fsd-to-other-oems-allow-transfer-of-fsd-to-new-cars/",
    "title": "Tesla to license FSD to other OEMs, allow transfer of FSD to new cars",
    "text": "Tesla to license FSD to other OEMs, allow transfer of FSD to new cars\nTesla CEO Elon Musk confirmed Wednesday that the automaker is “in discussion with major OEMs about using Tesla FSD.”\nTesla Full Self-Driving is the automaker’s beta advanced driving assistance system (ADAS) that can automate driving tasks on highways and urban streets. If other automakers were to adopt FSD technology, they would need to onboard both Tesla’s software and hardware suite. Tesla’s approach to ADAS, and ultimately to autonomy, is to rely only on computer vision processing, or cameras, rather than a range of sensors like lidar and radar.\nDuring Wednesday’s second quarter earnings call, Musk also said Tesla will allow the transfer of FSD software to new vehicles, but only in the third quarter.\n“This is a one-time amnesty,” said Musk, encouraging buyers to place their orders in Q3 or “within reasonable delivery time frames.” Currently, Tesla owners who have spent the $15,000 on FSD are locked into their existing car, and cannot upgrade to a new model without losing their access to the software.\nToday, about 400,000 Teslas have FSD onboard, according to Tesla’s fourth-quarter earnings report. The automaker’s goal in expanding the number of cars that use the controversial software is a pure play at increasing the amount of data those cars collect of real-world driving environments.\nMusk touched on the importance of having vast amounts of video data to train FSD in order to eventually achieve full autonomy. Today, the automaker has accumulated 300 million miles driven in FSD, a number that Musk said “will seem extremely small very soon.”\nTesla to invest $1 billion in Dojo supercomputer\nThe other main piece of Tesla’s reach for autonomy is having enough compute power.\n“The fundamental rate limiter on the progress of full self-driving is training,” said Musk. “If we had more training compute, we could get it done faster.”\nTesla also announced Wednesday that it would soon start production of its Dojo training computer. What that means, exactly, is unclear. Dojo, which Tesla announced at its AI Day in 2021, will be used to train Tesla’s neural nets. Those neural nets are used to power, train and improve FSD, as well as the automaker’s humanoid robot, Optimus. Musk said Tesla would be spending well over $1 billion on Dojo across capital expenditures and R&D.\nThe automaker is already using a large Nvidia GPU-based supercomputer, but the new Dojo is custom-built using chips designed by Tesla. Musk has claimed that Dojo will be capable of an exaflop, or 1 quintillion floating-point operations, per second. Per a graph in Tesla’s earnings report, it appears the automaker is now promising Dojo will deliver 100 exaflops by October 2024. A supercomputer capable of that kind of compute could perform in one second what a regular desktop computer might take billions of years to compute.\nThese are some seriously bold claims that should be taken with a grain of salt. Tesla needs Dojo to perform well so that it can fulfill its promises of bringing full autonomy to the masses. Previously, Musk has said that without FSD, Tesla would be “worth zero.” That’s because without the hype and potential of FSD actually turning Teslas into autonomous vehicles that can be hired out as robotaxis, Tesla is really just an automaker.\nMusk has repeatedly promised that Tesla would achieve full autonomy by such-and-such date, and has repeatedly passed those dates with a partially autonomous product. Musk acknowledged this faux pas Wednesday, saying that people have “quite fairly” made fun of him and his over-optimistic predictions.\n“I know I’m the Boy Who Cried FSD, but I think it will be better than a human by the end of this year,” he said.\nThis statement comes amid continued scrutiny from regulators into Tesla over the safety of FSD and its other ADAS, Autopilot. The latter has been linked to several crashes, many of which were fatal.",
    "date": "2023-07-19 00:00:00"
}