{"article_id": 6, "url": "https://edition.cnn.com/2023/02/17/tech/tiktok-data-centers-europe", "title": "TikTok planning two more data centers in Europe", "text": "Chinese social media company TikTok plans to open two more data centers in Europe, a senior executive said Friday, in a move that could mitigate concerns over the security of users’ data and ease regulatory pressure on the company.\nTikTok has been seeking to assure governments and regulators that users’ personal data cannot be accessed and its content cannot be manipulated by China’s Communist Party or anyone else under Beijing’s influence.\nThe short video sharing app, owned by China’s ByteDance, aims to expand its European data storage, TikTok’s general manager for operations in Europe Rich Waterworth said in a blog post.\n“We are at an advanced stage of finalizing a plan for a second data center in Ireland with a third-party service provider, in addition to the site announced last year,” he said.\n“We’re also in talks to establish a third data center in Europe to further complement our planned operations in Ireland. European TikTok user data will begin migrating this year, continuing into 2024,” Waterworth said.\nOn Friday, the company also reported on average 125 million monthly active users in the European Union between August 2022 and January 2023, subjecting it to stricter EU online content rules known as the Digital Services Act (DSA).\nThe DSA labels companies with more than 45 million users as very large online platforms and requires them to do risk management, external and independent auditing, share data with authorities and researchers, and adopt a code of conduct.\nThe European Commission had given online platforms and search engines until February 17 to publish the number of their monthly active users. Very large online platforms have four months to comply with the rules, or risk fines.\nTwitter said Thursday that it has 100.9 million average monthly users in the European Union, based on an estimation of the last 45 days.\nAlphabet provided one set of numbers based on users’ accounts and another set based on signed-out recipients, saying that users can access its services when they sign into an account or when they are signed out.\nIt said the average monthly number of signed-in users totaled 278.6 million at Google Maps, 274.6 million at Google Play, 332 million at Google Search, 74.9 million at Shopping and 401.7 million at YouTube.\nEarlier this week, Meta Platforms said it had 255 million average monthly active users on Facebook in the European Union and about 250 million average monthly active users on Instagram in the last six months of 2022.", "date": "2023-02-17 00:00:00"}