{"article_id": 54, "url": "https://apnews.com/article/lance-reddick-john-wick-4-tributes-ff6cd68e124bd84892862c691d043fe2", "title": "‘John Wick’ stars honor late co-star Lance Reddick", "text": "At the Los Angeles premiere of \"John Wick: Chapter 4,\" stars including Keanu Reeves and Laurence Fishburne pay tribute to their late friend and co-star Lance Reddick, who unexpectedly died last week. (March 21)\nAt the Los Angeles premiere of \"John Wick: Chapter 4,\" stars including Keanu Reeves and Laurence Fishburne pay tribute to their late friend and co-star Lance Reddick, who unexpectedly died last week. (March 21)\nLOS ANGELES (AP) — Keanu Reeves and Laurence Fishburne were among the “John Wick: Chapter 4” stars honoring Lance Reddick, their co-star who died unexpectedly last week , at the film’s Los Angeles premiere.\n“We lost our brother, and in a really sort of very shocking way. I think we’re all still in shock. Life is,” the visibly shaken Fishburne said, pausing briefly before continuing, “hard sometimes.”\nMany of those who worked on the film wore blue ribbons to honor Reddick, who was a prolific character actor with prominent roles in “The Wire,” “Oz” and the “John Wick” film franchise.\n“Just to be in his light and to get a chance to work with him, I’ll cherish for the rest of my life,” Reeves said. “He had such a passion for his work and his craft. He was gracious. He had a dignity to him and a presence.”\nReddick, 60, died Friday in Los Angeles of natural causes, his publicist Mia Hansen said. No further details were provided.\nTributes have poured in for the actor, whose roles made him a beloved and recognizable star of television and films. He played Charon, the multi-skilled Continental Hotel concierge who is fond of Wick, an assassin played by Reeves. The latest installment arrives in theaters Friday.\n“He’s the goodness of this film. He was kind of, in many ways, the heart of the film because his character loved John Wick,” Fishburne said.\n“You know, it’s always hard when you lose someone that you love dearly ... but you’re also incredibly grateful for the time you had together. We were fortunate enough to work with Lance since the very beginning of the ‘John Wick’ franchise. I mean it’s been almost 10 years,” director Chad Stahelski said. “I really wish he could be with us tonight, but, you know, life. But we’re very fortunate to have known him. And he’s a great man, a great artist, a great human, a dear friend.”\nShamier Anderson, a newcomer to “Wick” franchise, recalled how Reddick took time to say a kind word on set.\n“I grew up watching Lance Reddick. It is a bittersweet moment because he was definitely one of my heroes growing up as an actor, as a Black actor,” Anderson said. “And even though we didn’t share screen time together in this film, we shared some time off camera and he was salt of the Earth when he first met me.\n“He said, ‘Shamier, you’re incredible. I love your work man,’ and like, it melted me like a puddle.”\n___\nThis story has been corrected to fix a misidentification of an actor. He’s Shamier Anderson, not Shamier Moore.", "date": "2023-03-21 05:58:54"}