{
    "article_id": 70,
    "url": "https://reuters.com/technology/space/alien-planet-with-metallic-clouds-resembles-a-giant-mirror-space-2023-07-10/",
    "title": "Alien planet with metallic clouds resembles 'a giant mirror in space'",
    "text": "WASHINGTON, July 10 (Reuters) - It is a planet astronomers say probably should not even exist.\nResearchers said on Monday they have spotted a truly extreme planet beyond our solar system, a blazingly hot world a bit bigger than Neptune that orbits a sun-like star every 19 hours and appears to be wrapped in metallic clouds made of titanium and silicates that reflect most incoming light back into space.\n\"It's a giant mirror in space,\" said astronomer James Jenkins of Diego Portales University and the Center for Excellence in Astrophysics and Associated Technologies (CATA) in Chile, a co-author of the research published in the journal Astronomy & Astrophysics.\nIt reflects about 80% of incoming light, making it the universe's most reflective object known. Venus, the brightest object in Earth's night sky besides the moon, is our solar system's most reflective object, enrobed in toxic sulfuric acid clouds. Venus reflects about 75% of incoming light. Earth reflects about 30%.\nThe planet, named LTT9779b, and its star are located in our Milky Way galaxy about 264 light years from Earth in the direction of the constellation Sculptor. A light year is the distance light travels in a year, 5.9 trillion miles (9.5 trillion km).\nThe planet's diameter is about 4.7 times greater than Earth, and it orbits very close to its star - closer than our solar system's innermost planet Mercury's distance to the sun and 60 times closer than Earth's orbit. With blistering solar radiation from its star, its surface temperature is about 3,270 degrees Fahrenheit (1,800 degrees Celsius), hotter than molten lava.\nWith its star so close, it is a wonder it has any atmosphere, according to the researchers. An atmosphere with water-based clouds, as on Earth, would have been blown away by solar radiation long ago. But they believe its clouds are metallic, a combination of titanium and silicate - the stuff that makes up most of the rocks in Earth's crust.\n\"We even think that the clouds could condense into droplets, and have titanium rain falling in parts of the atmosphere,\" Jenkins said.\nThe researchers studied the planet using the European Space Agency's CHEOPS orbiting telescope.\n\"No other planet like this has been discovered to date,\" said astronomer and study lead author Sergio Hoyer of the Marseille Astrophysics Laboratory in France.\nPossessing an atmosphere while orbiting so close to its star makes it \"a planet that shouldn't exist,\" according to astronomer and study co-author Vivien Parmentier of the Côte d'Azur Observatory in France.\n\"The super-reflective cloud cover likely helped stop the planet from warming up too much and being stripped of its atmosphere,\" Parmentier said. \"This is quite unique as all other planets at this temperature that are big enough to keep their atmosphere are too hot to form clouds and are thus as dark as charcoal.\"\nIt also appears to be tidally locked to its star like the moon is to Earth, with a permanent day side facing the star and a permanent night side facing away.\nAll previously known planets that orbit their stars in less than one Earth day were either \"hot Jupiters,\" gas giants similar in composition to our solar system's largest planet but much hotter due to solar radiation - or rocky planets smaller than Earth and lacking an atmosphere.\nThe researchers are pondering whether LTT9779b, classified as an \"ultra-hot Neptune,\" perhaps began as a gas giant only to lose most of its atmosphere, or whether it started out at its current size.\nMore than 5,000 planets beyond our solar system - called exoplanets - have been discovered, many with traits vastly different than our solar system's eight planets. With increasingly capable instruments coming on line - the James Webb Space Telescope became operational last year and the Extremely Large Telescope is under construction in Chile - more discoveries await.\n\"The diversity of exoplanets is stunning,\" Parmentier said, \"and we have just scratched the surface.\"\nReporting by Will Dunham, Editing by Rosalba O'Brien\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-10 00:00:00"
}