{
    "article_id": 77,
    "url": "https://reuters.com/technology/microsoft-faces-german-rivals-eu-antitrust-complaint-its-teams-office-2023-07-20/",
    "title": "Exclusive: Microsoft hit with EU antitrust complaint by German rival",
    "text": "BRUSSELS, July 20 (Reuters) - Microsoft (MSFT.O) was hit with an EU antitrust complaint by German rival alfaview on Thursday, the second so far over its bundling of video app Teams into its Office product.\nRegulators are already preparing to open an investigation into Microsoft's move. The U.S. software giant has been on the EU competition enforcer's radar since 2020, when Salesforce-owned (CRM.N) workspace messaging app Slack complained about the tying of Teams with Office.\nAlfaview, based in Karlsruhe in south-western Germany and with a 500-strong workforce, said it had filed a similar complaint to the European Commission.\nBundling both products together gives Teams a unique competitive advantage that is not justified by performance and which rivals cannot match, it said.\nThis has significant and permanent impact on competition in the communication software market, alfaview continued.\n\"Tying Teams with the other applications in the Microsoft 365 suite creates a multipolar distribution advantage for the U.S. group,\" its managing director and founder, Niko Fostiropoulos, said in a statement.\nMicrosoft declined to comment on alfaview's complaint.\nMicrosoft added Teams to Office 365 in 2017 for free, with the app eventually replacing Skype for Business.\nThe Commission is set to launch an investigation into the move after Microsoft's remedies fell short, people familiar with the matter told Reuters earlier this month.\nMicrosoft, which has been fined a total of 2.2 billion euros ($2.5 billion) in the previous decade for practices in breach of EU competition rules, has offered to cut the price of its Office product without Teams, but regulators want a bigger reduction, the people said.\nNo formal investigation has been opened yet, but Microsoft is subject to an informal probe.\n\"We continue to engage cooperatively with the Commission in its investigation and are open to pragmatic solutions that address its concerns and serve customers well,\" a Microsoft spokesperson said.\nAlfaview urged the EU antitrust watchdog to open a formal investigation, saying remedies offered by its U.S. rival to the Commission were insufficient.\n($1 = 0.8928 euros)\nReporting by Foo Yun Chee; editing by David Evans and Emma Rumney\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-20 00:00:00"
}