{"article_id": 42, "url": "https://variety.com/2023/tv/news/warner-bros-discovery-zaslav-shows-combative-streak-1235534033/", "title": "Warner Bros. Discovery’s Zaslav Shows New Combative Streak, Tweaking Media Rivals", "text": "David Zaslav sounds tired of taking lumps.\nAfter months of cost cutting, write-downs, and getting pilloried among Hollywood natives for killing projects, the Warner Bros. Discovery chief showed off some new truculence, making the case that while his newly-merged company has been having a tough time, so too were others.\n“‘Last year was a year of restructuring,” said Zaslav, during a call with investors Thursday. “This year will be a year of building.”\nOver the course of an hour, Zasalv and Gunnar Wiedenfels, Warner’s chief financial officer, made the case that their company was just as well-equipped as any of its rivals — perhaps even more so — to withstand a stormy era during which media companies are pressed to grow their streaming operations but maintain profitability. Zaslav elbowed Netflix for releasing all of the episodes for a program’s cycle all at once; suggested that a move to launch new “Lord of the Rings” movies would take away some of the momentum that Amazon had enjoyed from its launch of a series based on the novels; and told listeners Warner Bros. Discovery could launch an ad-supported streaming service without having to buy an outside asset, as Fox Corp. and Paramount Global have done in recent year.\n“We can create a Tubi or a Pluto without having to buy anybody,” he boasted.\nZaslav even name-checked Amazon CEO Andy Jassy, almost as if to tease Amazon with the threat of new “Lord of the Rings” properties.\nWhether investors believe him remains to be seen. “Warner Bros. Discovery’s approach to streaming continues to raise eyebrows,” said Third Bridge analyst Jamie Lumley in a Thursday research brief, noting that “there is a lot of uncertainty around how the company is planning to position itself against competitors like Netflix and whether it will be able to compete.”\nSome investors, the analyst said, are confused by the company’s intention to keep Discovery+ running as a stand-alone, even as it seeks to increase prices at HBO Max by adding Discovery+ content. For his part, Zaslav said research showed that a number of customers were happy with a solo Discovery+ and the company saw no reason to leave any subscriber behind,\nThe executive also showed a defiant streak, doubling down on a strategy at CNN that has generated lots of outside scrutiny. In recent weeks, CNN has set in motion plans to overhaul the bulk of its daily schedule, but early efforts have not resulted in ratings upticks. “We must get it right” at CNN, Zaslav said, adding that “this is not going to happen overnight.” He also suggested Warner would once again double down on demanding high rate hikes at the industry’s annual ad-sales upfront in weeks to come — even though that strategy generated pushback from Madison Avenue last year.\nHe made his new vows after turning in tough results. Warner Bros. Discovery had a fourth-quarter loss of more than $2 billion, with advertising sales at its U.S. TV networks down 14%. Zaslav and Wiedenfels predicted the sector’s operating environment would improve in the second half of the year, and gave investors something to anticipate with the promise of an unveil of a new HBO Max with Discovery content in April.\nNow, all he has to hope for is a better economy and for rivals who won’t be able to compete as strongly in the days ahead. It’s not clear that Zaslav will be granted either wish immediately. Even so, he told the audience, “We are not managing this company for short-term financial performance,” but rather for decades to come. But with the pace of change in media, Zaslav will have to back up that bold talk sooner rather than later.", "date": "2023-02-23 23:33:56"}