{"article_id": 51, "url": "https://edition.cnn.com/2023/03/21/business/online-prices-cheaper-products", "title": "From groceries to clothes, inflation-weary Americans flock to cheaper products online", "text": "New York CNN —\nNearly two years of high inflation has caused many consumers to say goodbye to premium goods in favor of cheaper alternatives.\nNew research from Adobe Analytics, shared with CNN, spells out the scale of this trading-down trend playing out in online shopping.\nAcross 11 categories of e-commerce, high-priced goods have lost meaningful market share to low-cost ones, according to Adobe.\nFor instance, the most expensive quartile of personal care products held 31% of the market as of January 2019. As of the end of February this year, these pricier products make up just 7% of the market, according to Adobe.\nThe cheapest tier of personal care products doubled its market share over that span to 54%.\n“As inflation hits consumers and really impacts their buying power, they are shifting to the cheaper products offered online — across the board,” said Vivek Pandya, lead analyst at Adobe Digital Insights.\nThe trend is taking place even as inflation continues to cool off from a 41-year high hit in the middle of last year.\nA similar story is playing out in groceries, where prices on everything from meat and fruit to eggs have spiked over the past two years.\nIn online groceries, the most expensive tier of products has gone from 24.5% of the market in January 2019 to 9% now. The cheapest tier of online groceries has grown in market share by 13 percentage points to nearly half the market, Adobe said.\n“Consumers are having to down-shift and forgo certain premium products and instead go for the cheaper ones. In groceries, that means people shifting from organic fruit to non-organic fruit,” Pandya said.\nPrices for food at home increased by 10.2% over the last 12 months, according to the government’s February Consumer Price Index inflation report.\nThe shift away from expensive items is one reason are the fastest growing food retailers in America, according to a Tufts University study released earlier this year. And lower-price supermarkets like Aldi have enjoyed stronger growth in recent years.\nBeyond food, online shoppers have traded down in electronics, where the cheapest tier of goods has spiked from 25% of the market to 39%, according to Adobe.\n“In 2020, consumers were flush with stimulus dollars and savings. Now they are much more constrained,” said Pandya.\nConsumers are also very price conscious when it comes to buying clothes online.\nThe most expensive tier of apparel was about one-fifth of the market as of January 2019 but today it stands at just one-tenth, Adobe said.\nEven pricey toys are taking a back seat. The most expensive tier of online toys has gone from 25% of the market four years ago to 13% today.\n“It’s pretty apparent we are still dealing with a very price-conscious consumer who has had to deal with a lot economically,” said Pandya. “It’s going to take time for them to shift away from this behavior.”", "date": "2023-03-21 00:00:00"}