{
    "article_id": 87,
    "url": "https://techcrunch.com/2023/07/19/tesla-hits-25b-in-q2-revenue-but-margins-decrease-amid-price-cuts/",
    "title": "Tesla hits $25B in Q2 revenue, but margins decrease amid price cuts",
    "text": "Tesla reported Wednesday net income of $2.7 billion in the second quarter, up 20% from the same period last year as once again, the company’s EV price cuts dug into profits. The automaker has repeatedly reduced the cost of its four EV models in the United States, Mexico, Europe and China. The move helped boost sales in the first half of the year, with Tesla hitting record Q2 deliveries of 466,140 units. But it’s also taken chunks out of Tesla’s normally healthy automotive margins.\nFor the second time this year, Tesla’s gross margins decreased to 18.2%, down from 25% in Q2 2022 and down from 19.3% last quarter.\nTesla matched Wall Street revenue estimates of around $25 billion for the quarter, which is nearly 50% higher than year-ago sales of $16.9 billion. Most of the revenue came from Tesla’s automotive revenue, which hit $21.3 billion in Q2. That number includes $282 million from federal tax incentives.\nA small, but notable, chunk of Tesla’s Q2 revenue came from “services and other revenue,” which usually includes after-sales vehicle services and parts, retail merchandise, vehicle insurance and the Supercharger network.\nTesla’s number of Supercharger stations and connectors increased 33% in the second quarter to 5,265 and 48,082, respectively. The automaker has been opening its network of Superchargers to other automakers in recent months, notably Ford and General Motors, and most recently Nissan. While charging isn’t a main revenue driver for Tesla, it’s possible that some of the increase came from Tesla opening up its charging network.\nEnergy generation and storage revenue remained flat quarter-over-quarter, but grew 74% year-over-year.\nTesla’s operating margin dropped slightly from 11.4% in Q1 to 9.6% in Q2. Its capital expenditures remained flat QoQ but increased 19% YoY. The company reported it spent $2 billion in capital expenditures, likely due to continued production ramping in the automaker’s Berlin and Texas gigafactories. Tesla’s Q2 earnings show that Berlin’s vehicle capacity increased by 25,000 units over Q1 reported numbers.\nTesla closed out the quarter with $1 billion in free cash flow, which is up from the $441 million with which it finished the first quarter.\nTesla stock closed at $291.26 Wednesday and dropped 5% in after-hours trading.\nTesla’s 2023 outlook\nTesla’s full-year outlook hasn’t changed.\n“For 2023, we expect to remain ahead of the long-term 50% CAGR with around 1.8 million vehicles for the year,” reads Tesla’s earnings report.\nIn Q1, Tesla delivered 422,875 vehicles globally. In the second quarter, that number hit 466,140 units, a 10% increase. If Tesla’s production and delivery capacity keeps increasing at around the same clip, the automaker will be able to reach close to 2 billion units by the end of the year.\nHowever, Musk did say Wednesday that Q3 production will decrease slightly, driven by planned downtime for factory upgrades. He noted that macroeconomic conditions are uncertain and could impact execution positively or negatively in the near term.\nMusk also defended Tesla’s many price cuts, saying it was a move to combat the potential for lower sales amid economic uncertainty.\n“When interest rates rise dramatically, we actually have to reduce the price of the car because the interest payments increase the price of the car,” said Musk.\nThe executive noted that Tesla had also brought back its referral program in an effort to boost sales.\nCybertruck information still lacking\nTesla finally built its much-delayed Cybertruck over the weekend at Giga Austin, but few details were shared at the time. During Wednesday’s earnings report, the company still left investors and analysts wanting more.\n“It’s always very difficult to predict the ramp initially, but I think we’ll be making them in high volume next year, and we will be delivering the car this year,” said CEO Elon Musk Wednesday.\nMusk also noted that “demand is so far off the hook, you can’t even see the hook,” emphasizing that the Cybertruck has “a lot of new technology…so the production ramp will move as fast as the slowest and least likely elements of the entire supply chain.”\nTesla didn’t provide other information on the Cybertruck, like production capacity next year, pricing and more specs.\nThis story has been updated with information from Tesla’s Q2 earnings call.",
    "date": "2023-07-19 00:00:00"
}