{
    "article_id": 82,
    "url": "https://reuters.com/technology/tsmc-q2-profit-falls-23-beats-market-expectations-2023-07-20/",
    "title": "TSMC flags 10% fall in 2023 sales as weak global outlook weighs",
    "text": "[1/2] A logo of Taiwan Semiconductor Manufacturing Co (TSMC) is seen at its headquarters in Hsinchu, Taiwan August 31, 2018. REUTERS/Tyrone Siu/File Photo/File Photo\nSummary\nCompanies Sees 2023 spending at low end of $32-$36 bln forecast\nSays global economic recovery weaker than expected\nQ2 profit T$181.8 bln vs T$172.55 bln analyst view\nQ2 revenue down 13.7% on year at $15.68 bln\nExperiencing labour challenges at Arizona fab\nTAIPEI, July 20 (Reuters) - Taiwanese chipmaker TSMC (2330.TW) forecast a drop of around 10% in 2023 sales on Thursday and flagged investment spending at the low end of estimates as global economic woes dent demand for chips used in everything from cars to cellphones.\nThe world's largest contract chipmaker said that high demand for artificial intelligence (AI) and its position as the largest manufacturer of AI chips has not offset broader end market weakness as the global economy recovers more slowly than it had expected.\n\"The short-term frenzy about the AI demand definitely cannot extrapolate for the long term. Neither can we predict the near future - meaning next year - how the sudden demand will continue or flatten out,\" TSMC chairman Mark Liu said after the company reported a 23% fall in second-quarter profit.\nGiven the AI demand surge, TSMC said it has been hard to fulfill customer needs and plans to boost advanced packaging capacity as quickly as possible.\nTaiwan Semiconductor Manufacturing Co Ltd estimated investment spending for this year at the lower end of a previous forecast of $32-$36 billion and expects a slower increase in the next few years after dramatic increases in recent years.\nSignalling a slightly better few months ahead, TSMC expects third-quarter revenue to pick up to around $16.7 billion-$17.5 billion, from $15.68 billion in the previous quarter.\nHowever, the company warned that the year's second half, when Apple launches new iPhones ahead of the holiday season, will see a milder seasonality than in previous years, as well as cost challenges from higher electricity costs and the ramp up in production of its most advanced N3 technology.\nAs TSMC steps up its global expansion, the company said production at its first plant in Arizona will be delayed as it faces a shortage of specialist workers.\n\"While we are working to improve the situation, including sending experienced technicians from Taiwan to train the local skilled workers for a short period of time, we expect the production schedule of N4 process technology to be pushed out to 2025,\" Liu told an earnings briefing.\nTSMC's total investment in the U.S. project amounts to $40 billion.\nINVENTORY ADJUSTMENT\nFor the second quarter ended June, TSMC, a major Apple Inc (AAPL.O) supplier, reported a 23.3% fall in net profit - beating forecasts - although it was its first on-year drop in quarterly profit since the second quarter of 2019 when it fell 7.6%.\nThe company revised down its 2023 revenue forecast to a fall of around 10%, from previous guidance of a low-to-mid single digit decline.\nTSMC saw April-June net profit drop to T$181.8 billion ($5.85 billion) from T$237.0 billion a year earlier.\nThat compared with the T$172.55 billion average of 21 analyst estimates compiled by Refinitiv.\n\"Our second quarter business was impacted by the overall global economic conditions, which dampened the end market demand, and led to customers' ongoing inventory adjustment,\" Chief Financial Officer Wendell Huang said.\n\"Moving into third quarter 2023, we expect our business to be supported by the strong ramp of our 3-nanometer technologies, partially offset by customers' continued inventory adjustment.\"\nTSMC, Asia's most valuable listed company, said second-quarter revenue dropped 13.7% year-on-year to $15.68 billion, in line with the company's previous forecast.\nAs the biggest maker of advanced chips, TSMC must navigate an uncertain industry outlook and a U.S.-China chip spat that could make it vulnerable. read more\nTSMC's Taipei-listed shares fell 27.1% in 2022, but are up around 30% so far this year, giving the chipmaker a market value of $486.5 billion. The stock fell 0.3% on Thursday versus a 0.3% rise in the benchmark index (.TWII).\n($1 = 31.0580 Taiwan dollars)\nReporting by Yimou Lee and Sarah Wu; Writing by Ben Blanchard; Editing by Jacqueline Wong, Shri Navaratnam and Kim Coghill\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-20 00:00:00"
}