{"article_id": 30, "url": "https://apnews.com/article/boeing-co-federal-aviation-administration-business-eeacab066d2d48e02399ff63fecb408a", "title": "Boeing stops deliveries of jet on questions surrounding part", "text": "FILE - The Boeing 787 Dreamliner after its landing at Le Bourget airport, east of Paris, upon its presentation for the first time at the 49th Paris Air Show at the airport, June 21, 2011. Boeing has again stopped deliveries of its 787 passenger jet because of questions around a supplier’s analysis of a part near the front of the plane, company and federal officials said Thursday, Feb. 23, 2023. (AP Photo/Francois Mori, File)\nFILE - The Boeing 787 Dreamliner after its landing at Le Bourget airport, east of Paris, upon its presentation for the first time at the 49th Paris Air Show at the airport, June 21, 2011. Boeing has again stopped deliveries of its 787 passenger jet because of questions around a supplier’s analysis of a part near the front of the plane, company and federal officials said Thursday, Feb. 23, 2023. (AP Photo/Francois Mori, File)\nBoeing has again stopped deliveries of its 787 passenger jet because of questions around a supplier’s analysis of a part near the front of the plane, company and federal officials said Thursday.\nBoeing said the issue does not raise an immediate safety issue for planes already in service. The Federal Aviation Administration was more cautious, saying it is working with Boeing to determine what fixes might be needed for planes recently delivered to airlines.\nThe discovery is the latest setback involving the two-aisle plane, which Boeing calls the Dreamliner and is mostly used on international routes. Deliveries were stopped for more than a year, until August 2022 , while Boeing fixed production flaws including the fit of panels on the carbon-composite skin.\n“Boeing temporarily halted deliveries of 787 Dreamliners after notifying the FAA that it is conducting additional analysis on a fuselage component,” the FAA said in a statement Thursday. “Deliveries will not resume until the FAA is satisfied that the issue has been addressed.”\nA Boeing spokesperson said the company based in Arlington, Virginia, “discovered an analysis error by our supplier related to the 787 forward pressure bulkhead,” a part that separates the nose of the plane from the pressurized cabin. Boeing did not name the supplier.\n“There is no immediate safety of flight concern for the in-service fleet,” the company said.\nBoeing said near-term deliveries will be affected but it doesn’t expect it will change the company’s forecast of deliveries for this year.", "date": "2023-02-24 00:03:48"}