{
    "article_id": 92,
    "url": "https://techcrunch.com/2023/07/20/what-happened-when-nous-co-hooked-up-generative-ai-to-its-users-household-bills/",
    "title": "What happened when Nous.co hooked-up Generative AI to its users’ household bills",
    "text": "With the cost of living ever more painful, and Generative AI supposedly gunning for your job, at least — for the moment — it might be here to save you some money on your household bills.\nUK-based cost-of-living start-up Nous.co has now launched an OpenAI-powered assistant (combined with its own proprietary systems) to help its users understand and manage their household bills. Users will be able to upload bills or connect their email inbox to have bills forwarded to the assistant automatically. It then categorises and summarises the bills, alerting customers to details and potential savings.\nNous claims it can now save households up to £1,000 a year or more via its AI-driven system, and around £126 on average. It also says it can spot it when suppliers’ try to send estimated bills rather than final ones.\nThe new feature is on the free tier of Nous membership, currently works with energy bills and will soon be extended to broadband, mobile phone and insurance documents, with alerts delivered via WhatsApp.\nAccording to the company’s own research, two thirds of people in the UK find it difficult to understand their energy bills and only 15% say they read the small print.\nAfter just over 12 months of development in private beta, Nous soon plans to offer a subscription service as its premium product, focusing on clear billing and customer reassurance regarding data privacy. The free product will serve as an onboarding tool and customer acquisition funnel for the premium service. The startup relies on open banking regulations to access consumer spending data.\nGreg Marsh, co-founder and CEO of Nous, told me: “We knew intellectually AI would be part of the story for this service. It offers automation and scale. What I hadn’t got clear until this year was how powerful it was to unlock customer value. The combination of LLMs, our domain knowledge and our connections with commercial suppliers is very powerful. But AI is front and centre of this.”\nHe says that given most people find trawling through their bills boring, utilities and insurance companies can sometimes use that as an opportunity to “bury nasty surprises”. He says Generative AI is “perfectly suited to catching this stuff straight away.”\nHe says Nous has has has has thousand of people use the service but he doesn’t want to be in the business of monetising the data: “We use it to enhance the user. The typical insurance contract requires 44 pieces of information. We can get almost all of those pieces from your last insurance contract, then ask can ask you just four extra questions through a chat interaction through whatsapp.”\nMarsh, a former VC at Index Ventures and the exited founder of onefinestay, says he came up with Nous after struggling to grapple with his household bills while down with Covid-19 during the pandemic and the simultaneous birth of his second child.\nNous has so far raised $10million in seed funding from investors including Tom Blomfield (co-founder of GoCardless & Monzo), Marc Warner (co-founder & CEO of Faculty.ai), Dan Hegarty (founder & CEO of mortgage company Habito), Eamon Jubbawy (co-founder of Onfido) and Brent Hoberman (founder of Founders Forum). Mosaic Ventures and Chalfen Ventures also participated. Nous says it is a “B-Corp pending” business.",
    "date": "2023-07-20 00:00:00"
}