{
    "article_id": 89,
    "url": "https://techcrunch.com/2023/07/20/first-sneak-peek-at-the-judges-for-startup-battlefield-at-techcrunch-disrupt-2023/",
    "title": "First sneak peek at the judges for Startup Battlefield at TechCrunch Disrupt 2023",
    "text": "First sneak peek at the judges for Startup Battlefield at TechCrunch Disrupt 2023\nThe Startup Battlefield pitch competition is the crown jewel of Disrupt, and we can’t wait to see which of the Startup Battlefield 200 companies will be selected to pitch to panels of top-tier VCs at TechCrunch Disrupt 2023 on September 19–21 in San Francisco. It’s always epic, and every contender is on the road to making a huge impact on the world.\nWe’re thrilled to reveal our first group of investors who will judge the startups and follow up each pitch with an intense, revealing Q&A. Be on the lookout for more names being announced soon!\nThe judges’ feedback provides insight into the criteria they use to determine whether a company is viable or not. Watch and learn what investors look for, what motivates them and what pushes them to schedule a meeting.\nOkay, let’s get to it. Here are the first four VCs ready to help decide the next Startup Battlefield champion.\nMeet the first round of judges for Startup Battlefield at TechCrunch Disrupt 2023\nMorgan Beller, general partner, NFX\nMorgan Beller is the co-founder of Libra and was head of strategy for Novi, Facebook’s digital wallet for the Libra payment system. She originally joined Facebook as part of the corporate development team in 2017, where she worked on defining Facebook’s strategy around blockchain, cryptocurrencies and decentralized technology.\nPrior to Facebook, Beller ran corporate development at Medium, where she led the Embedly acquisition and played a key role in developing Medium’s subscription strategy. She began her career on the deal team at Andreessen Horowitz.\nBeller joined NFX in 2020 to invest in networks and marketplaces across a wide spectrum of sectors, most actively in web3. She loves working with technical founders who are creating new markets.\nPriti Youssef Choksi, partner, Norwest Venture Partners\nPriti Youssef Choksi brings more than 20 years of corporate and business development experience to her role as a partner on Norwest’s consumer internet team.\nPrior to Norwest, Youssef Choksi spent nine years at Facebook in executive roles in corporate development and business development. She led M&A efforts for the company, negotiated key partnerships and served as a strategic adviser to product leadership teams across Facebook.\nYoussef Choksi previously spent six years at Google in strategic partnership roles. As director of distribution partnerships, she led deals for Google applications such as Toolbar and Chrome and negotiated transformative search partnerships with companies such as Apple and Mozilla. Top-line revenue from these deals grew from $0 to $4 billion under her stewardship.\nEarlier in her career, Youssef Choksi earned her startup chops in strategy and management roles at two fast-growth companies — one went public in 1997, and the other was acquired by Inktomi in 2001.\nYoussef Choksi holds an MBA with honors from Northwestern’s Kellogg School of Management and graduated magna cum laude from the University of Pennsylvania with degrees in architecture and communications.\nRebecca Liu-Doyle, managing director, Insight Partners\nRebecca Liu-Doyle joined Insight in 2016. Her focus areas include high-growth software, marketplaces and consumer internet.\nPreviously, she spent time on Insight’s on-site team, where she worked closely with portfolio executives on growth strategy. Liu-Doyle started her career as a management consultant in McKinsey & Company’s New York office, advising clients in the technology, financial services and consumer goods industries. Her work at McKinsey spanned a number of topics, including M&A, product development and frontline transformation.\nLiu-Doyle graduated summa cum laude from Yale University with a BA in ethics, politics and economics. She mentors at 1776, is a member of the Acumen Junior Council and helped launch the Parity Professional Program. She grew up bouncing between states and has lived in Louisiana, Missouri, Wisconsin and Utah. In her spare time, she enjoys eating and shopping her way through the city, cycling, watching Marvel superhero movies and taking in art history. She is fluent in Chinese and has a black belt in tae kwon do.\nDana Settle, co-founder and managing partner, Greycroft\nAs a member of Greycroft’s management committee, Dana Settle is responsible for the firm’s operations, investment strategy and vision. Settle is on the investment committee for all Greycroft funds and has been involved in all phases of Greycroft’s growth.\nSettle’s active investments include Acorns, Anine Bing, Avaline, Bird, Citizen, Cloud Paper, data.ai, Goop, HamsaPay, Happiest Baby, Merit Beauty, Mountain Digital, Pacaso, Seed Health, Tapcart, Thrive Market and Versed. Her notable exits include Bumble (IPO), Maker Studios (acquired by Disney), Pulse (acquired by LinkedIn), The RealReal (IPO), Trunk Club (acquired by Nordstrom) and WideOrbit (interest sold to company management).\nSettle is a board director to IMAX Corporation and the National Venture Capital Association. She is a founding member of the nonprofit Baby2Baby and the female mentorship collective, All Raise. She is also a member of the Fast Company Impact Council.\nPrior to Greycroft, Settle spent several years as a venture capitalist and adviser to startups in the Bay Area, including six years at Mayfield, and investment banking at Lehman Brothers.\nSettle holds a BA in finance and international studies from the University of Washington and an MBA from Harvard Business School.\nTechCrunch Disrupt 2023 takes place on September 19–21 in San Francisco. Buy your pass now and save up to $600. Student, government and nonprofit passes are available for just $195. Prices increase August 11.\nIs your company interested in sponsoring or exhibiting at TechCrunch Disrupt 2022? Contact our sponsorship sales team by filling out this form.",
    "date": "2023-07-20 00:00:00"
}