{"article_id": 18, "url": "https://apnews.com/article/meta-facebook-job-cuts-f193ca0e67078c04a8433f6c74a83187", "title": "A 2nd wave of layoffs at Meta; 10,000 jobs are cut", "text": "A person stands in front of a Meta sign outside of the company's headquarters in Menlo Park, Calif., Tuesday, March 7, 2023. Facebook’s parent Meta will slash another 10,000 jobs and will not fill 5,000 open positions as the social media pioneer cuts costs. (AP Photo/Jeff Chiu)\nA person stands in front of a Meta sign outside of the company's headquarters in Menlo Park, Calif., Tuesday, March 7, 2023. Facebook’s parent Meta will slash another 10,000 jobs and will not fill 5,000 open positions as the social media pioneer cuts costs. (AP Photo/Jeff Chiu)\nFacebook parent Meta is slashing 10,000 jobs, about as many as the social media company announced late last year in its first round of cuts, as uncertainly about the global economy hits the technology sector particularly hard.\nThe company announced 11,000 job cuts in November, about 13% of its workforce at the time. In addition to the layoffs, Meta said Tuesday that it would not fill 5,000 open positions.\n“This will be tough and there’s no way around that,” said CEO Mark Zuckerberg.\nMeta and other tech companies have been hiring aggressively for at least two years and in recent months have begun to let some of those workers go . Hiring in the U.S. is still strong, but layoffs have hit hard in some sectors.\nEarly last month, Meta posted falling profits and its third consecutive quarter of declining revenue. On the same day, the company said that it would buy back as much as $40 billion of its own stock.\nThe Menlo Park, company said Tuesday it will reduce the size of its recruiting team and make further cuts in its tech groups in late April, and then its business groups in late May.\nZuckerberg has invested tens of billions of dollars building out its metaverse, its virutal reality concept, and renamed the company Meta, signaling a new focus for Facebook.\n“As I’ve talked about efficiency this year, I’ve said that part of our work will involve removing jobs -- and that will be in service of both building a leaner, more technical company and improving our business performance to enable our long term vision,” said Zuckerberg.\nThe biggest tech companies in the U.S. are cutting costs elsewhere, too.\nThis month, Amazon paused construction on its second headquarters in Virginia following the biggest round of layoffs in the company’s history and its shifting plans around remote work.\nGlobal inflation has remained stubborn and its made for more difficult decisions for both households and businesses in the U.S .\nFast growth companies, including many in the technology sector, are hunkering down for what may be an extended period of adverse economic conditions.\n“At this point, I think we should prepare ourselves for the possibility that this new economic reality will continue for many years,” Zuckerberg said in a message to employees.\nMeta shares rose nearly 7% Tuesday.", "date": "2023-03-14 13:36:41"}