{"article_id": 32, "url": "https://www.cnbc.com/2023/02/21/microsoft-will-bring-xbox-games-to-nvidias-cloud-gaming-service.html", "title": "Nvidia supports Microsoft, Activision merger after Xbox deal to add games to cloud service", "text": "BRUSSELS — Microsoft said Tuesday it will bring its Xbox PC games to Nvidia's cloud gaming service, after the chipmaker had reportedly expressed opposition to a major Microsoft gaming deal.\nThe announcement comes after Microsoft President Brad Smith met with European Union officials on Tuesday in a bid to convince them that its planned $69 billion acquisition of Activision Blizzard will be good for competition.\nMicrosoft is offering the olive branch to stop the takeover from being blocked and thereby expand its gaming unit, which represents 9% of its total revenue. While sales of Microsoft's Xbox consoles are slowing down, the company has been drawing on its cash pile to expand the collection of games it can sell and allow people to play through its cloud data centers.\nMicrosoft President Brad Smith said at a press conference that, effective immediately, its Xbox games will be available on Nvidia's GeForce Now cloud games service. Smith said if the Activision deal closes, it will bring all Activision Blizzard titles to GeForce Now.\nNvidia is now on board with Microsoft's pending deal for regulatory purposes, the two companies said in a joint statement confirming the two companies 10-year deal. In January Bloomberg reported that Nvidia had gone to the U.S. Federal Trade Commission with complaints about the Activision deal.\n\"Combining the incredibly rich catalog of Xbox first party games with GeForce Now's high-performance streaming capabilities will propel cloud gaming into a mainstream offering that appeals to gamers at all levels of interest and experience,\" Jeff Fisher, Nvidia's senior vice president for GeForce, was quoted as saying. \"Through this partnership, more of the world's most popular titles will now be available from the cloud with just a click, playable by millions more gamers.\"\nMicrosoft proposed its Activision Blizzard acquisition in January 2022, but since then, the buyer has faced pushback from regulators in the U.S., European Union and U.K.\nThe Nvidia arrangement is meaningful because \"now we're addressing the full range of issues that have been raised by regulators as topics of not just interest but in some cases concern,\" Smith said at the press conference.\nIn November, the European Commission, the EU's executive arm, opened an in-depth investigation into the deal citing concerns that it could reduce competition in the video games market.\nActivision Blizzard is the company behind popular game franchise Call of Duty. The EU commission said last year it is concerned that Microsoft could block access to the game on other platforms if the deal goes through.\nThe commission is also concerned that it could give Microsoft an unfair edge in the nascent area of cloud gaming. Microsoft has a service called Game Pass through which it charges gamers $9.99 per month to access a library of games. The Activision takeover would add some high-profile titles to Game Pass.\nNvidia's GeForce Now has over 25 million members, while Microsoft said last year that 25 million people subscribe to Game Pass. Nvidia offers free and paid GeForce Now tiers, although high resolution is only available to those who pay. Members of GeForce Now will be able to stream through the cloud the games they buy through Microsoft's app store, along with games listed in Epic Games and Steam's app stores.\nIn December, Microsoft said it had \"entered into a 10-year commitment\" to bring Call of Duty to Nintendo when the Activision acquisition closes. The announcement was seen as a move to assuage regulators' antitrust concerns. On Tuesday, Smith tweeted that the two signs have now signed a \"binding 10-year legal agreement\" to bring Call of Duty to Nintendo players on the same day as Microsoft's Xbox, \"with full feature and content parity.\"\nSmith declined to comment on the views of the European Commission in the hearing, but said the Nintendo and Nvidia deals are good for competition in the gaming market.\n\"I think if you're a competition regulator, and you're focused on the interests of consumers and competition, today was a good day,\" Smith told CNBC.Microsoft hopes for Sony deal\nSmith on Tuesday led a delegation that included Microsoft Gaming CEO Phil Spencer and Activision Blizzard CEO Bobby Kotick, Reuters reported, citing a European Commission document that the news agency had seen. Sony’s gaming chief Jim Ryan was also in attendance, Reuters added. Sony, Microsoft’s biggest rival, opposes the Activision takeover.\n\nSony was not immediately available for comment when contacted by CNBC.\n\nDuring a press conference on Tuesday, Smith held up a piece of paper saying it is an agreement he is ready to send to Sony.\n\nSmith told CNBC that Microsoft is offering Sony the same agreement as Nintendo — to have Call of Duty available on the PlayStation the same time as Xbox with the same features. However, Sony still remains opposed to the deal.\n\n“I live with the hope that we’ll come to terms with Sony,” Smith told CNBC.\n\n“We’re not there yet. But I do think as we make progress with others, if we can get a deal done with Nintendo, if we can get an agreement with Nvidia, it should provide a path forward that others like Sony can build on as well.”\n\nU.K., U.S. regulators take aim at deal\nIt’s not only European regulators that have concerns about the deal.\n\nThe U.K.’s Competition and Markets Authority said this month that the takeover raises competition concerns and may result in higher prices, fewer choices and less innovation. The regulator said it could move to block the deal and suggested several remedies Microsoft could take. One of those involved Microsoft divesting the business responsible for Call of Duty.\n\nSmith said that Microsoft doesn’t see a “feasible path” to sell off the Call of Duty game.\n\n“It just isn’t something that seems to be lining up,” Smith told CNBC.\n\n“The only reason to sell it off is the CMA’s potential concern that if we buy it, we won’t provide it to others as broadly. I think that concern should be dispelled by the two agreements we’ve signed today.”\n\nIn December, the FTC filed an antitrust case against Microsoft attempting to block the Activision deal.\n\nGoogle parent Alphabet also went to the FTC with dissatisfaction about Microsoft’s deal, Bloomberg reported.\n\n“The European Commission asked for our views in the course of their inquiries into this issue. We will continue to cooperate in any processes, when requested, to ensure all views are considered,” a Google spokesperson told CNBC in an email.\n\nSmith declined to comment on Alphabet’s exact concerns with the Activision deal but recognized the company’s potential misgivings.\n\n“It’s easy to understand that Google might have questions about whether something like Call of Duty would be available in the future on say Chromebooks and the Chrome operating system,” Smith said.\n\nThe Nvidia agreement addresses that as the GeForce Now cloud gaming service is available on ChromeOS, Smith said. Microsoft is able to maintain compliance with the sorts agreements with European regulators that might require it to keep Call of Duty on Chrome OS, he said during the press conference.\n\n“With the agreement we’ve done with Nvidia, we’ve just ensured Google will benefit as well,” Smith said.\n\nMicrosoft has maintained that its takeover of Activision Blizzard would not harm competition in video gaming and instead increase competition against large players like Sony and Chinese giant Tencent.\n\nMicrosoft has remained behind the likes of Sony and Nintendo in the video-gaming business. Microsoft’s Xboxes have lagged Sony’s PlayStation 5 and Nintendo’s Switch. Sony and Nintendo’s popularity has come from its large number of successful first-party games. Microsoft is looking to boost its games library with the Activision acquisition.\n\nActivision Blizzard shares edged up during Tuesday’s U.S. trading session following the announcement.", "date": "2023-02-21 00:00:00"}