{"article_id": 50, "url": "https://edition.cnn.com/2023/03/21/homes/existing-home-sales-february", "title": "Home prices just broke a decade-long streak", "text": "Washington, DC CNN —\nThe median price of a US home was lower this February than it was in February 2022, ending more than a decade of year-over-year increases, the longest on record, according to a National Association of Realtors report released Tuesday.\nThe median existing home price was $363,000 in February, down 0.2% from a year ago. This marks the first monthly year-over-year price decline since February 2012.\nRegionally, prices fell more from a year ago in the West (down 5.6%) and Northeast (down 4.5%), where housing is more expensive. But prices were still climbing from last year in the South (up 2.7%) and the Midwest (up 5%).\n“This is not the bottom for prices,” said Lawrence Yun, chief economist for NAR. “We expect a continuing price correction, but we are not expecting prices to crash.”\nThe median decrease is so small, he said, it is essentially flat. But it marks the first technical drop in median home prices that is expected to continue.\n“Could we see 5% decline? Sure, but we could also see 5% increase. My forecast has prices declining 2% this year,” he said.\nBut home sales vaulted higher, marking the largest monthly percentage increase since July 2020, which itself was an anomaly of the pandemic as some restrictions loosened that month to allow a backlog of sales.\nUS home sales surged in February, following a full year of declining home sales due to surging mortgage rates and prices that remained elevated, which kept homebuyers out of the market. February’s reversal in sales also ended the longest streak of month-to-month declining home sales on record, going back to 1999 for all homes and 1968 for single-family homes.\nSales of existing homes — which include single-family homes, townhomes, condominiums and co-ops — shot up 14.5% in February from January. But sales were down 22.6% from a year ago.\nThe seasonally adjusted annualized sales pace dropped from 5.92 million units a year ago to 4.58 million. The steep decline in sales activity is driven by the large increase of mortgage rates over the past year.\nMortgage rates remain volatile — in February, rates rose half of percentage point — but prices in some areas are cooling, according to NAR.\n“Conscious of changing mortgage rates, home buyers are taking advantage of any rate declines,” said Lawrence Yun, NAR’s chief economist. “We’re seeing stronger sales gains in areas where home prices are decreasing and the local economies are adding jobs.”\nInventory remains stubbornly low, said Yun.\nTotal housing inventory at the end of February was 980,000 units, the same as last month and up 15.3% from one year ago. Unsold inventory sits at a 2.6-month supply at the current sales pace, down 10.3% from January but up from 1.7 months a year ago.\n“Inventory levels are still at historic lows,” Yun added. “Consequently, multiple offers are returning on a good number of properties.”\nHome buyers show rate sensitivity\nSales of existing homes gained ground in February as buyers responded to mortgage rates that were slightly lower, said Hannah Jones, economic data analyst at Realtor.com.\n“Pent-up housing demand continues to be sensitive to mortgage rate changes as potential buyers take advantage of any improvement in affordability,” she said.\nThe huge jump in sales was surprising, said Yun, showing just how sensitive homebuyers are to slight reductions in mortgage rates.\n“The reason for the increase is that mortgage rates were somewhat lower in January and February and consumers wanted to take advantage of a rate that was around 6.3%, rather than closer to 7%,” said Yun.\nThe big jump, he said, also revealed a dynamic in the market in which home buyers with a long-simmering housing search may jump on a listing quickly if it meets their needs.\nMarkets were swift but slower than a year ago, according to NAR, with properties typically on the market for 34 days in February, up from 33 days in January and 18 days a year ago. Over half the homes sold in February were on the market for less than a month.\n“We hit the bottom for home sales in January,” he said. “Now we’re seeing a bounce up to a sales activity that is the strongest since September of last year.”\nAffordability challenges remain\nLower rates were clearly the big driver as to why sales rose in February.\nFebruary typically marks the beginning of the spring buying season and usually both buyer and seller activity picks up as weather warms up and the end of the school year approaches.\n“As high prices and elevated mortgage rates continue to stifle buyer activity, this spring’s market is expected to be toned down relative to the last couple of years,” said Jones. “However, the housing market remains undersupplied, so well-priced, well-maintained listings are likely to draw buyer attention.”\nMortgage rates began February lower, but rose due to inflation concerns ending the month almost half a percentage point higher. That upward trajectory in rates has been recently interrupted due to concerns about the health of the financial system after several bank failures. This has pushed rates lower over the past week.\nThe future of mortgage rates will be impacted by what action the Federal Reserve decides to take with benchmark rates at its two-day policy meeting, which concludes on Wednesday.\nHome sellers considering putting their home on the market will still be in a strong position to cash in on home equity, said Jones, since low inventory and strong demand to buy has kept prices strong in many places. “But the dwindling buyer pool makes the task more challenging.”\n“Home sales remain well below last year’s level, signaling that significant affordability gains must be made before buyers are able to return to the market en masse,” she added.", "date": "2023-03-21 00:00:00"}