{
    "article_id": 102,
    "url": "https://techcrunch.com/2023/07/19/why-does-the-internet-love-tree-law-so-much/",
    "title": "Why does the internet love tree law so much?",
    "text": "It was day 76 of the Hollywood writers’ strike, and once again, comedian Chris Stephens journeyed out to the picket line. But when he arrived in front of Universal Studios, he noticed something odd. The trees outside the studio — which offer a rare bit of shade from the brutal Los Angeles sun — had been trimmed until they were almost bare.\nQuick shoutout to the good people at @UniversalPics for trimming the trees that gave our picket line shade right before a 90+ degree week. pic.twitter.com/aZvvPYQ23i — Chris Stephens (@ChrisStephensMD) July 17, 2023\n“Quick shout out to the good people at @UniversalPics for trimming the trees that gave our picket line shade right before a 90+ degree week,” Stephens tweeted.\nIt’s a historic moment in Hollywood, because as of last week, the actors’ and writers’ unions have joined together for the first dual strike since 1960. Though it’s not proven for sure that Universal is responsible, the timing seemed uncanny to the striking entertainers.\n“Obviously, I can’t say that there’s a bunch of people smoking cigars in a room saying like, ‘Oh, let’s get them all burned to a crisp on the sidewalk,'” Stephens told TechCrunch. “But the moment everyone on the picket line saw those trees had been trimmed, it felt deliberate.”\nUniversal did not respond to request for comment.\nStephens’ tweet went viral — partially because it’s ridiculous to imagine that a massive studio might have trimmed trees in an act of union busting, but also, because as it turns out, there’s a dedicated corner of the internet that obsesses over tree law.\nTree law is what it sounds like: law about trees. There’s a Reddit community, r/treelaw, that has more than 77,000 members. Not everyone is an expert in hyperspecific local tree laws. They just find this esoteric branch of law to be neat, especially when it crops up in extraordinarily specific and bizarre scenarios.\nOne of Reddit’s most popular communities is r/AmITheAsshole (also known as AITA), where people share the drama happening in their personal lives and ask Redditors to litigate who in the situation is the asshole. Tree law scratches the same itch as AITA, but it’s weirder, because any situation in which trees are involved in a lawsuit is probably a bit more niche than a story about a bad breakup.\nIt’s strange how often tree law comes up online, and something of a fandom has formed around it. As writer Jenna Routenberg explained, “I think the underpinning of the meme is that the story is usually some rich asshole does harm to trees for their own convenience/aesthetics/property value, and some plucky lawyer nails them on an obscure statute, and they get fined like mad.”\nThat seems to be the case in one ongoing dispute, in which a New Jersey homeowner cut down 32 trees on a neighbor’s property, apparently to get a better view of New York City, but according to tree law, there is a $1,000 fine for each tree cut down without a permit. Twitter user @SamAsIAm posted about the incident, which he heard about from a friend who is a municipal arborist. The arborist found that there is a provision requiring the mature trees to be replanted, but the area where the trees were chopped down is on a mountainside that’s inaccessible by car, so now, the property owner who cut down the trees could be on the hook for paying to build a road and replant the trees. And since these trees were so old, they will be very difficult and costly to replace.\nTo rephrase it as an AITA post: am I the asshole if I cut down 32 trees on my neighbor’s property, but instead of just charging me a $32,000 fine, now they’re going to make me build a road and find transplanted, equally mature trees to replant?\nLike the situation at Universal, this incident went viral, and when a preliminary hearing took place in June, 200 people tried to join the public Zoom call.\nNaturally, the combination of large corporations (allegedly) behaving badly and tree law created a perfect storm for internet virality. Stephens’ tweet even got noticed by the Los Angeles city controller, Kenneth Mejia, who investigated the situation.\nUPDATE: With cooperation from the Bureau of Street Services, we have found that no tree trimming permits have been issued over the last three years for this location outside Universal Studios. Also, the City did not issue any tree trimming permits for the latest tree trimmings. https://t.co/8ge7LElRao pic.twitter.com/JChoiNvHhW — LA City Controller Kenneth Mejia (@lacontroller) July 19, 2023\nAfter consulting with the Bureau of Street Services, Mejia found that the city didn’t issue any permits to allow these tree trimmings, nor had any permits been issued in the last three years. Whoever is held responsible for this unbeleafable behavior will be charged an administrative fee starting at $250, but Stephens says it’s not about the money. When incidents like this go viral amid the writers’ and actors’ strikes, it can help turn the public narrative against studios. That’s an asset that writers didn’t have in 2008, when TikTok didn’t exist and Twitter was two years old.\n“What [studios] can’t afford, but is priceless, is outrage,” he said. “These are the people that watch their shows and subscribe to their streaming services. They clearly care when people are upset.”",
    "date": "2023-07-19 00:00:00"
}