{"article_id": 13, "url": "https://www.reuters.com/business/aerospace-defense/boeing-halts-deliveries-787-dreamliner-jets-faa-2023-02-23/", "title": "Boeing temporarily halts deliveries of 787 Dreamliner jets - FAA", "text": "WASHINGTON, Feb 23 (Reuters) - Boeing Co (BA.N) has temporarily halted deliveries of its 787 Dreamliner jets as the U.S. planemaker conducts additional analysis on a fuselage component, the Federal Aviation Administration (FAA) said on Thursday.\nDeliveries will not resume until the FAA is satisfied that the issue has been addressed, the agency said.\n\"The FAA is working with Boeing to determine any actions that might be required for recently delivered airplanes,\" the agency said.\nBoeing said in reviewing certification records it \"discovered an analysis error by our supplier related to the 787 forward pressure bulkhead. We notified the FAA and have paused 787 deliveries while we complete the required analysis and documentation.\"\nSpirit AeroSystems (SPR.N), which supplies the forward pressure bulkhead for the 787 jets, said it was aware that Boeing has halted deliveries.\n\"Based on the information we currently have and our interactions with Boeing to date, we believe it is too early to assert there was an 'analysis error' by Spirit,\" the company said in a statement.\nBoeing said it discovered the error within the past week.\n\"There is no immediate safety or flight concern for the in-service fleet,\" Boeing said. \"While near-term deliveries will be impacted, at this time we do not anticipate a change to our production and delivery outlook for the year.\"\nThe Wall Street Journal earlier reported that Boeing has not handed over a Dreamliner since Jan. 26 from the production line or from the dozens stored awaiting delivery because of a documentation issue.\nBoeing shares fell 2.6% in extended trading following the disclosure after closing up around 1%.\nIn August, the FAA approved the first 787 for delivery since May 2021 after it approved the planemaker's inspection and modification plan. Boeing delivered 31 787s in 2022 and said last month it expects to deliver between 70 and 80 787s this year.\nBoeing Chief Financial Officer Brian West said last month on an earnings call \"it's going to take us a little bit longer\" to get to producing five 787s per month later this year.\n\"But we still see 70 to 80 in the cards,\" West said.\nBoeing had halted deliveries in 2021 after the FAA raised concerns about its proposed inspection method. In September 2020, the FAA said it was investigating manufacturing flaws in some 787 jetliners.\nThe current issue is unrelated to a previous quality problem involving gaps around the forward pressure bulkhead, which was discovered by the FAA in 2021 and contributed to a delivery stoppage that lasted until August 2022.\nReporting by David Shepardson and Valerie Insinna in Washington and Anirban Chakroborti in Bengaluru. Additional reporting by Rishabh Jaiswal in Bengaluru; Editing by Shailesh Kuber, Bill Berkrot and Savio D'Souza\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-23 00:00:00"}