{"article_id": 40, "url": "https://www.hospitalitynet.org/news/4115112.html", "title": "Ennismore's Brand Partnerships Studio Announces New Collaboration with The Kraft Heinz Company", "text": "NEW YORK - Ennismore, the fastest-growing lifestyle hospitality company, today announces a new collaboration with the Kraft Heinz Company. The Ennismore Partnership Studio will collaborate with the HEINZ® brand on a global program inclusive of on-property experiences, activations and digital content in the luxe lifestyle space that highlight the iconic brand's latest and greatest innovations, including the chef-inspired HEINZ 57 Collection® line.\nIn celebration of the collaboration, on February 23rd and 24th at HYDE Beach at SLS South Beach, the brands will launch an exclusive HEINZ tasting lounge: an immersive pop-up that will provide SLS guests and savvy clientele unique tastings, samples and giveaways on Miami's iconic beach, coinciding with South Beach's much anticipated Food & Wine Festival. The lounge will showcase the integration of the HEINZ 57 Collection coupled with the culinary expertise of the SLS Miami team. Located at Hyde Beach, renowned for its signature mixology and music talent, the tasting lounge will bring a true moment of surprise and delight for all guests.\nEnnismore is proud to work with the HEINZ® brand for a new sensory experience for our audiences. The new collaboration will introduce hotel guests globally at Mondrian, SLS and House of Originals hotels to the latest HEINZ products, including the chef-inspired HEINZ 57 line, at food & beverage venues as well as via in-room dining. Similarly, there will be a series of unique on-property activations throughout the year exclusively for guests at these properties. Rohit Anand, Executive Vice President of Global Partnerships at Ennismore\nOver the last several years, we noticed a rise in 'curious foodies' culture – people who seek new and elevated eating experiences – and saw an exciting white space for the HEINZ brand to join the narrative. At Kraft Heinz, we are always innovating to please our fans' evolving palettes. We created the HEINZ 57 Collection line to deliver the multi-sensorial eating experiences our fans are craving, and Ennismore is the perfect group to help bring those experiences to life across a variety of dayparts and eating occasions. We're excited to see how their chefs will leverage the flavors and textures of the HEINZ 57 Collection line to create mouth-watering dishes. Nick Guerten, Vice President, Marketing, Away from Home\nWhether poolside, ordering room-service, sipping cocktails at the lounge or having dinner with friends, guests will be able to indulge in the very latest culinary line from HEINZ 57 Collection line of products. Participating hotels include: Mondrian Los Angeles, SLS Brickell, SLS LUX Brickell and SLS South Beach.\nLaunched in July of 2022, the HEINZ 57 Collection is a line of elevated sauces and spreads designed to add magic to the culinary experience, one spoonful, drizzle or spread anywhere, anytime. Aiming to make culinary trends more accessible, the HEINZ brand looked to the culinary expertise of award-winning Chefs, Lee Wolen and Joe Frillman, for inspiration in developing the collection. The chef-inspired line strives to accelerate culinary exploration by transforming simple dishes into mouth-watering creations. The collection includes infused honeys - Hot Chili and Black Truffle – and crunch sauces – Chili Pepper Crunch, Roasted Garlic Crunch and Mandarin Orange Miso Crunch.\nThrough its newly formed Partnership Studio, Ennismore continues to expand its strategic partnerships with international brands – including Fortune 500 companies – across automotive, communications, beverage and financial services to deliver innovative and bespoke benefits, products, and experiences. More information about the Partnership Studio can be found on Ennismore's website .\nABOUT ENNISMORE\nEnnismore is a creative hospitality company with a global collective of entrepreneurial and founder-built brands with purpose at their heart. It curates and manages unique properties and experiences in some of the most exciting destinations worldwide.\nFounded in 2011 by entrepreneur Sharan Pasricha, Ennismore and Accor entered a joint venture in 2021 to create a new autonomous entity, with Accor holding a majority shareholding. Creating the world's fastest-growing lifestyle hospitality company, it brings together Ennismore's know-how in building brands with creative storytelling, design, and authentic experiences, with Accor's wealth of knowledge in delivering scale, network growth and distribution.\nUnder Sharan Pasricha, Founder & Co-CEO, and Gaurav Bhushan, Co-CEO, Ennismore comprises 14 brands - with over 100 operating properties and a further 140+ in the pipeline - and a collection of over 190 culturally relevant and diverse restaurants and nightlife destinations.\nEnnismore puts innovation at the center of everything it does, with four dedicated in-house specialist studios, which obsess every guest touchpoint, including Carte Blanched – a fully integrated F&B concept platform; a creative studio of interior and graphic designers; a digital product and tech innovation lab, and a partnerships and collaborations division.\nEnnismore has been included in Fast Company's World's Most Innovative Companies lists in 2020 and 2021; ranked#29 in FT1000: Europe's Fastest-Growing Companies; and is part of FT Future 100 - the UK's fastest-growing businesses that are shaping the future of their sector.", "date": null}