{
    "article_id": 83,
    "url": "https://techcrunch.com/2023/07/19/michael-moritz-moves-on-bookmarking-a-long-chapter-at-sequoia-capital/",
    "title": "Michael Moritz moves on, book-ending a long chapter at Sequoia Capital",
    "text": "Michael Moritz, the journalist-turned-VC who has long been one of the most prominent and respected investors at Sequoia Capital, has left the firm after 38 years to “deepen his advisory relationship” with Sequoia Heritage, the wealth management unit he spun up in 2010 with colleague Doug Leone and on whose board he has sat for years.\nThe move is effective immediately. In a note to LPs that we obtained earlier, Sequoia’s global managing partner, Roelof Botha, said Moritz will continue to represent Sequoia Capital at a handful of companies but that those seats will be “transitioned” to other partners over time.\nA source familiar with the firm said the development was not socialized within the partnership far in advance of its announcement to Sequoia’s investors because Moritz long ago relinquished his day-to-day responsibilities. Indeed, he stepped down from an active management role in 2012, telling investors then that he’d been diagnosed with a “rare medical condition which can be managed but is incurable” and explaining that he’d been told that “in the next five to ten years, the quality of my life is quite likely to decline.”\nDespite the adjustment, Moritz has continued to be involved at Sequoia, with some of his nine board seats newer than others. For example, he sits on the board of Getir, the Turkey-based instant delivery company that Moritz’s family office backed in 2020 before Sequoia wrote the company a check. Others of his board seats include Instacart, the U.S.-based delivery outfit; Strava, the social network for athletes; Klarna, the Stockholm-based payment outfit that last year accepted new funding at a starkly lower valuation than the previous year; and San Francisco-based Stripe, which may prove one of Sequoia’s biggest outcomes to date.\nIn contrast, when Leone stepped down last year from his role as “Senior Steward” of Sequoia to be replaced by Botha, who was previously managing partner of Sequoia’s U.S. and Europe operations, the move was roughly two years in the making given the many hats the role requires.\nAt Sequoia, stepping away is often an attenuated process. Leone continues to be part of both Sequoia’s seed and growth teams. So does another past manager at Sequoia, Jim Goetz, who oversaw Sequoia’s U.S. business with Botha until 2017 and who continues to make new investments for the firm from his perch in Miami, Fl. (Firm founder Don Valentine famously attended partner meetings for 10 years after handing the reins to Moritz and Leone.)\nMoritz, however, will not be making new investments, and perhaps inevitably, that has raised eyebrows in some corners, particularly given that Sequoia has undergone a string of other recent changes.\nIn a piece published earlier today, the Financial Times quotes one venture capitalist who has invested alongside Moritz and Sequoia and who reportedly said Moritz’s departure risks leaving a “leadership gap” at Sequoia. “It’s been a long time coming, but it comes at a bad time.”\nThe world of startup investing is still recovering from years of froth, for one thing. Further, in one of the most dramatic moves in Sequoia’s history, the firm — which has enjoyed tremendous success around the globe — announced early last month that it had decided to break up, with Sequoia’s China and India and Southeast Asia funds relaunching as new firms: HongShan and Peak XV Partners.\nIn an interview with Forbes, Botha, along with the firms’ two other investment heads, Neil Shen and Sailendra Singh, said the decision tied to conflicts between the funds’ respective portfolios and downplayed a geopolitical environment that has made it nearly impossible for U.S. investors to fund China deals in particular and vice versa.\nIt wasn’t the only big shift for Sequoia. Less than two years ago, the firm announced that it was “breaking with the traditional organization” based on fund cycles and restructuring Sequoia Capital around a singular, permanent structure that would allow it to hold public shares long after a portfolio goes public (versus distributing the shares to its investors). The decision, said Sequoia, would also enable the firm to “further increase our investments in emerging asset classes such as cryptocurrencies.”\nWhile over the long term the move may prove fruitful, its timing proved inauspicious. Roughly six months after Sequoia restructured, the broader markets tanked, dragging down the price of public company shares that Sequoia’s investors might otherwise have sold. Sequoia also suffered a rare embarrassment when FTX, the crypto exchange into which Sequoia plugged more than $200 million, imploded nearly overnight owing to mismanagement.\nPartner Alfred Lin told this editor later that the investment represented a reasonable amount from a risk management perspective when considering the $6.3 billion multibillion-dollar fund from which Sequoia’s checks were written. But a growth-stage investor who worked with Lin on that deal, Michelle Fradin, has since left Sequoia in search of an operating role.\nAnd there have been other departures. Two investors, Kais Khimji and Daniel Chen, have left to spin up two different AI companies, both of them backed by Sequoia. (Sequoia has a history of backing its own investors, including Nubank founder David Vélez.) Also gone: Mike Vernal, a former Facebook VP who joined Sequoia as a partner in 2016 and who is taking time off until the end of this year, according to a source familiar with Vernal’s plans.\nVernal had a more senior role compared with the others, including to help oversee Sequoia’s “scout” program, wherein founders in its portfolio and their friends are given the ability to write checks from Sequoia and to share in any later rewards. Now, longtime partners Bryan Schreier and Jess Lee oversee the program along with Ian Taylor, who joined Sequoia last summer after spending three years with the seed-stage firm Pear VC.\nDealbook reported first on Moritz’s departure; The Information reported first on the departures of Vernal, Khimji, Chen, and Fradin.\nLike any firm of its size and reach, Sequoia has also been hiring new talent. Earlier this year, David Cahn agreed to join Sequoia Capital as a partner on its growth team after spending more than five years with Coatue Management. Sequoia more recently poached a principal from Accel — Julien Bek — who joined its growing London-based practice.\nEither way, Moritz won’t be traveling far to spend time with the team at Sequoia Heritage, which was seeded by $150 million from Moritz’s own money, $150 million from Leone, and $250 million from outside investors who they brought in.\nRun by head investors Keith Johnson and Kevin Kelly, the separate legal entity holds office space in the same building as Sequoia Capital. Sequoia Capital Global Equities, Sequoia’s hedge fund unit, also has an office there.\nAccording to a recent Bloomberg piece, Heritage was designed to work closely with Sequoia but has always retained the right to make its own investment decisions. It has made some good decisions, evidently; its assets under management reportedly grew from $4.2 billion in April 2018 to $16.4 billion as of this past April.\nAs for Sequoia Capital’s assets, which are separate from Sequoia Heritage and Sequoia Capital Global Equities, they’ve been trending down along with the broader startup market. As flagged by Bloomberg, those assets recently stood at $55.58 billion, per an SEC filing, compared with $85 billion at the end of 2021.\nBelow is Botha’s letter to investors, sent out early this morning:",
    "date": "2023-07-19 00:00:00"
}