{
    "article_id": 86,
    "url": "https://techcrunch.com/2023/07/20/tiktok-ads-transparency/",
    "title": "TikTok expands research API to Europe and launches ads transparency library",
    "text": "TikTok has finally launched an ads transparency library — starting with data on ads and other commercial content running in Europe but with plans to expand that.\nAlso today it’s announced expanded access to its research API to Europe.\nBoth moves look intended to help the company comply with incoming requirements under the European Union’s Digital Services Act (DSA). Back in April, the video-sharing social network was confirmed as one of 19 so-called very large online platforms (VLOPs) under the DSA — a designation which brings a suite of additional compliance requirements related to algorithmic transparency and accountability.\nTo wit: Article 39 of the pan-EU regulation requires VLOPs whose platforms display ads to offers a searchable database of ads with information, including who paid for the ad, the main targeting parameters and data on views. While Article 40 concerns data access for vetted and other external researchers to further the regulation’s goal of ensuring that systemic risks flowing from major platforms are able to be robustly studied.\n“Today, we’re expanding access to our Research API to Europe and opening up new transparency tools for commercial content,” TikTok wrote in a blog post announcing the launches. “These tools are designed to enhance transparency about content on our platform and are informed by feedback we’re hearing from researchers and civil society.”\nA TikTok spokesman confirmed the research API is being made available to researchers working across Europe, not only those at institutions inside the EU — so it’s also open to applications from academics working in the EEA (European Economic Area), Switzerland and the UK.\nThe social media platform announced it was developing an API for researchers last summer — when it said it would provide select researchers with more transparency about its platform and moderation system by giving access to public and anonymized data about content and activity on the app. An initial version of the Research API was ready for testing by members of TikTok’s Content and Safety Advisory Councils in November — before being opened up to academic researchers in the US earlier this year, in February.\nSo far, the free API has seen more than 60 applications from US non-profit academic researchers on topics including those related to consumer trends, misinformation and mental health, per TikTok.\nThe impact of social media platforms on young people’s lives and well-being continues to be a topic of discussion and concern in mainstream media. But scientists have warned we still don’t have robust data to draw strong conclusions — hence the push by EU lawmakers to make major platforms open up to outside scrutiny.\nTikTok’s approach for the research API requires researchers to create an account and complete an application which it reviews to ensure its criteria are met before granting access. So it said it expects the first non-profit academic researchers in Europe to get access “in the coming weeks”.\nTikTok’s criteria for access to the API require regional researchers to have demonstrable academic experience and expertise in the research area specified in the application; no conflicts of interest with respect to using the services; a clearly defined research proposal; and to be committed to only using the data for non-commercial purposes.\nAlso today, it said it’s working on being able to grant researchers who are collaborating with others the ability to work together on a shared research project. This incoming collaboration feature, which it says it’s adding in response to feedback from early users, will be called “Lab Access”.\n“More than half the applications we’ve received request collaboration with other researchers, so we’ll soon be allowing up to 10 researchers to work together on a shared research project,” it wrote. “All researchers will need to have their own TikTok for Developers account and be located in the US or Europe to access our Research API.\n“Principal researchers will be able to submit a single application for collaborators from the same university. Projects involving multiple universities will need to submit separate applications for each school.”\nAds transparency at last\nThe ads transparency library, or “Commercial Content Library” as TikTok is billing it, is a newer initiative — and the launch plugs a long-standing transparency gap for the platform.\nA critical report on TikTok by Mozilla, back in mid 2021, found policy loopholes, lax oversight around influencer marketing and the lack of a public, searchable ads database was making the platform vulnerable to passing off political ads as organic content — rendering TikTok’s official policy banning political ads pretty meaningless.\nNow anyone can search TikTok ads or other commercial content by country, date and keyword.\nHowever — big caveat! — for now only data on commercial stuff running in Europe is available. TikTok said it plans to include data from “more countries” in the future (but did not specify where or when).\n“The Commercial Content Library is a searchable database with information about paid ads and ad metadata, such as the advertising creative, dates the ad ran, main parameters used for targeting (e.g. age, gender), number of people who were served the ad, and more,” TikTok noted.\nThe tool also includes information about other content that’s “commercial in nature and tagged with either a paid partnership label or promotional label, such as content that promotes a brand, product or service but is not a paid ad” — so TikTok is including influence marketing in the database too (or at least it is if the influencers have correctly tagged their videos).\n“We tested an early version of the Commercial Content Library with researchers and civil society to gather feedback over the last few months before making it more broadly available,” TikTok added. “From our tests and input from experts, we’ve added the ability to perform precise searches, included more targeting parameters, and improved data quality — among other updates.”\nTikTok is also providing access to a Commercial Content API to enable researchers to query the ads database.\n“Researchers will need to create a TikTok Developers account and submit an application to access the Commercial Content API which we review to help prevent malicious actors from misusing this data,” it added.",
    "date": "2023-07-20 00:00:00"
}