{
    "article_id": 93,
    "url": "https://techcrunch.com/2023/07/20/gushwork-ai-funding-lightspeed/",
    "title": "Gushwork.ai raises $2M, led by Lightspeed, to outsource business tasks to workforces trained in AI",
    "text": "Gushwork.ai, a global platform that aims to advance business process outsourcing (BPO) using AI and human expertise, has raised $2.1 million in a pre-seed funding round led by Lightspeed. B Capital, Sparrow Capital, Seaborne Capital and Beenext also participated in backing the startup that launched in April this year.\nIn recent years, companies have invested considerable amounts of money in hiring skilled professionals to oversee their operational processes, such as administration, HR, payroll management or customer support. An increasing alternative to in-house hiring is to engage with staffing agencies or BPOs to outsource operations or to use platforms, such as Upwork or Fiverr to find freelancers who can handle process-oriented tasks. However, this has become a significant cost factor due to ongoing inflation. Gushwork.ai strives to address this problem in the market using its AI-powered, cross-border platform.\nThe startup provides a curated marketplace that features offshore workers trained in using various AI applications to help businesses carry out their processes efficiently. It lets entrepreneurs outsource their tedious workflows and focus only on strategically important tasks.\nNayrhit Bhattacharya, co-founder and CEO of Gushwork.ai, calls the process “uberizing the employee workforce,” as businesses can hire talent from different markets for their manually driven operational functions on a part-time basis. He co-founded Gushwork.ai with Adithya Venkatesh (CPO) in January with a usage-based pricing model.\n“Businesses don’t need to hire full-time,” Bhattacharya told TechCrunch in an interview. “They can use somebody for a few hours — three hours this week, 40 hours next week — and then not use it for another week.”\nAlongside offering part-time access to offshore talent, Gushwork.ai trains and equips its workforce with AI tools to make them fit for many workflows that were previously considered creative and not merely process-oriented to a large extent. These can be generating photorealistic blog designs, converting webinars to blogs, generating images for blog writing, writing blog posts on different topics or even doing search engine optimization. Generative AI tools have enabled large workforces to perform such creative tasks without requiring special skills.\n“You don’t need a 3D graphic designer per se, or you don’t need to spend three months trying to find the right 3D graphic designer or the photorealistic image copy generator on Upwork or Fiverr,” Bhattacharya noted.\nGushwork.ai has trained its AI-augmented workforce to perform tasks, such as lead prospecting, email marketing, ad management, lead engagement on social media platforms, webinar moderation and marketing, social media management, responding to inbound leads, CRM setup, social media analytics data scraping, prospect outreach and ad campaign management, among others. These are all initially aimed at easing sales and marketing operations workflows. However, the startup also plans to expand into more specialized roles in the future.\nWithin the first three months of operation, Gushwork.ai saw more than 50 businesses adopting its platform to delegate over 200 complex workflows. Bhattacharya told TechCrunch that around 80% of its customers use the platform on an active basis every week, while almost 90% of them use it every month.\nThe startup has its key outbound focus on small and medium businesses and bootstrapped startups in the U.S. and Canada that have a team size of two to 20-30 members. Bhattacharya said that as much as 80% of its current customer base comprises small and medium businesses.\nWhile developed economies are the dominating markets for Gushwork.ai, Bhattacharya said it saw nearly 20% of its customers from India as well. The startup also considers India and the Philippines the initial supply bases for its offshore talent, though it looks to set up its workforce base across different countries over time.\n“The era of remote work has unlocked a number of new job opportunities and workflows that can be executed from anywhere in the world. This transcends beyond the traditional IT services or BPO industry. Gushwork.ai is leveraging this tailwind of cross-border cost arbitrage and is building a unique platform for businesses to delegate some of their most complex workflows to an elite on-demand offshore workforce trained on AI tools and apps. We are excited to partner with the team as they innovate and revitalize the future of outsourcing with AI,” said Lightspeed partner Rahul Taneja in a prepared statement.\nIn the next few months, Gushwork.ai plans to utilize the fresh funds to enhance quality control and data security and privacy. It also looks to build features to help businesses create and document their complex processes within Gushwork.ai’s platform and use them as large training datasets to automate a list of workflows. Further, it plans to invest some capital in content-led organic market and personal building channels to reach new customers.\nThe startup currently has over 25 full-time and part-time employees spread across three countries, with Bhattacharya based in Brooklyn and three founding members and co-founder Venkatesh in India’s Bengaluru.",
    "date": "2023-07-20 00:00:00"
}