{"article_id": 52, "url": "https://edition.cnn.com/2023/03/20/media/wga-hollywood-reliable-sources", "title": "Hollywood braces for potential strike as writers begin high-stakes talks with studios", "text": "New York CNN —\nHollywood is holding its breath.\nThe Writers Guild of America commenced high-stakes negotiations with studios on Monday over a contract set to expire on May 1 — which could lead to the first strike in nearly 15 years, a prospect that would cause massive disruption to television and film projects across the industry.\nThe guild is heading to the Sherman Oaks bargaining table seeking higher compensation for writers, a boost in contributions to pension and health funds, and better workplace standards.\nMost notably, the guild wants to factor in the streaming economy into compensation packages for its members. Residual fees — or money paid when a film or series is rerun or aired on broadcast — has helped pad the wallets of writers for years. But those fees are vanishing in the streaming era, which is where a great deal of projects ultimately land these days.\nA version of this article first appeared in the “Reliable Sources” newsletter. Sign up for the daily digest chronicling the evolving media landscape here.\nAdditionally, with the rise of streaming, there are often fewer episodes in a show’s season than before. Shows that run on broadcast networks typically include more than 20 episodes in a season. That’s not the case with shows that are ordered by Netflix and others.\n“It’s like seeing a bunch of Ubers on the road and thinking it’s a good time to be a taxi driver,” one entertainment lawyer told the FT’s Christopher Grimes on Monday. “Being a working writer is much harder than it used to be. The level of compensation, the treatment and expectations are all fundamentally different than they were.”\nAnd with the artificial intelligence revolution being set into motion, the guild is also asking for studios to establish standards around the use of the technology. It wants the use of A.I. regulated, in terms of material created for the studios.\nOf course, it’s unclear what precisely the powers that be in Hollywood will agree to and there are a number of hurdles the WGA will have to overcome to deliver its objectives to members.\nThe guild has advised members that the initial round of talks will last two weeks. At that point, there will be a break, during which it plans to update its members on progress. Negotiations would then resume with the aim of striking an agreement before May 1. The guild did not respond to a request seeking further comment on Monday.\nFor its part, the Alliance of Motion Picture and Television Producers, a trade organization that represents the Hollywood studios, said it is approaching the negotiations “with the long-term health and stability of the industry as our priority.”\n“We are all partners in charting the future of our business together and fully committed to reaching a mutually beneficial deal with each of our bargaining partners,” the AMPTP said in a statement. “The goal is to keep production active so that all of us can continue working and continue to deliver to consumers the best entertainment product available in the world.”", "date": "2023-03-20 00:00:00"}