{"article_id": 22, "url": "https://www.reuters.com/markets/carbon/ikea-says-shrinks-climate-footprint-with-help-new-light-bulbs-2023-02-15/", "title": "IKEA says shrinks climate footprint with help from new light bulbs", "text": "STOCKHOLM, Feb 15 (Reuters) - IKEA, the world's biggest furniture brand, said on Wednesday its annual carbon emissions fell 5% in the last fiscal year following efforts to boost renewable energy use and make its products more energy efficient.\nIKEA has a target to be climate positive - reducing more greenhouse gas emissions than its value chain emits - by 2030.\nIt said emissions in the entire value chain - from raw material production to customers' use and disposal of products - was estimated to total 25.8 million tonnes of CO2 equivalent in the 12 months through August 2022, against an upwardly revised 27.2 million tonnes in the 2021 fiscal year.\nOne of the main drivers of the reduction was the development of a more energy efficient LED bulb range called \"Solhetta\", said Jon Abrahamsson Ring, chief executive of the Inter IKEA Group that owns the IKEA brand.\nHelping suppliers to use more renewable energy in countries such as China - by getting them discounted loans and framework agreements to increase their access to clean power - also contributed to the emissions cut, he told Reuters.\nInter IKEA acts as franchisor to IKEA store owners and is in charge of supply.\nAbrahamsson Ring said earlier that retail sales volumes did not increase in fiscal year 2022 as IKEA struggled to meet demand due to supply shortages. Retail sales were up on the back of price hikes, to 44.6 billion euros.\nIngka Group, which owns most IKEA stores worldwide, reduced its own emissions by 23% to 455,014 tonnes of CO2 equivalent. The store owner's emission reduction was also achieved by using more renewable energy.\nReporting by Marie Mannes and Anna Ringstrom Editing by Helen Popper\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-15 00:00:00"}