{"article_id": 58, "url": "https://www.reuters.com/world/un-aviation-council-votes-hear-mh17-case-against-russia-2023-03-17/", "title": "U.N. aviation council votes to hear MH17 case against Russia", "text": "MONTREAL, March 17 (Reuters) - The United Nations aviation council on Friday voted to hear a case against Russia over the 2014 downing of Malaysia Airlines Flight MH17, the foreign ministers of Australia and the Netherlands said.\nAustralia and the Netherlands initiated the action over MH17 last year at the International Civil Aviation Organization (ICAO). The passenger jet was struck over rebel-held eastern Ukraine by what international investigators and prosecutors say was a Russian-made surface-to-air missile, killing all 298 people on board.\nAustralia has said Russia was responsible under international law and that taking the matter to ICAO would be a step forward in the fight for victims who included 38 Australians.\nThe ICAO upheld its jurisdiction to hear the matter during a session on Friday, Australian Foreign Minister Penny Wong said in a written statement.\n\"This decision is an important step in our collective efforts to hold to account those responsible for this horrific act of violence,\" Wong said.\nDutch Foreign Minister Wopke Hoekstra called the decision to hear the case \"an important step towards establishing the truth, justice and accountability\".\n\"Together with Australia, we will continue to do everything in our power to find closure for the loved ones of the 298 victims of flight #MH17,\" Hoekstra said on Twitter.\nRussia has denied any involvement in the incident, and Russia's ICAO delegation was not immediately available for comment. While the outcome at ICAO is uncertain, experts said the move may be seen as a further way to force Russia into negotiations over the incident.\nThe technical talks by ICAO's 36-member governing council come as Moscow is facing mounting rebukes over aviation-related actions following its invasion of Ukraine.\nIn October, Russia failed to win enough votes at ICAO's triennial assembly to keep its council seat. The council also called out Russia for the dual registration of commercial aircraft, which the body argued is at odds with parts of a key agreement that sets out core principles for global aviation.\nMontreal-based ICAO lacks regulatory power but holds moral suasion and sets global aviation standards overwhelmingly adopted by its 193-member states, even as it operates across political barriers.\nReporting By Allison Lampert in Montreal; Additional reporting by David Ljunggren in Ottawa, Dan Whitcomb in Los Angeles and Sam McKeith in Sydney; Editing by Cynthia Osterman\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-03-17 00:00:00"}