{
    "article_id": 74,
    "url": "https://www.reuters.com/technology/abb-sees-robust-activity-q2-profit-beats-forecasts-2023-07-20/",
    "title": "Tesla, ABB, TSMC get Q2 earnings off to downbeat start",
    "text": "[1/5] A Tesla logo is seen on a wheel rim during the media day for the Shanghai auto show in Shanghai, China April 16, 2019. REUTERS/Aly Song/File Photo\nSummary\nCompanies Musk says we're in \"turbulent times\"; shares fall\nShoppers seek cheaper appliances, says Electrolux\nABB says China orders fell in Q2\nResults will deepen worries about China's faltering economy\nLONDON, July 20 (Reuters) - ABB (ABBN.S) warned on Thursday of slowing Chinese demand, Taiwanese chipmaker TSMC forecast a drop in 2023 sales and Electrolux cautioned shoppers are seeking cheaper appliances, deepening worries about global corporate and economic health.\nThe news cast a pall over stocks as second-quarter earnings season ramps up. The S&P 500 and Nasdaq futures were indicating lower, while European stocks recovered ground lost in early trade.\nABB said its orders in China, its second-biggest market, fell 9% in the three months to the end of June, with its electrification, motion and robotics divisions all seeing lower demand.\nABB, whose results are seen as a bellwether for the health of the broader industrial economy with its motors, drives, controllers and electrification products used in transport systems and factories, also saw lower demand in Germany.\nThe comments will unsettle investors, who had hoped that Beijing's decision to abandon strict and prolonged COVID curbs at the end of last year would revive the world's second-biggest economy.\nData this week showed China's economy grew at a frail pace in the second quarter as demand weakened at home and abroad, with post-COVID momentum faltering rapidly.\nAdding to the overall gloom, Taiwanese chipmaker TSMC (2330.TW) forecast a 10% drop in 2023 sales as global economic woes dented demand for chips used in applications as varied as cars, cellphones and servers.\nSome earnings highlighted the challenge for companies trying to protect margins after raising prices to offset high energy and raw material costs since last year.\nAnalysts have warned easing input costs will put pressure on companies to start cutting prices, or they may lose business.\nLate on Wednesday, Tesla (TSLA.O) CEO Elon Musk signalled he would cut prices again on electric vehicles to shield against competition and economic uncertainty. Its shares were down almost 4% in pre-market U.S. trade.\n\"One day it seems like the world economy is falling apart, next day it's fine. I don't know what the hell is going on,\" Musk told analysts on a conference call. \"We're in, I would call it, turbulent times.\"\nSwedish hygiene product maker Essity's (ESSITYa.ST) second-quarter earnings missed market expectations, hit by wage inflation, bigger marketing costs in its consumer goods unit, and lower volumes after price hikes.\nElectrolux (ELUXb.ST), Europe's biggest home appliances maker, swung to a loss as cash-strapped shoppers opted for cheaper products and demand from residential property builders slowed.\nInvestors punished the companies' shares. Essity stock lost 11% in early trading, set for its worst day on record while Electrolux was down 15.7%, the biggest faller in Europe and on track for their worst day in 12 years.\nDOWNBEAT TONE\nThe results set a downbeat tone early in the earnings season, with soaring shopping and food bills and high interest rates curbing consumer spending and pressures building on corporate profit margins.\nAlso on Wednesday, streaming video pioneer Netflix (NFLX.O) disappointed Wall Street with second-quarter revenue that fell short of analyst estimates, sending shares tumbling nearly 9% in after-hours trading.\nEarnings at STOXX 600 companies are currently expected to fall by 9.2% in the second quarter, a big downturn from 11% growth in the first three months of the year, based on Refinitiv I/B/E/S data.\nThat's down from 29% a year ago, when the economy was recovering from the end of COVID lockdowns. Revenue is seen falling 6.2%, compared with a rise of 1.1% in the prior quarter. They would be the weakest results since the fourth quarter of 2020.\nIn the United States, earnings are expected to fall 8.2%, compared with growth of 0.2% in the first quarter and a reversal from 8.4% growth a year ago. Revenue is seen falling 0.8%, down from 13.6% a year ago.\nReporting by Reuters reporters; Writing by Josephine Mason; Editing by Sharon Singleton\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-20 00:00:00"
}