{"article_id": 33, "url": "https://www.cnbc.com/2023/01/24/qatar-doubles-credit-suisse-stake.html", "title": "Qatar doubles Credit Suisse stake as embattled lender forges ahead with strategic overhaul", "text": "The Qatar Investment Authority is the second-largest shareholder in Credit Suisse after doubling its stake in the embattled Swiss lender late last year, according to a filing with the U.S. Securities and Exchange Commission.\nThe QIA — Qatar's sovereign wealth fund — initially began investing in Credit Suisse around the time of the financial crisis. Now, it owns 6.8% of the bank's shares, according to the filing Friday, second only to the 9.9% stake purchased by the Saudi National Bank last year as part of a $4.2 billion capital raise to fund a massive strategic overhaul.\nCombined with the 3.15% owned by Saudi-based family firm Olayan Financing Company, around a fifth of the company's stock is now owned by Middle Eastern investors, Eikon data indicates.\nCredit Suisse will report its fourth-quarter and full-year earnings on Feb. 9, and has already projected a 1.5 billion Swiss franc ($1.6 billion) loss for the fourth quarter as a result of the ongoing restructuring. The shake-up is designed to address persistent underperformance in the investment bank and a series of risk and compliance failures.\nCEO Ulrich Koerner told CNBC at the World Economic Forum in Davos last week that the bank is making progress on the transformation and has seen a notable reduction in client outflows.The injection of investment from the Middle East comes as major U.S. investors Harris Associates and Artisan Partners sell down their shares in Credit Suisse. Harris remains the third-largest shareholder at 5%, but has cut its stake significantly over the past year, while Artisan has sold its position entirely.\n\n‘Final pivot’\nEarlier this month, Deutsche Bank resumed its coverage of Credit Suisse with a “hold” rating, noting that the strategy update announced in October and subsequent rights issue in December were the start of the group’s “final pivot towards more stable, higher growth, higher return, higher multiple businesses.”\n\nSwiss pension fund foundation CEO ‘not convinced’ by Credit Suisse restructure\n“While strategically largely the right measures have been announced in our view, the execution of the group’s transformation requires time to lower costs, regain operational momentum as well as reduce complexity funding costs. Hence, we expect subdued profitability, below its potential, even by 2025,” said Benjamin Goy, head of European financials research at Deutsche Bank.\n\nAs such, he said that Credit Suisse’s valuation was “not cheap based on earnings anytime soon.”\n\n‘More art than science’\nCentral to Credit Suisse’s new strategy is the spin-off of its investment bank to form CS First Boston, which will be headed by former Credit Suisse board member Michael Klein.\n\nIn a note earlier this month, Barclays Co-Head of European Banks Equity Research Amit Goel characterized Credit Suisse’s earnings estimates as “more art than science,” arguing that details remain limited on the earnings contribution from the businesses being exited.\n\n“For Q422, we will be focused on what is driving the losses (we found it quite hard to get to c.CHF1.1bn of underlying losses in the quarter), whether there are any signs of stabilisation in the business, and if there is more detail on the restructuring,” he added.", "date": "2023-01-24 00:00:00"}