{
    "article_id": 66,
    "url": "https://reuters.com/technology/space/stunning-webb-telescope-image-shows-closest-star-forming-region-2023-07-12/",
    "title": "Stunning Webb telescope image shows closest star-forming region",
    "text": "WASHINGTON, July 12 (Reuters) - NASA on Wednesday released an image obtained by the James Webb Space Telescope of the Rho Ophiuchi cloud complex, the closest star-forming region to Earth, as the U.S. space agency marked one year since it unveiled the telescope's first scientific results.\nThe Webb telescope, which was launched in 2021 and began collecting data last year, has reshaped the understanding of the early universe while taking stunning pictures of the cosmos.\nThe Rho Ophiuchi image was an example of that, showing a nebula - a humongous cloud of interstellar gas and dust that serves as a nursery for new stars - located in our Milky Way galaxy roughly 390 light years from Earth. A light year is the distance light travels in a year, 5.9 trillion miles (9.5 trillion km).\nRho Ophiuchi is only about a million years old, a blink of the eye in cosmic time.\n\"Here, we see how new suns are forming, along with planet-forming disks appearing as small dark silhouettes. These are very similar to what we think the solar system looked like more than 4.5 billion years ago,\" said astronomer and former Webb project scientist Klaus Pontoppidan, who is now a research scientist at NASA's Jet Propulsion Laboratory.\n\"As the stars and planetary systems assemble, they blow apart the dusty cocoon from which they formed in violent outbursts, as seen in red jets plowing through the cloud as a boat in water. The Rho Ophiuchi core is completely obscured by huge amounts of dust, so it is essentially invisible to telescopes working in visible light, like the Hubble telescope. Yet, Webb peers through the dust to reveal the young stars within, showing the very first stages in the life of every star,\" Pontoppidan added.\nThe image, obtained in March and April of this year, shows how the jets of material emanating from young stars affect the surrounding gas and dust while lighting up molecular hydrogen. In one part of the image, a star is seen inside a glowing cave that its stellar winds carve out in space.\n\"You see an almost impressionistic nebula crowned by three bright young stars on the top. We were surprised by the size and detail of the jets and outflows,\" Pontoppidan said.\nSince becoming operational, Webb has revealed the existence of the earliest-known galaxies and black holes. It has observed large and mature but remarkably compact galaxies teeming with stars that had formed within a few hundred million years of the Big Bang event that marked the beginning of the universe about 13.8 billion years ago - far sooner than scientists had considered possible.\n\"Some would say there are few parts of astrophysics that have not been touched by Webb in one way or another. Prominent results include the discovery of new galaxies and black holes in the early universe and new views into exoplanetary atmospheres. The Rho Ophiuchi images shows how Webb gives us a new window into the formation of stars and planets,\" Pontoppidan said.\nThe orbiting observatory was designed to be far more sensitive than its Hubble Space Telescope predecessor. Webb looks at the universe mainly in the infrared, while Hubble has examined it primarily at optical and ultraviolet wavelengths. Webb is able to look at greater distances and thus farther back into time than Hubble.\n\"In just one year, the James Webb Space Telescope has transformed humanity's view of the cosmos, peering into dust clouds and seeing light from faraway corners of the universe for the very first time,\" NASA Administrator Bill Nelson said in a statement. \"Every new image is a new discovery, empowering scientists around the globe to ask and answer questions they once could never dream of.\"\nReporting by Will Dunham, Editing by Rosalba O'Brien\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-12 00:00:00"
}