{"article_id": 10, "url": "https://www.reuters.com/business/autos-transportation/audi-ceo-planning-electric-car-factory-us-due-ira-2023-02-24/", "title": "Audi mulls U.S. plant as IRA subsidies draw carmakers", "text": "Summary\nSummary Companies Audi considering U.S. plant due to IRA subsidies - CEO\nCould build joint plant with Volkswagen Group\nVW to build new plant for Scout brand - report\nIRA gives incentive to 'speed up' localisation plans\nBERLIN, Feb 24 (Reuters) - Volkswagen-owned Audi (VOWG_p.DE) may build a factory in the United States in light of the Inflation Reduction Act, it said on Friday, the latest company to consider investments in the region to take advantage of the subsidies it offers.\nThe premium carmaker, which sold around 190,000 cars in the U.S. last year, accounting for 11% of its total sales, does not yet have a plant in the country, and is at present not eligible for tax incentives and subsidies offered under the Inflation Reduction Act (IRA) for vehicles sourced and made in North America.\nThe $430-billion IRA was passed last August and offers subsidies and tax incentives for a swathe of domestically produced green industry products, including a $7,500 consumer tax credit to buyers of North American-made electric vehicles.\nIt also includes a restriction on battery minerals and component sourcing to the region, in an attempt to phase out Chinese inputs.\nAudi plans to produce electric cars in all its locations globally by 2030, with no new combustion-engine models to be introduced beyond 2026.\n\"The IRA has made building a U.S. plant for electric cars very attractive,\" Audi Chief Executive Markus Duesmann said in an interview with German newspaper Frankfurter Allgemeine Sonntagszeitung, adding that it would most likely build a joint plant with the Volkswagen Group.\nIndustry publication Automobilwoche reported on Friday that Volkswagen planned to build its own plant in the U.S. for the Scout brand, which will make electric pick-ups and SUV trucks.\nOn being asked if the two plans were connected, an Audi spokesperson said various scenarios were possible and the companies were still evaluating options.\nCarmakers have in recent years moved to reduce exports and imports across major markets such as the United States, China and Europe and instead localise production and supply chains to lower transport and logistics costs.\nBut a growing number of firms are now announcing new investments in the United States over Europe in light of the IRA, which is worrying European officials.\nCarmaker Stellantis (STLAM.MI) said on Thursday it had already been working to localise its battery supply and EV manufacturing, but the IRA gave it \"further incentive to speed up\".\nTesla Inc (TSLA.O) has scaled back plans to produce batteries at its site in Brandenburg, Germany and is prioritising cell production in the U.S. because of the IRA.\nVolkswagen's plant in Chattanooga, Tennessee, last year began producing the ID.4 and is targeting 90,000 EVs in 2023.\nSources close to the company told Reuters last May the plant would be expanded to produce the electric minivan ID. Buzz, but the Scout brand will build off-road electric pick-up trucks and sports utility vehicles that require a new platform.\nVolkswagen is also upgrading its Mexican plants in Puebla and Silao to starting building EVs, motors and related components by 2025.\nThe carmaker is due to lay out in March how it will rejig its production network worldwide to scale up EV production.\nReporting by Victoria Waldersee, Christina Amann, Writing by Miranda Murray, Editing by Friederike Heine, Sharon Singleton and Shounak Dasgupta\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-24 00:00:00"}