{
    "article_id": 68,
    "url": "https://reuters.com/technology/space/china-plans-send-two-rockets-crewed-moon-landing-2023-07-12/",
    "title": "China plans to send two rockets for crewed moon landing",
    "text": "BEIJING, July 12 (Reuters) - China plans to send two rockets to the moon by 2030, one carrying the spacecraft that will land on the surface and the other transporting the astronauts.\nBoth the rockets will enter the moon's orbit and after a successful docking the astronauts will enter the lunar lander to descend onto the moon's surface, state media reported on Wednesday, citing a China Manned Space Agency engineer.\nThe twin-rocket plan would overcome China's longstanding technological hurdle of developing a heavy-duty rocket powerful enough to send both astronauts and a lander probe.\nAfter the astronauts have completed their scientific tasks and collected samples, the lander will transport the astronauts back to the orbiting spacecraft, on which they will return to Earth, said Zhang Hailian, deputy chief engineer at the China Manned Space, at a summit in the central Chinese city of Wuhan.\nThe race to send people to the moon has intensified in recent years with both China and the United States are eyeing potential mineral resources on the moon. Establishing lunar habitats could also help support future crewed missions to other planets such as Mars.\nChina still trails the United States in experience and technology. The last NASA crewed landing was in 1972, and U.S. astronauts are expected to return to the moon by 2025.\nTo meet China's lunar objectives, Chinese researchers are developing the super-heavy Long March 10 carrier rocket, a new-generation crewed spacecraft, a lunar lander, and a crewed lunar rover, according to Zhang.\nIn 2020, China brought back lunar samples from the moon on an uncrewed mission, making China the third nation to have retrieved lunar samples after the United States and the Soviet Union.\nReporting by Ryan Woo; Editing by Michael Perry\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-12 00:00:00"
}