{"article_id": 56, "url": "https://apnews.com/article/ford-spain-layoffs-b077f51f99d540f684c5874e45d6ff70", "title": "Ford to cut 1,100 jobs in Spain after other European layoffs", "text": "Ford to cut 1,100 jobs in Spain after other European layoffs\nFILE - Ford cars sit in the port of Valencia, Spain, on April 3, 2007 waiting for shipment. Ford Motor Co. will cut around 1,100 jobs at its plant in the eastern city of Valencia, according to a company statement. The cuts are in addition to the 2,300 layoffs largely in Germany and the U.K. that the auto manufacturer announced last month, as part of a “leaner, more competitive cost structure in Europe.” Ford Spain notified unions on Friday, March 10, 2023. (AP Photo/Herbert Knosowski)\nFILE - Ford cars sit in the port of Valencia, Spain, on April 3, 2007 waiting for shipment. Ford Motor Co. will cut around 1,100 jobs at its plant in the eastern city of Valencia, according to a company statement. The cuts are in addition to the 2,300 layoffs largely in Germany and the U.K. that the auto manufacturer announced last month, as part of a “leaner, more competitive cost structure in Europe.” Ford Spain notified unions on Friday, March 10, 2023. (AP Photo/Herbert Knosowski)\nMADRID (AP) — Ford Motor Co. announced Friday that it will cut around 1,100 jobs at its plant in the eastern Spanish city of Valencia.\nThe cuts are in addition to the 2,300 layoffs largely in Germany and the United Kingdom that the automaker announced last month as part of a “leaner, more competitive cost structure in Europe.”\nFord Spain said in a statement that it notified unions on Friday of what it described as “a profound restructuring of its operations.” Ford has recently championed the Valencia plant as its preferred site to assemble “next-generation” electric vehicles on the continent.\nJosé Luis Parra Navarro, a UGT union spokesman, said the workforce would become “surplus” when the plant switched to making electric cars because the work “requires less labor.”\nThe plant is Ford’s only such facility in Spain and currently employs 5,400 people.\nThe job cuts were “mainly due to the already announced discontinuing production of the S-Max and Galaxy models in April 2023,” Ford Spain said in an email.\nThe Dearborn, Michigan-based company has a strategy to offer an all-electric fleet in Europe by 2035 and says production of its first European-built electric car is expected to start later this year.\nThe job cuts come amid a sea change in the global auto industry from gas-guzzling combustion engines to electric vehicles. Governments are pushing to reduce the emissions that contribute to climate change, and a resulting race to develop electric vehicles has generated intense competition among automakers.\nIn January, Ford announced a new solar power plant had opened at the Valencia facility as it looks to become a carbon-neutral business.", "date": "2023-03-10 15:43:45"}