{"article_id": 38, "url": "https://www.eenewseurope.com/en/csem-opens-swiss-battery-innovation-hub/", "title": "CSEM opens Swiss Battery Innovation Hub", "text": "CSEM opens Swiss Battery Innovation Hub Business news | February 16, 2023 By Nick Flaherty\nSwiss research group CSEM has opened a Battery Innovation Hub (BIH) in Neuchâtel to boost technology development and the local supply chain.\nThe centre will bring together interdisciplinary teams to work on battery technology with local companies and is the only centre of its kind in the country. It will work on development of new chemistries and interfaces with the analysis and intelligent control of batteries to cover the entire value chain under one roof.\nAccording to a joint study by the European Patent Office and the International Energy Agency, by 2040 the world will need energy storage solutions equivalent to 50 times the current market capacity\nThis is driving the development of higher capacity batteries for European industry, particularly the automotive sector, and a focus on the supply chain.\n“Europe must no longer remain in this state of dependency. In Switzerland, we also have the skills to be at the forefront of battery development and innovation,” said Andreas Hutter, Group Leader Energy Systems at CSEM.\nThe centre will bring together over 50 researchers working on chemistry, physics, and engineering in the 400m2 centre by 2026.\n“This transfer of knowledge and technology can enable local companies to open up alternative paths and use their expertise in the promising new battery environment,” says Hutter. He points to Swiss company Bühler which now also supplies the battery industry, Kyburz, the supplier of electric scooters used by the Swiss Post Office, and Libattion, a start-up that gives a second life to batteries. The company uses procedures established by CSEM teams to qualify batteries from electric bikes for reuse in industrial machines.\nCSEM researchers are working both on direct battery improvement, for example by modifying the properties of the interfaces inside batteries, and on battery management via electronics that ensure safe operation, where a combination of non-invasive detection and local control guarantees optimal aging and longevity of the systems.\n“Our challenge is to develop disruptive technologies that make batteries more powerful and durable, with improved safety and ideally lower cost to make the European industry more competitive ” said Andrea Ingenito, Group Leader of Coatings for Energy Devices at CSEM.\nCSEM started its energy innovation program in 2013, and working with EPFL has developed a key photovoltaic technology centre that has achieved several world records for solar cell efficiencies.\n“With our new facilities, we’re expanding the existing battery landscape in Switzerland and making it more competitive,” said Christophe Ballif, VP Sustainable Energy at CSEM.\nwww.csem.ch\nShare:", "date": "2023-02-16 12:01:18"}