{
    "article_id": 75,
    "url": "https://reuters.com/technology/google-explores-ai-tools-journalists-talks-with-publishers-spokesperson-2023-07-20/",
    "title": "Google explores AI tools for journalists, in talks with publishers - spokesperson",
    "text": "July 19 (Reuters) - Google is exploring using artificial intelligence tools to write news articles and is in talks with news organizations to use the tools to assist journalists, a company spokesperson said late on Wednesday.\nThe spokesperson did not name the publishers, but the New York Times reported that Google has held discussions with the Washington Post, the Wall Street Journal-owner News Corp (NWSA.O) and even the New York Times, among others.\nThese AI tools could assist journalists with options for headlines or different writing styles, for instance, in a way that \"enhances their work and productivity,\" the Google spokesperson said, adding it was in the \"earliest stages of exploring ideas\".\n\"Quite simply these tools are not intended to, and cannot, replace the essential role journalists have in reporting, creating, and fact-checking their articles,\" the spokesperson said.\nHowever, some executives who saw Google's pitch described it as unsettling, the NYT said, adding the executives asked not to be identified. The AI tool that was pitched is called Genesis internally at Google, the NYT said, citing people familiar with the matter.\nA News Corp spokesperson declined to comment on the NYT report or the AI tool, but said, \"We have an excellent relationship with Google, and we appreciate (Google CEO) Sundar Pichai's long-term commitment to journalism.\"\nThe NYT and Washington Post did not immediately respond to Reuters' requests for comment outside regular working hours.\nThe news comes days after the Associated Press said it would partner with ChatGPT-owner OpenAI to explore the use of generative AI in news, a deal that could set the precedent for similar partnerships between the industries.\nSome outlets are already using generative AI for their content, but news publications have been slow to adopt the tech over concerns about its tendency to generate factually incorrect information, as well as challenges in differentiating between content produced by humans and computer programs.\nReporting by Urvi Dugar and Rishabh Jaiswal in Bengaluru; Editing by Savio D'Souza\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-20 00:00:00"
}