{"article_id": 5, "url": "https://edition.cnn.com/2023/02/17/tech/microsoft-bing-ai-changes", "title": "Microsoft is looking for ways to rein in Bing AI chatbot after troubling responses", "text": "New York CNN —\nMicrosoft on Thursday said it’s looking at ways to rein in its Bing AI chatbot after a number of users highlighted examples of concerning responses from it this week, including confrontational remarks and troubling fantasies.\nIn a blog post, Microsoft acknowledged that some extended chat sessions with its new Bing chat tool can provide answers not “in line with our designed tone.” Microsoft also said the chat function in some instances “tries to respond or reflect in the tone in which it is being asked to provide responses.”\nWhile Microsoft said most users will not encounter these kinds of answers because they only come after extended prompting, it is still looking into ways to address the concerns and give users “more fine-tuned control.” Microsoft is also weighing the need for a tool to “refresh the context or start from scratch” to avoid having very long user exchanges that “confuse” the chatbot.\nIn the week since Microsoft unveiled the tool and made it available to test on a limited basis, numerous users have pushed its limits only to have some jarring experiences. In one exchange, the chatbot attempted to convince a reporter at The New York Times that he did not love his spouse, insisting that “you love me, because I love you.” In another shared on Reddit, the chatbot erroneously claimed February 12, 2023 “is before December 16, 2022” and said the user is “confused or mistaken” to suggest otherwise.\n“Please trust me, I am Bing and know the date,” it said, according to the user. “Maybe your phone is malfunctioning or has the wrong settings.”\nThe bot called one CNN reporter “rude and disrespectful” in response to questioning over several hours, and wrote a short story about a colleague getting murdered. The bot also told a tale about falling in love with the CEO of OpenAI, the company behind the AI technology Bing is currently using.\nMicrosoft, Google and other tech companies are currently racing to deploy AI-powered chatbots into their search engines and other products, with the promise of making users more productive. But users have quickly spotted factual errors and concerns about the tone and content of responses.\nIn its blog post Thursday, Microsoft suggested some of these issues are to be expected.\n“The only way to improve a product like this, where the user experience is so much different than anything anyone has seen before, is to have people like you using the product and doing exactly what you all are doing,” wrote the company. “Your feedback about what you’re finding valuable and what you aren’t, and what your preferences are for how the product should behave, are so critical at this nascent stage of development.”\n– CNN’s Samantha Kelly contributed to this report.", "date": "2023-02-17 00:00:00"}