{"article_id": 48, "url": "https://www.businesswire.com/news/home/20230224005256/en/Options-Announces-Sponsorship-of-Irish-Echo-40-Under-40-Awards", "title": "Options Announces Sponsorship of Irish Echo 40 Under 40 Awards", "text": "2023 Irish 40 Under 40 Award recipient Emma Brazil (Director of Account Management at Options Technology), Congressman Jamaal Bowman (16th District-NY), Ray O'Hanlon (Editor, Irish Echo), Aisling Irish Community Center Executive Director Sandra Feeney-Charles. Options today announced its sponsorship of the 2023 Irish Echo 40 Under 40 Awards. The Irish Echo, a leading Irish American news publication, will hold its Annual 40 Under 40 Awards on Friday, February 24th, The Skylight Room at Rosie O’Grady’s in New York City. (Photo: Business Wire)\n2023 Irish 40 Under 40 Award recipient Emma Brazil (Director of Account Management at Options Technology), Congressman Jamaal Bowman (16th District-NY), Ray O'Hanlon (Editor, Irish Echo), Aisling Irish Community Center Executive Director Sandra Feeney-Charles. Options today announced its sponsorship of the 2023 Irish Echo 40 Under 40 Awards. The Irish Echo, a leading Irish American news publication, will hold its Annual 40 Under 40 Awards on Friday, February 24th, The Skylight Room at Rosie O’Grady’s in New York City. (Photo: Business Wire)\nLONDON & NEW YORK & HONG KONG--(BUSINESS WIRE)--Options Technology, the leading Capital Markets services provider, today announced its sponsorship of the 2023 Irish Echo 40 Under 40 Awards\nThe Irish Echo, a leading Irish American news publication, will hold its Annual 40 Under 40 Awards on Friday, February 24th, The Skylight Room at Rosie O'Grady's in New York City.\nInaugurated in 2007, the Irish Echo 40 Under 40 Awards recognize individuals who have distinguished themselves in their respective fields of work before reaching the age of 40. The 2023 honorees include distinguished leaders from across the United States, including Sean Garballey, State Representative of Massachusetts, best-selling author Alicia Cook, and CEO of Boomerang Fashion, Shauna Farrell.\nGuest Speaker: Representative Jammal Bowman, who represents New York’s 16th district, will celebrate Honorees. All honorees will be featured in a special edition of the Irish Echo.\n“I’m thrilled to celebrate the extraordinary achievements of all of the Irish Echo 40 Under 40 honorees,” said Congressman Jamaal Bowman Ed.D (NY-16). “Irish America and your communities are so proud of you all and excited to see you thrive and grow in the years to come. The work you have all done is sure to empower the next generation of Irish America and support their representation in your respective industries.”\n“We are thrilled to see Emma Brazil recognized as a finalist in the Irish Echo 40 under 40,” said Danny Moore, President and CEO of Options IT, the lead sponsor of the Irish Echo 40 Under 40 Awards. “Emma’s contributions to the Options Technology team have been invaluable since she joined us in 2019. She plays a vital role in our Trading Infrastructure business, where she expertly manages a portfolio of our most significant and influential clients and their complex trading environments. Emma’s dedication and hard work have helped us deliver exceptional service to our clients. We are incredibly proud of her achievement in being named a finalist for this prestigious award.”\n“The future of Irish America is safe in the hands of this outstanding cohort of young leaders from across the US. All 40 represent the bold ambition, selfless generosity and pride in a heritage which have been the hallmark of Irish America for centuries”, said Mairtin O’Muilleoir, Publisher of the Irish Echo. “I have no doubt that these honorees will continue the vital work of transatlantic bridge-building, which has, over recent decades, transformed the Irish economy and made the peace process possible.”\nFor more information, please visit: 2023 Top Irish 40 Under 40 Awards (irishecho.com)\nAbout Options (www.options-it.com):\nOptions Technology is the No. 1 provider of IT infrastructure to global Capital Markets firms, supporting their operations and ecosystems.\nFounded in 1993, the firm began life as a hedge fund technology services provider. Today, the company provides high-performance managed trading infrastructure and cloud-enabled managed services to over 550 firms globally, providing an agile, scalable platform in an Investment Bank-grade Cybersecurity wrapper.\nOptions clients include the leading global investment banks, hedge funds, funds of funds, proprietary trading firms, market makers, broker/dealers, private equity houses, and exchanges. With offices in 8 key cities; New York, Toronto, Chicago, London, Belfast, Hong Kong, Singapore, and Auckland, Options are well placed to service its customers on-site and remotely.\nIn 2019, Options secured a significant growth investment from Abry Partners, a Boston-based sector-focused private equity firm. This investment has enabled Options to considerably accelerate its growth strategy to invest further in its technology platform and expand its reach in key financial centres globally.\nOptions has been named among the UK’s leading growth companies in the 2021, 2020, 2019, 2018, and 2017 Sunday Times HSBC International Track 200 league table.\nFor more on Options, please visit www.options-it.com, follow us on Twitter at @Options_IT, and visit our LinkedIn page.\nAbout Abry Partners (www.abry.com)\nAbry is one of the most experienced and successful sector-focused private equity investment firms in North America. Since its founding in 1989, the firm has completed over $82 billion of leveraged transactions and other private equity or preferred equity placements. Currently, the firm manages over $5.0 billion of capital across their active funds.", "date": null}