{"article_id": 9, "url": "https://www.prnewswire.com/news-releases/microsoft-and-nvidia-announce-expansive-new-gaming-deal-301752099.html", "title": "Microsoft and NVIDIA announce expansive new gaming deal", "text": "Partnership will bring blockbuster lineup of Xbox games, including Minecraft and Activision titles like Call of Duty, to NVIDIA GeForce NOW cloud gaming service\nREDMOND, Wash. and SANTA CLARA, Calif., Feb. 21, 2023 /PRNewswire/ -- On Tuesday, Microsoft and NVIDIA announced the companies have agreed to a 10-year partnership to bring Xbox PC games to the NVIDIA® GeForce NOW™ cloud gaming service, which has more than 25 million members in over 100 countries.\nThe agreement will enable gamers to stream Xbox PC titles from GeForce NOW to PCs, macOS, Chromebooks, smartphones and other devices. It will also enable Activision Blizzard PC titles, such as Call of Duty, to be streamed on GeForce NOW after Microsoft's acquisition of Activision closes.\n\"Xbox remains committed to giving people more choice and finding ways to expand how people play,\" said Microsoft Gaming CEO Phil Spencer. \"This partnership will help grow NVIDIA's catalog of titles to include games like Call of Duty, while giving developers more ways to offer streaming games. We are excited to offer gamers more ways to play the games they love.\"\n\"Combining the incredibly rich catalog of Xbox first party games with GeForce NOW's high-performance streaming capabilities will propel cloud gaming into a mainstream offering that appeals to gamers at all levels of interest and experience,\" said Jeff Fisher, senior vice president for GeForce at NVIDIA. \"Through this partnership, more of the world's most popular titles will now be available from the cloud with just a click, playable by millions more gamers.\"\nThe partnership delivers increased choice to gamers and resolves NVIDIA's concerns with Microsoft's acquisition of Activision Blizzard. NVIDIA therefore is offering its full support for regulatory approval of the acquisition.\nMicrosoft and NVIDIA will begin work immediately to integrate Xbox PC games into GeForce NOW, so that GeForce NOW members can stream PC games they buy in the Windows Store, including third-party partner titles where the publisher has granted streaming rights to NVIDIA. Xbox PC games currently available in third-party stores like Steam or Epic Games Store will also be able to be streamed through GeForce NOW.\nVisit the GeForce NOW website for more information on the service and follow along every GFN Thursday for the latest news, including release dates for upcoming Microsoft game titles coming to the GeForce NOW service.\nThe agreement was announced today at a Microsoft press conference in Brussels, Belgium. Microsoft also shared today that it finalized a 10-year agreement to bring the latest version of Call of Duty to the Nintendo platform following the merger with Activision.\nAbout NVIDIA\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company's invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\nAbout Microsoft\nMicrosoft (Nasdaq \"MSFT\" @microsoft) enables digital transformation for the era of an intelligent cloud and an intelligent edge. Its mission is to empower every person and every organization on the planet to achieve more.\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, and performance of NVIDIA's products and technologies, including GeForce NOW; and NVIDIA's partnership with Microsoft and the benefits and impact there of are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; NVIDIA's reliance on third parties to manufacture, assemble, package and test its products; the impact of technological development and competition; development of new products and technologies or enhancements to NVIDIA's existing product and technologies; market acceptance of NVIDIA's products or NVIDIA's partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of NVIDIA's products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on NVIDIA's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, GeForce and GeForce NOW are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.\nSOURCE Microsoft Corp.", "date": null}