{
    "article_id": 78,
    "url": "https://reuters.com/technology/cerebras-systems-signs-100-mln-ai-supercomputer-deal-with-uaes-g42-2023-07-20/",
    "title": "Cerebras Systems signs $100 mln AI supercomputer deal with UAE's G42",
    "text": "[1/2] A view of Condor Galaxy supercomputing systems for artificial intelligence work made by Cerebras Systems, in Santa Clara, California, U.S., in this undated handout photo received on July 19, 2023. Courtesy of Rebecca Lewington of Cerebras Systems/Handout via REUTERS\nJuly 20 (Reuters) - Cerebras Systems on Thursday said that it has signed an approximately $100 million deal to supply the first of three artificial intelligence (AI) supercomputers to the United Arab Emirates-based technology group G42.\nThe deal comes as cloud computing providers around the world are searching for alternatives to chips from Nvidia Corp (NVDA.O), the market leader in AI computing whose products are in short supply, thanks to the surging popularity of ChatGPT and other services. Cerebras is one of several startups looking to challenge Nvidia.\nSilicon Valley-based Cerebras said that G42 has agreed to purchase three of what it calls its Condor Galaxy systems, all of which it will build in the U.S. to speed up the roll out. The first one will come online this year, with two more coming in early 2024.\nAbu Dhabi-based G42, a tech conglomerate with nine operating companies that include datacenter and cloud service businesses, says it plans to use the Cerebras systems to sell AI computing services to health care and energy companies. G42 has raised $800 million from U.S. tech investment firm Silver Lake, which has backing from Mudabala, the UAE's soverign wealth fund.\n\"Cerebras has what they call a 'white glove' service that made it easy for us\" to build AI systems on its machines, G42 Cloud CEO Talal AlKaissi told Reuters.\n\"There will be some excess capacity that we hope to wholesale with Cerebras to customers in the open-source AI community from many places around the world, especially in the U.S. ecosystem.\"\nThe contract to complete the first of the three systems announced on Thursday is worth about $100 million, Cerebras CEO Andrew Feldman said.\n\"What we're saying is that the $100 million contract takes us through Condor Galaxy 1... That's the unit, the building block.\"\nG42 Cloud's AlKaissi declined to comment on the terms of the deal.\nReporting by Stephen Nellis in San Francisco and Krystal Hu in New York; Editing by Rashmi Aich\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-20 00:00:00"
}