{
    "article_id": 71,
    "url": "https://reuters.com/technology/space/ariane-5-launches-final-mission-europe-faces-space-gap-2023-07-05/",
    "title": "Ariane 5 launches final mission as Europe faces space gap",
    "text": "July 5 (Reuters) - Europe's Ariane 5 rocket on Wednesday blasted off from French Guiana for the final time, carrying two military communications satellites and leaving its nations with a vacuum in autonomous access to space for the first time in more than four decades.\nThe 53-metre-tall, three-stage launcher left the launch pad in the French spaceport of Kourou on its 117th and final mission at 7 p.m. local time (2300 GMT), deploying two satellites on schedule roughly 30 minutes later, according to a live webcast.\n\"Ariane 5 is now over, and Ariane 5 has perfectly finished its work,\" Arianespace CEO Stephane Israel said on the webcast.\nThe mission to send France's Syracuse 4B and Germany's Heinrich Hertz (H2Sat) satellites to geostationary orbit caps 27 years of service for Ariane 5, whose successor - Ariane 6 - has been hit by technical delays until 2024 for operational use.\nEurope until recently depended on Ariane 5 and its 11-tonne-plus capacity for heavy missions, as well as Russia's Soyuz launcher for medium payloads and Italy's Vega for small ones.\nBut Moscow last year withdrew access to Soyuz amid tensions over Ukraine and the upgraded Vega C remains grounded after the failure of its second launch in December, sparking what the head of the European Space Agency has termed a space launch \"crisis.\"\nThe CEO of Airbus (AIR.PA), which co-owns manufacturer ArianeGroup with France's Safran (SAF.PA), said in June the gap highlighted Europe's \"vulnerability\" in space. \"All pressure is now on Ariane 6,\" Guillaume Faury told the Paris Air Forum.\nThe first test launch of Ariane 6 is expected at the end of the year depending on tests to be carried out in the summer, with the first commercial operation planned for next year.\nThe final launch of Ariane 5 was delayed last month for technical reasons and again this week because of weather.\nLed initially by France, Germany and the UK, Europe's Ariane series pioneered commercial launches but now faces intense competition from Elon Musk's SpaceX, prompting the development of a more inexpensive Ariane 6 to better compete with the Falcon 9.\nDevelopment of the family of launchers began in 1973, with the first Ariane 1 lifting off in 1979.\nAriane 5's maiden flight in 1996 ended in failure as the rocket went off course after 40 seconds and self-destructed.\nBut the new workhorse took part in several launch milestones including the James Webb Telescope in 2021, in partnership with NASA and the Canadian Space Agency, as well as Europe's comet-chasing Rosetta mission, which deployed a landing probe in 2014.\nReporting by Tim Hepher in Paris and Joey Roulette in Washington Editing by Matthew Lewis\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-05 00:00:00"
}