{"article_id": 4, "url": "https://edition.cnn.com/2023/02/22/tech/ftc-amazon-one-medical-deal", "title": "Amazon closes its acquisition of One Medical, but scrutiny of the deal is not over", "text": "Washington, DC CNN —\nAmazon closed its acquisition of health care provider One Medical and its parent in a $3.9 billion deal on Wednesday, hours after the Federal Trade Commission said it would not challenge the purchase but that regulators were still investigating potential competitive and consumer harms of the transaction.\nThe landmark deal will turn the e-commerce giant into a provider of primary medical care with access to more than 200 brick-and-mortar doctors’ offices, along with roughly 815,000 One Medical members, according to that company’s latest financial statement.\nThe One Medical deal would also allow Amazon to expand its telehealth services and acquire valuable relationships with hospital systems, industry analysts have said.\nOn Wednesday, Amazon said One Medical will offer new customers a $55 discount on annual memberships for a limited time.\n“We’re on a mission to make it dramatically easier for people to find, choose, afford, and engage with the services, products, and professionals they need to get and stay healthy, and coming together with One Medical is a big step on that journey,” said Neil Lindsay, senior vice president of Amazon Health Services, in a release. “One Medical has set the bar for what a quality, convenient, and affordable primary care experience should be like. We’re inspired by their human-centered, technology-forward approach and excited to help them continue to grow and serve more patients.”\nBut while Amazon can consummate the deal without the immediate threat of an FTC antitrust suit, the agency is still investigating the acquisition and can still challenge the deal after the fact.\n“The FTC’s investigation of Amazon’s acquisition of One Medical continues,” said FTC spokesman Douglas Farrar. “The commission will continue to look at possible harms to competition created by this merger, as well as possible harms to consumers that may result from Amazon’s control and use of sensitive consumer health information held by One Medical.”\nThe FTC plans to warn Amazon it may close the deal at its own risk, an agency official said. Known as a “pre-consummation warning,” the FTC began sending such letters to merging companies in 2021 in response to a surge in proposed deals that threatened to overwhelm regulators’ investigative capacity.\nThe warning highlights the continued legal risk for Amazon and the potential concerns driving the FTC probe. Worries include not only the potential for Amazon to entrench its economic dominance but also fears that its acquisition of valuable health data could lead to the misuse of that information for other purposes, such as targeted advertising or e-commerce, the agency official said.\nAmazon’s deal to acquire One Medical follows its 2018 purchase of the online pharmacy service PillPack, which later became Amazon Pharmacy. Separately, Amazon partnered with JPMorgan Chase and Berkshire Hathaway on an effort to provide better health care services and insurance at a lower cost to workers and families at the three companies, and possibly other businesses, too. That effort, called Haven, shut down in 2021.", "date": "2023-02-22 00:00:00"}