{"article_id": 2, "url": "https://www.businesswire.com/news/home/20230228005915/en/Ericsson-and-Aeris-Communications-Showcase-Combined-IoT-Capabilities-at-Mobile-World-Congress", "title": "Ericsson and Aeris Communications Showcase Combined IoT Capabilities at Mobile World Congress", "text": "SAN JOSE, Calif.--(BUSINESS WIRE)--At Mobile World Congress (MWC) in Barcelona, Ericsson (NASDAQ: ERIC) and Aeris Communications see growing excitement among partners and customers about the joint capabilities of their combined companies. Ericsson announced in December 2022 the transfer of its IoT Accelerator and Connected Vehicle Cloud businesses to Aeris, a leading provider of IoT solutions based in San Jose, California. Close is expected during Q1 2023.\nThe combined capabilities of Aeris’ and Ericsson’s IoT business will create a leader in the fragmented IoT market that brings unprecedented scale, stability, reliability and security to launch and manage IoT programs around the world. Aeris’ secure Intelligent IoT Network and value-added services, targeting industry verticals such as Transportation, Utilities, Automotive and Healthcare, provide opportunities for communications service providers (CSPs) to monetize new services on top of global connectivity offered through Ericsson’s award-winning IoT Accelerator platform today.\nAt MWC, the combined team is showcasing new security capabilities that protect IoT programs from cyber security threats and other vulnerabilities. Already receiving positive feedback from customers, this is one of the first innovations the combined team will be offering to tens of millions of IoT devices on the IoT Accelerator platform.\nComments from partners:\n“We have a long history of working together and a very successful joint venture with Aeris in Japan, and we enjoy the benefits of a global ecosystem as a key Ericsson IoT Accelerator partner,” says Daichi Nozaki, Vice President and Head of the Global Business Division at SoftBank Corp. and President and CEO of SB Telecom America Corp. “We are looking forward to the innovation Aeris and Ericsson will together bring to the IoT market and connected vehicle industry.”\nMats Lundquist, CEO of Telenor Connexion, says: “We are excited to start our partnership with Aeris to provide innovative IoT solutions to businesses worldwide. By combining Aeris’ operational leadership and technology with Telenor’s extensive network coverage and global support infrastructure, we will unlock new levels of value for our customers. With our successful track record of global IoT deployments, we’re excited to continue pushing the boundaries of innovation and meeting the evolving needs of businesses in today’s fast-paced digital landscape. Together with Aeris, we will strengthen our commitment to provide world-class IoT solutions that help businesses achieve their goals.”\nMark Chapman, Executive – Industry, IoT & Unified Communications at Telstra, says: “We have a long partnership with Ericsson, and we look forward to continuing that and working with Aeris Communications, particularly on our pioneering Device Connect which helps customers efficiently manage their network of IoT devices. With Australia’s largest IoT network, our team of dedicated IoT specialists and as a foundational carrier partner in the IoT Accelerator ecosystem, we’re committed to being a leader in enterprise IoT solutions and partnering with customers to solve their real-world business challenges.”\nUpon close, Aeris will provide the full lifecycle support for IoT programs across multiple industries, use cases and geographies to Ericsson’s current IoT customers and partners.\nCome visit Ericsson IoT and Aeris at the Ericsson Hall (hall 2) during Mobile World Congress in Barcelona from February 27 through March 2, 2023.\nNOTES TO EDITORS\nRELATED CONTENT\nAeris to acquire IoT business from Ericsson\nFOLLOW US:\nSubscribe to Ericsson press releases here\nSubscribe to Ericsson blog posts here\nhttps://www.twitter.com/ericsson\nhttps://www.facebook.com/ericsson\nhttps://www.linkedin.com/company/ericsson\nMORE INFORMATION AT:\nEricsson Newsroom\nmedia.relations@ericsson.com (+46 10 719 69 92)\ninvestor.relations@ericsson.com (+46 10 719 00 00)\nABOUT ERICSSON\nEricsson enables communications service providers to capture the full value of connectivity. The company’s portfolio spans the following business areas: Networks, Cloud Software and Services, Enterprise Wireless Solutions, Global Communications Platform, and Technologies and New Businesses. It is designed to help our customers go digital, increase efficiency and find new revenue streams. Ericsson’s innovation investments have delivered the benefits of mobility and mobile broadband to billions of people globally. Ericsson stock is listed on Nasdaq Stockholm and on Nasdaq New York. www.ericsson.com\nABOUT AERIS COMMUNICATIONS\nFounded in 1996, Aeris is a global IoT solutions leader with a proven history of helping companies unlock the value of IoT. For decades, we have powered critical projects for some of the most complex customers of IoT services. Aeris strives to fundamentally improve businesses by dramatically reducing costs, accelerating time-to-market, and enabling new revenue streams. Built from the ground up for IoT and road tested at scale, Aeris’ offering is based on the broadest technology stack in the industry, spanning connectivity up to vertical applications. As veterans of the industry, we know that implementing an IoT solution can be complex, and we pride ourselves on making it simpler. www.aeris.com", "date": null}