{"article_id": 36, "url": "https://apnews.com/article/credit-suisse-ubs-swiss-bank-svb-7d4c2c82b6df9830c0254ef0de62e870", "title": "Credit Suisse-UBS deal offers hope, but bank doubts persist", "text": "Five to twelve \"fuenf vor zwoelf\" is written on a clock next to a logo of the Swiss bank Credit Suisse, in Zurich, Switzerland, Monday, March 20, 2023. Shares of Credit Suisse plunged 60.5% on Monday after banking giant UBS said it would buy its troubled Swiss rival for almost $3.25 billion in a deal orchestrated by regulators to try to stave off further turmoil in the global banking system. (Ennio Leanza/Keystone via AP)\nFive to twelve \"fuenf vor zwoelf\" is written on a clock next to a logo of the Swiss bank Credit Suisse, in Zurich, Switzerland, Monday, March 20, 2023. Shares of Credit Suisse plunged 60.5% on Monday after banking giant UBS said it would buy its troubled Swiss rival for almost $3.25 billion in a deal orchestrated by regulators to try to stave off further turmoil in the global banking system. (Ennio Leanza/Keystone via AP)\nLONDON (AP) — Credit Suisse shares plunged Monday after Swiss authorities cut a deal with its bigger rival UBS to acquire the troubled bank at a marked-down price. But European bank stocks and the wider market gained as investors watch whether moves to shore up banks will stem further upheaval in the global financial system .\nShares of Credit Suisse , whose woes stem from questions over its internal controls, closed nearly 56% lower a day after UBS said it would buy its fellow Swiss bank for a lowball price of 3 billion Swiss francs ($3.25 billion). The shares traded at about the level they are valued at in the deal.\nSwiss regulators orchestrated the purchase in a bid to stop more turmoil after the collapse of two U.S. banks . In an indication of the frantic, behind-the-scenes deal-making to resolve the issue before markets opened, the acquisition was announced late Sunday.\nThere is still uncertainty over how the deal will play out for the combined lender and what comes next for the wider banking system. Analysts say some previous forced bank mergers didn’t work out well for shareholders in the long run.\nIt could be that no more banks get into trouble, but it’s also possible that “we just go from one weak institution falling over to the next,” said Vicky Redwood, senior economic adviser at Capital Economics.\nThere no other obvious candidates that could be singled out like Credit Suisse, but it’s “hard to predict where the problems will emerge,” she said.\nUBS shares initially dropped on the Swiss stock exchange but closed up 1.3%. The deal whipsawed other European bank stocks , which tumbled before some clawed back their losses. Germany’s Deutsche Bank, France’s BNP Paribas and Italy’s UniCredit ended higher, while London-based Barclays sank 2.3%.\nSwiss authorities urged UBS to take over its smaller rival after a central bank plan for Credit Suisse to borrow up to 50 billion francs ($54 billion) last week failed to reassure investors and customers.\nMany of Credit Suisse’s problems were unique and unlike the weaknesses that brought down Silicon Valley Bank and Signature Bank in the U.S., including high interest rates. Those U.S. failures have raised questions about other potentially weak global financial institutions, sweeping up the already beleaguered Swiss bank.\nCredit Suisse has faced an array of troubles in recent years, including bad bets on hedge funds , repeated shakeups of its top management and a spying scandal involving UBS.\nAnalysts and financial leaders say safeguards are stronger since the 2008 global financial crisis and that banks worldwide have plenty of available cash and support from central banks. But concerns about risks to the deal, losses for some investors and Credit Suisse’s falling market value could renew fears about the health of banks .\nTobias Straumann, an economic history professor at University of Zurich, said the merger was the right move because the U.S. bank collapses and the danger to Credit Suisse was “an international banking crisis in the making.”\n“Markets are very nervous, and I think an additional accident in Switzerland would have fueled a lot of problems,” he said.\nCredit Suisse is among 30 financial institutions known as globally systemically important banks, and authorities were worried about the fallout if it were to fail.\nUBS is bigger but Credit Suisse wields considerable influence, with $1.4 trillion assets under management. It has significant trading desks around the world, caters to the rich through its wealth management business, and is a major mergers and acquisitions adviser. However, Credit Suisse weathered the 2008 financial crisis without assistance, unlike UBS.\nAs part of the deal, approximately 16 billion francs ($17.3 billion) in higher-risk Credit Suisse bonds will be wiped out, leaving investors with hefty losses. Lawyers were already circling, eyeing possible legal action to get compensation for bondholders amid concern about the market for those bonds and other banks that hold them.\nThe combination of the two Swiss banks, each with histories dating to the mid-19th century, strikes at the country’s reputation as a global financial center — putting it on the cusp of having a single big national bank that would be too big to fail.\nSome customers were caught off guard by the turmoil, at odds with Switzerland’s reputation as as stable banking haven.\nSahil Dua, an Indian software engineer living in Zurich, holds a UBS account but opened one at Credit Suisse last Tuesday, the same day the lender flagged “material weaknesses” in internal financial controls that ultimately helped spark its downward spiral.\n“My impression as a customer,” Dua said, is “that at least these two banks were going to be fine, whatever happens.”\nDua said he wanted the credit card that came with the Credit Suisse account and that he considered switching over his primary bank account and bringing his savings from UBS. Not anymore.\nHe has a Credit Suisse account “with a balance of zero, and I’m glad that it’s still zero because I didn’t add any money yet to it.” In the future, he plans to spread out his money in more than one bank.\n“I will look into diversification more seriously now,” Dua said.\nAs the market tries to figure out what comes next after the merger, Straumann, the professor, said he wouldn’t be surprised to see problems for regional banks in Europe after further interest rate increases , much like what happened with midsized banks in U.S.\n“The banking system of Europe has not fully recovered from the crisis” in 2008, he said. “It’s better, of course, than it used to be, but it’s vulnerable.”\n___\nAssociated Press writers Courtney Bonnell in London and David McHugh in Frankfurt, Germany, contributed.", "date": "2023-03-20 05:52:45"}