{"article_id": 53, "url": "https://apnews.com/article/tiktok-china-cybersecurity-data-privacy-595f9ae7c0a1fc22f0b285cede6bd67c", "title": "TikTok bans deepfakes of young people as it updates guidelines", "text": "FILE - The TikTok Inc. building is seen in Culver City, Calif., on March 17, 2023. TikTok on Tuesday, March 21, 2023, rolled out updated rules and standards for content and users as it faces increasing pressure from Western authorities over concerns that material on the popular Chinese-owned video-sharing app could be used to push false information. The company released a reorganized set of community guidelines that include eight principles to guide content moderation decisions. (AP Photo/Damian Dovarganes)\nFILE - The TikTok Inc. building is seen in Culver City, Calif., on March 17, 2023. TikTok on Tuesday, March 21, 2023, rolled out updated rules and standards for content and users as it faces increasing pressure from Western authorities over concerns that material on the popular Chinese-owned video-sharing app could be used to push false information. The company released a reorganized set of community guidelines that include eight principles to guide content moderation decisions. (AP Photo/Damian Dovarganes)\nLONDON (AP) — TikTok went on a counteroffensive Tuesday amid increasing Western pressure over cybersecurity and misinformation concerns , rolling out updated rules and standards for content as its CEO warned against a possible U.S. ban on the Chinese-owned video sharing app.\nCEO Shou Zi Chew is scheduled to appear Thursday before U.S. congressional lawmakers, who will grill him about the company’s privacy and data-security practices and relationship with the Chinese government.\nChew said in a TikTok video that the hearing “comes at a pivotal moment” for the company, after lawmakers introduced measures that would expand the Biden administration’s authority to enact a U.S. ban on the app, which the CEO said more than 150 million Americans use.\n“Some politicians have started talking about banning TikTok. Now this could take TikTok away from all 150 million of you,” said Chew, who was dressed casually in jeans and blue hoodie, with the dome of the U.S. Capitol in Washington in the background.\n“I’ll be testifying before Congress this week to share all that we’re are doing to protect Americans using the app,” he said.\nTikTok app has come under fire in the U.S. , Europe and Asia-Pacific , where a growing number of governments have banned TikTok from devices used for official business over worries it poses risks to cybersecurity and data privacy or could be used to push pro-Beijing narratives and misinformation .\nSo far, there is no evidence to suggest this has happened or that TikTok has turned over user data to the Chinese government, as some of its critics have argued it would do.\nNorway and the Netherlands on Tuesday warned apps like TikTok should not be installed on phones issued to government employees, both citing security or intelligence agencies.\nThere’s a “high risk” if TikTok or Telegram are installed on devices that have access to “internal digital infrastructure or services,” Norway’s justice ministry said, without providing further details.\nTikTok also rolled out updated rules and standards for content and users in a reorganized set of community guidelines that include eight principles to guide content moderation decisions.\n“These principles are based on our commitment to uphold human rights and aligned with international legal frameworks,” said Julie de Bailliencourt, TikTok’s global head of product policy.\nShe said TikTok strives to be fair, protect human dignity and balance freedom of expression with preventing harm.\nThe guidelines, which take effect April 21, were repackaged from TikTok’s existing rules with extra details and explanations.\nAmong the more significant changes are additional details about its restrictions on deepfakes, also known as synthetic media created by artificial intelligence technology. TikTok more clearly spells out its policy, saying all deepfakes or manipulated content that show realistic scenes must be labeled to indicate they’re fake or altered in some way.\nTikTok had previously banned deepfakes that mislead viewers about real-world events and cause harm. Its updated guidelines say deepfakes of private figures and young people are also not allowed.\nDeepfakes of public figures are OK in certain contexts, such as for artistic or educational content, but not for political or commercial endorsements.\n_____\nAP writer Jan M. Olsen in Copenhagen, Denmark, contributed.", "date": "2023-03-21 12:14:40"}