{"article_id": 12, "url": "https://apnews.com/article/nissan-electric-vehicles-rare-earths-92e953edca010476124c45a8544f5b38", "title": "Japan’s Nissan slashing EV costs, cuts rare materials use", "text": "FILE - This is a 2020 Nissan Leaf on display at the 2020 Pittsburgh International Auto Show Thursday, Feb.13, 2020 in Pittsburgh. Nissan is speeding up its shift toward electric vehicles, especially in Europe where emissions regulations are most stringent, the company said Monday, Feb. 27, 2023.(AP Photo/Gene J. Puskar, File)\nFILE - This is a 2020 Nissan Leaf on display at the 2020 Pittsburgh International Auto Show Thursday, Feb.13, 2020 in Pittsburgh. Nissan is speeding up its shift toward electric vehicles, especially in Europe where emissions regulations are most stringent, the company said Monday, Feb. 27, 2023.(AP Photo/Gene J. Puskar, File)\nTOKYO (AP) — Japanese automaker Nissan is revving up its electrification shift and slashing costs by using the same components across models and reducing use of expensive rare materials.\nNissan Motor Co. presented its “X-in-1” development strategy Thursday, in which the X stands for various powertrain parts such as an electric motor and inverter that can be used across models. The company said development and manufacturing costs will be reduced by 30% in 2026 compared to 2019 levels.\nThe Yokohama-based automaker was a pioneer in electric vehicles but rivals like Tesla and BYD of China have overtaken it.\nAs the move toward ecological models gains momentum around the world, driven by worries over climate change, Nissan has been eager to showcase its prowess.\nIts senior vice president, Toshihiro Hirai, acknowledged that prices of rare earths and other materials needed to make electric vehicle batteries and other parts are expected to rise in coming years. That means automakers must have a solid strategy for obtaining raw materials if they hope to succeed in electrification.\n“We make the most of our expertise and know-how from our more than a decadelong development and production of electrified technologies,” said Hirai.\nCompared to the first-generation vehicle the Leaf, rare materials account for 25% of the weight of the 2019 Nissan Note EV. Nissan aims to make that 1% or less.\nNissan, which also makes the March subcompact and Infiniti luxury models, is working on solid-state battery technology for EVs, a move that if successful is expected to radically reduce costs.\nBy 2030, Nissan’s EV offerings will cost about the same at dealers as the equivalent regular gasoline-engine models, Hirai said.\nThe cheapest EVs like the Leaf now sell for under $30,000, although small internal-combustion engine cars are cheaper, at about $21,000 for the Nissan Sentra in the U.S.\nA Tesla Model 3, a relatively affordable model for a Tesla, sells for about $43,000.\nBut EVs are usually eligible for tax credits and other incentives. High gasoline prices might make EVs a smart buy in the long run, although much depends on the owner’s driving habits.\nA Consumer Reports analysis last year said that based on the gas price at that time of $4.31 a gallon, EV owners could save between $1,800 and $2,600 in operating and maintenance costs for every 15,000 miles they drive, compared to drivers of gas-powered vehicles.\nThat’s the average distance newer vehicles are driven in a year in the U.S. Gas prices have since fallen, so the savings would be lower but still significant.\nHirai said people find driving an electric vehicle less stressful because it’s quiet and delivers a smooth ride, even over rough terrain, while maintaining the fun feel of driving. One advantage of an EV is its more precise control over each wheel, which can effectively counter bumps and jolts.\nNissan has promised 27 new electrified models, including eight e-Power “series hybrid” models, which have both a gas engine and electric motor, by fiscal 2030.\n___\nYuri Kageyama is on Twitter https://twitter.com/yurikageyama\nFind more AP coverage of technology at https://apnews.com/hub/technology", "date": "2023-03-09 01:21:41"}