{
    "article_id": 98,
    "url": "https://techcrunch.com/2023/07/19/kitchen-robot-botinkit-raises-13m-from-dji-angel-and-others/",
    "title": "Kitchen robot Botinkit raises $13M from DJI angel and others",
    "text": "Having worked in the food industry for several years, Shirley Chen saw firsthand the challenges of managing staffing and training for restaurant expansion. So when she met her future co-founders, she saw an opportunity to leverage their expertise in chemistry and electrical and electronic engineering, along with her own food and beverage background, to start a robotics company that could automate and standardize cooking for chain restaurants.\nIn 2021, Chen co-founded Botinkit in Shenzhen and soon took the startup’s cooking robots beyond its home base to markets including Japan and the U.S. Off the back of its steady expansion, Botinkit announced today that it has raised $13 million in a Series A round that will partly be used for its expansion in the Middle East and Europe next year.\nForebright led the round, with investors including 5Y Capital and Brizan Venture participating. With this latest financial injection, Botinkit has amassed nearly $20 million in funding thus far.\nPerhaps the most notable investor from the round is Zexiang Li, a professor at Hong Kong University of Science and Technology known for his angel investment in the drone giant DJI. HKUST, where Chen studied, has emerged as a hub for hardware innovation, with students turning their academic research into commercial ideas.\nMeanwhile, Li and his investment partner Gao Bingqiang, also an HKUST professor, have been supporting their students with funding and other resources. Gao is also an investor in Botinkit.\nScaling restaurants with robots\nWhile Botinkit sees California-based Miso Robotics as a potential competitor, the companies are augmenting different sets of cooking skills.\nMiso’s burger-flipping robots have helped it ink deals with chain giants like Jack in the Box and White Castle. Meanwhile, Botinkit’s wok-shaped robot specializes in stir-frying and stewing and includes an add-on arm that can take over humans in adding ingredients. The company is currently developing a deep-fry model, set to make its debut next year.\nAutomation, Botinkit claims, helps cut ingredient loss by 30% and energy by 40% when compared to commercial gas stoves. But another key selling point of its robots is their ability to facilitate restaurants’ cross-regional expansion, Chen said in an interview with TechCrunch.\nOne of the major hurdles that restaurants encounter when expanding is finding and training a large number of staff, which can slow down their growth. Even if they manage to recruit enough personnel, maintaining consistent quality control can be challenging in new markets.\nA typical 100-square-meter kitchen requires six to ten staff members, according to Chen, but with Botinkit’s robots, that headcount can be cut to just one or two. This means that a franchise restaurant with 500 locations could potentially reduce its kitchen staff from 5,000 to several hundreds.\n“Cuisine used to be restricted by time and geographical boundaries,” Chen suggested. “However, with the digitization of cooking, a range of new possibilities arise, including remote cooking. Suppose I’m in Shenzhen and you’re in the U.S., I can use our software and hardware system to ‘cook’ for you remotely. It’s an incredibly exciting prospect.”\nBotinkit’s current robots come with temperature sensors, but the startup is allocating a portion of its new funding towards developing multi-modal sensors that can also detect flavors and smells. The ultimate goal, Chen said, is to leverage artificial general intelligence, or AGI, so its robots can understand human preferences and refine cooking processes based on data feedback.\nWhile the majority of Botinkit’s revenue comes from selling hardware, the company has started generating income by creating custom recipes for its clients through its global network of partnered chefs. Its clients range from fast-food chains and hotels to catering services and supermarkets. In China, its robots have been cooking at food stalls inside Walmart and Delibowl.\nWant the top robotics news in your inbox each week? Sign up for Actuator here.",
    "date": "2023-07-19 00:00:00"
}