{"article_id": 24, "url": "https://www.reuters.com/business/retail-consumer/bath-body-works-adds-second-new-director-amid-pressure-third-point-2023-02-21/", "title": "Bath & Body Works adds second new director amid pressure from Third Point", "text": "NEW YORK, Feb 21 (Reuters) - Bath & Body Works on Tuesday named a veteran chief financial officer with expertise in capital allocation as a new director, marking the second time in two weeks the specialty retailer has expanded its board as it faces pressure from an activist investor.\nSteve Voskuil, senior vice president and CFO at The Hershey Company(HSY.N), will become the board's 12th member. He previously served as CFO of Avanos Medical, formerly Halyard Health. Before that he spent more than two decades at Kimberly-Clark Corporation in finance-related positions.\nLast week Bath & Body Works added Lucy Brady, a senior executive at Conagra Brands (CAG.N) and consumer products veteran to the board, expanding the group to 11 from 10 members.\nVoskuil \"brings deep knowledge of the global consumer products industry as well as substantial expertise in leading financial operations that spans from oversight of capital allocation and investment to technology infrastructure\ntransformation,\" board Chair Sarah Nash said in a statement.\nVoskuil and Brady's appointments come weeks after Third Point, which owns a 6% stake in the company, hinted it might push for board seats.\nEarlier this month, Third Point founder Daniel Loeb told his fund investors in a letter seen by Reuters that he was closely\nwatching the company and its new chief executive.\nIn December Third Point announced its stake in a regulatory\nfiling and criticized the company's high costs, including\ngenerous executive pay.\nThird Point declined to comment on Tuesday.\nBath & Body Works, best known for selling soaps, candles and\nlotions, is valued at $10 billion.\nThird Point spent an average of $38.16 per share on the\nstock which is now trading at $40.76. The period for nominating\ndirectors opened earlier this month and continues into March.\nCompanies often try to stymie activists' plans by refreshing\nthe board and addressing some of the criticisms investors might\nuse to persuade others to back them.\nReporting by Svea Herbst-Bayliss; Editing by Richard Chang\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-21 00:00:00"}