{
    "article_id": 61,
    "url": "https://reuters.com/technology/indias-infosys-cuts-fy-rev-view-challenging-environment-2023-07-20/",
    "title": "India's Infosys cuts FY revenue growth outlook as clients cut spending",
    "text": "BENGALURU, July 20 (Reuters) - India's No. 2 software services exporter Infosys (INFY.NS) halved its full-year revenue forecast on Thursday as clients cut back spending and delayed making decisions on future projects in a challenging economic environment.\nThe grim forecast, which coincided with a weaker-than-expected profit in the first quarter, pushed the company's U.S.-listed shares down nearly 7% in pre-market trading.\nThe company, a prominent name in the $245 billion Indian IT industry, cut its full-year revenue growth to 1%-3.5% on a constant currency basis from 4%-7% previously.\n\"We have seen some of the deal signings and start dates being delayed, with that we see a lot of revenue from those large and mega deals towards the later part of the financial year,\" Infosys CEO Salil Parekh said in a media conference.\nParekh attributed the cut in revenue growth guidance to \"overall delay in decision-making\" by clients.\n\"Through the (June) quarter we have seen volumes in some of the clients impacted, where they were reducing transformational projects or slowing down decision-making,\" he said.\nIndian IT service providers have been seeing businesses curtail spending on discretionary projects on global inflationary pressures and recession fears.\nLast week, market leader Tata Consultancy Services (TCS.NS) warned of an uncertain demand environment while smaller peers HCLTech (HCLT.NS) and Wipro (WIPR.NS) reported and projected muted growth.\nInfosys's headcount fell sequentially by 6,940 as the company did not backfill employees who left.\nJefferies termed Infosys's \"drastic\" revenue guidance cut a \"shocker,\" adding that the headcount decline also suggested limited growth visibility in the near term.\nConsolidated net profit for Infosys rose 10.9% to 59.45 billion rupees ($725.5 million) in the three months to June 30, missing analysts' view of 61.41 billion rupees as per Refinitiv IBES.\nInfosys saw its large deal signings rise to $2.3 billion from $1.7 billion a year ago.\nThe company maintained its operating margin guidance for the full year at 20-22%, while margins for the quarter ended June 30 came in at 20.8%.\n($1 = 81.9409 Indian rupees)\nReporting by Sethuraman NR and VarunVyas Hebbalalu in Bengaluru; Editing by Sonia Cheema and Janane Venkatraman\nOur Standards: The Thomson Reuters Trust Principles.",
    "date": "2023-07-20 00:00:00"
}