{
    "article_id": 90,
    "url": "https://techcrunch.com/2023/07/20/google-starts-the-ga-rollout-of-its-privacy-sandbox-apis-to-all-chrome-users/",
    "title": "Google starts the GA rollout of its Privacy Sandbox APIs to all Chrome users",
    "text": "Google continues the rollout of its Privacy Sandbox APIs — its replacement for tracking cookies for the online advertising industry. Today, right on schedule and in time for the launch of Chrome 115 into the stable release channel, Google announced that it will now start enabling the relevance and measurement APIs in its browser. This will be a gradual rollout, with Google aiming for a 99% availability by mid-August.\nAt this point, Google doesn’t expect to make any major changes to the APIs. This includes virtually all of the core Privacy Sandbox features, including Topics, Protected Audience, Attribution Reporting, Private Aggregation, Shared Storage and Fenced Frames.\nIt’s worth noting that for the time being, Privacy Sandbox will run in parallel with third-party cookies in the browser. It won’t be until early 2024 that Google will deprecate third-party cookies for 1% of Chrome users. After that, the process will speed up though and Google will deprecate these cookies for all users by the second half of 2024.\nPreviously, the ad tech industry was already able to test its readiness for the eventual third-party cookie deprecation, in part through the Relevance and Measurement origin trial. With these features moving into general availability, Google will end this trial (and revoke the tokens to run experiments) on September 20, 2023.\nFor Chrome users, Google will also now start rolling out its user interface to allow them to manage Privacy Sandbox data in the browser, including ad topics, site-suggested ads and ad measurement data. This rollout will run in parallel with the API releases.\nGoogle will soon make enrollment and attestation a mandatory process for ad tech companies that want to access these APIs on Chrome and Android, though they will be able to continue to do some local testing as well.\n“Shipping these APIs is another key milestone in the ongoing Privacy Sandbox timeline,” Google notes in today’s announcement. “This marks the beginning of the transition from sites testing in the origin trial to integrating these APIs in production. We will be keeping you updated as we progress through enabling the APIs, to the opt-in testing with labels in Q4 2023, the 1% third-party cookie deprecation in Q1 2024, heading towards the full third-party cookie phaseout in Q3 2024.”",
    "date": "2023-07-20 00:00:00"
}