{"article_id": 46, "url": "https://www.businesswire.com/news/home/20230220005179/en/Worldpay-from-FIS-Announces-The-Prince%E2%80%99s-Trust-as-Official-Charity-Partner-in-the-UK", "title": "Worldpay from FIS Announces The Prince’s Trust as Official Charity Partner in the UK", "text": "JACKSONVILLE, Fla.--(BUSINESS WIRE)--FIS® (NYSE: FIS), a global leader in financial services technology, has joined The Prince’s Trust as an official charity partner in the UK to help young people build the confidence and skills they need to reach their full potential. As a partner to The Prince’s Trust, Worldpay from FIS® will support the initiative by encouraging employees to participate in sponsored workshops and programmes, sharing their skills and acumen with young people, particularly via The Prince’s Trust’s Enterprise Programme.\nThe Prince’s Trust was founded by HM The King in 1976, when he was HRH The Prince of Wales, and has supported over a million young people between ages 11-30 in its more than 40 years of operation. The Trust gives young people who face disadvantage practical and financial support that sets them on course for a stable and successful future.\nThis partnership is aligned with Worldpay from FIS’ overarching financial inclusion and corporate strategy, which seeks to reduce the barriers to the financial system. This participation with The Trust will provide meaningful guidance and financial education that can help empower young entrepreneurs and small businesses with the tools they need to grow and thrive.\nIn addition to volunteer service, Worldpay from FIS employees based in the UK will be actively engaged in fundraising challenges, entrepreneurship events and activities for The Trust, helping to bring their services to as many at-risk young people as possible.\nJim Johnson, President of Merchant Solutions, Worldpay from FIS said: “ I’m proud and excited that our partnership with The Prince’s Trust will help to enrich the lives of young entrepreneurs across the UK. Giving back to the communities where we live, and work is an integral pillar of our company culture. This partnership opens new paths for our colleagues to be engaged in the local community and share their talents and knowledge. Entrepreneurship is an important skill that can drive economic and skills growth and it’s important we embrace this as a local community and a global company.”\nSharon Arbuckle, Senior Head of Corporate Partnerships at The Prince’s Trust said: ‘We’re extremely thankful to Worldpay from FIS and their staff for their continued support. The partnership will help to ensure young people, many of whom face multiple challenges, fulfil their dream of starting their own business. We look forward to working with Worldpay from FIS, to inspire the next generation of entrepreneurs across the UK to live, learn and earn.”\nAbout FIS\nFIS is a leading provider of technology solutions for financial institutions and businesses of all sizes and across industries globally. We enable the movement of commerce by unlocking the financial technology that powers the world’s economy. Our employees are dedicated to advancing the way the world pays, banks and invests through our trusted innovation, system performance and flexible architecture. We help our clients use technology in innovative ways to solve business-critical challenges and deliver superior experiences for their customers. Headquartered in Jacksonville, Florida, FIS is a member of the Fortune 500® and the Standard & Poor’s 500® Index. To learn more, visit www.FISglobal.com. Follow FIS on Facebook, LinkedIn and Twitter (@FISglobal).", "date": null}