{
    "article_id": 101,
    "url": "https://techcrunch.com/2023/07/19/snowstorm/",
    "title": "Snowstorm raises seed to keep the internet free",
    "text": "Created to ensure open and free access to the internet, Snowflake saw a huge uptick in users during the start of the Ukraine War — and has grown even more since then. Started as an open source project by Serene (who goes by her first name only for privacy reasons), Snowflake, which began as a pluggable transport for Tor, has had a makeover into Snowstorm, and now promises faster connections and can run as standalone software outside of Tor. Snowstorm’s open beta will launch this quarter.\nSnowstorm announced today it has raised $3 million in seed funding, led by Seed Club Ventures, with participation from Cabrit Capital, Keppel Capital, EchoVC and Matt Devost.\nSnowflake started as an open source project eight years ago to keep the internet free. Serene taught herself how to code when she was nine and was hired by Google while still a teenager. She ended up being the first engineer at Google Ideas, now known as Google Jigsaw, and used her time there to find ways to use large-scale infrastructure to help the internet.\nPart of Serene’s interest in keeping the internet free is that her childhood was difficult and the internet was a refuge for her. “I also knew that the internet would not say the same, especially as things have changed in the last couple of decades and censorship has certainly escalated,” she said. Serene left Google as a top expert on WebRTC, an open source project that adds real-time communication to web browsers and mobile apps. She saw that it would be useful for a new kind of decentralized tool that could keep the internet free. So she prototyped Snowflake and integrated it into the Tor browser.\n“Basically, at the end of the day when you connect to the internet, you’re connecting to other computers. Your ISP, your internet service provider is also computers that connect to the rest of the internet that you connect through to connect to the rest of the internet. And if people have issues with their ISP or they want privacy, usually traditional VPNs are someone’s computer before you connect to the rest of the internet,” she explained, which means VPNs can be monitored and easily circumvented.\nSnowflake, on the other hand, is decentralized and is deployed as a pluggable transport for Tor. Instead of trusting a centralized system or a VPN that can be blocked, it consists of about 100,000 people, from all over the world, temporarily stepping up to use their computers to act as brokers, disguised by domain fronting, so it seems as if it comes from a non-restricted service. Users and brokers are connected by WebRTC. “It’s basically a two-sided user base,” Serene said. “There’s people who need help connecting to the internet and people who can help other connect to the internet.”\nMillions of sessions are being established every day, with things kicking off last year during the start of the Ukraine war when users needed to circumvent internet censorship.\nSnowstorm is an upgrade on all levels, Serene said. She rewrote Snowflake in Rust, partly to help the speed and partly to help it become cross-platform and system wide. One of the challenges with Snowflake was that it had a lot more usage than expected and ran into bottlenecks. “The project itself is a lot of interesting, brilliant people coming together to make this happen. And I just happen to be the initial creator of this project, have an understanding of the architecture and where to go.” So when Snowflake ran into bottlenecks, Serene made improvements — for example, Snowstorm can run system wide and is fast enough to stream videos.\nSerene will continue to build Snowstorm using its new funding, but she said she doesn’t want to participate in marketing strategies like YouTube ads. “I would rather focus on building the real thing that actually works and less resources with a small amount of resources that I’ve been able to raise with Snowstorm.”\nSerene is also a prolific concert pianist, focusing on music after leaving Google. She is going to Europe this month to play Rachmaninoff Concerto No. 2 and is endorsed by Bösendorfer. the Austrian piano manufacturer.\n“In a funny way, being a musician has enabled me to be a better technologist, and being a technologist has enabled me to be a better musician. I find that they are very connected. Music gives me the energy to do everything that needs to be done.” Serene added that during fundraising, some investors asked how she’s able to run a company with her music career. “My answer is that it is some combination of when someone is exercising every morning to stay healthy. Do you tell them, how can you have time? So I happen to play concerts and it makes me very healthy and it’s a lot of energy.”",
    "date": "2023-07-19 00:00:00"
}