{
    "article_id": 96,
    "url": "https://techcrunch.com/2023/07/19/farizon-geelys-truck-unit-raised-600m-to-expand-outside-china/",
    "title": "Farizon, Geely’s truck unit, raised $600M to expand outside China",
    "text": "Farizon, a maker of hybrid and electric trucks owned by China’s Geely, has closed a $600 million Series A raise, the company said in a statement. The Hangzhou-based company plans to use the funds to expand its operations outside of China.\nA key focus for Farizon’s expansion will be Europe, where the automaker plans to start selling a light electric cargo van called the Super Van as early as 2024. Farizon hopes the Super Van will become one of Europe’s top three e-cargo vans.\nRecently, California-based Rivian began to deliver its first e-cargo vans for Amazon in Europe. Rivian hopes to continue to build its presence in the region. Both new entrants will have to compete against Ford’s e-Transit van.\nFarizon is also hoping to establish a presence in Asia-Pacific, South America and the Middle East. Many Chinese EV-makers have begun to pursue strategies in the Middle East after being unable to compete meaningfully in Europe with Western brands.\nFor the moment, the majority of Farizon’s sales come from China. The company sold about 37,800 light commercial vehicles in China in 2022, according to consultant group LMC Automotive. Between January and May 2023, Farizon sold 24,760 vehicles. By the end of the year, Farizon has said it hopes to reach 150,000 units sold. The company said Thursday that it already produced that number of commercial vehicles.\nIn addition to expansion, Farizon said it will use its Series A funds to further its technology and product development.\nThe funding round comes nine months after Farizon raised a pre-Series A round of $300 million. Private equity firm Boyu Capital and state-owned Yuexiu Industrial Fund led the Series A, with participation from United Clean Energy, Linjiang Industry Group and previous investors Hidden Hill Capital and Industry Foundation fo Xiangtan.",
    "date": "2023-07-19 00:00:00"
}