{
    "article_id": 91,
    "url": "https://techcrunch.com/2023/07/20/youtube-premium-individual-plan-now-costs-2-more-in-the-us/",
    "title": "YouTube Premium individual plan now costs $2 more for all subscribers in the US",
    "text": "YouTube Premium individual plan now costs $2 more for all subscribers in the US\nJust like many other streaming services, YouTube has increased the prices of its Premium plan for individuals in the U.S. from $11.99 per month to $13.99 per month.\nThe price hike follows last year’s price bump in family plans in many countries. In the U.S. the family plan tariff went from $17.99 per month to $22.99 per month. The individual plan change, first spotted by 9to5Google, is live on the YouTube Premium page.\nYouTube confirmed the move to TechCrunch and said the price hike will affect all — current and new — subscribers.\n“We’re updating the price for YouTube Premium and YouTube Music Premium subscribers in the US to continue delivering great service and features. We believe this new price reflects the value of YouTube Premium which allows subscribers to enjoy ad-free YouTube with background and offline play and uninterrupted access to over 100M songs with the YouTube Music app,” a company spokesperson said.\nThe company said that users will have to pay the updated prices from their next billing cycle. It added that folks who subscribed to YouTube Premium five years ago, when the plan was launched, will get three additional months at their current price.\nWith YouTube Premium, Google offers ad-free viewing, the ability to download videos, 1080p streaming of higher quality, the ability to resume videos from where you left off, and access to YouTube Music. The company also releases experimental features for Premium subscribers, such as the ability to change playback speed and a lock screen feature to avoid accidental touches.\nGoogle is also hiking the price of the YouTube Music plan from $9.99 per month to $10.99 per month. This follows subscription price raises from Apple Music and Amazon Music, which also offer their streaming at the same price. Spotify’s individual plan still costs $9.99 per month.\nOver the last few months, rival video services such as Apple TV+, Paramount+, and Peacock, have announced price hikes. While Netflix raised its prices last year, the company commenced a crackdown on password sharing, making users pay more or add an extra member to their plans.\nYouTube is also trying to push more people towards its premium plans by taking actions like restricting ad-blockers. It also ran an experiment that briefly put 4K streaming behind a paywall.\nLast November, YouTube said that it had more than 80 million subscribers across Music and Premium offerings. With Google’s earnings next week, the company is taking steps to increase paid users.",
    "date": "2023-07-20 00:00:00"
}