{"article_id": 19, "url": "https://www.reuters.com/markets/deals/biotech-ipos-bloom-with-spotlight-startups-with-human-trial-data-2023-02-13/", "title": "Analysis: Biotech IPOs to bloom with spotlight on startups with human trial data", "text": "Feb 13 (Reuters) - Initial public offerings by small private biotech companies are poised to stage a comeback later in 2023 as the pace of interest rate hikes slows, but tougher economic conditions will make investors more inclined to pick firms which have drugs in human trials.\nGlobally, IPOs across all sectors nosedived last year after a blockbuster 2021, as aggressive interest rate hikes by central banks to curb inflation put an end to the era of cheap money.\nIn the biotech sector, there were only 47 IPOs last year that raised a total of about $4 billion, compared with 152 offerings in 2021 that had raised over $25 billion.\nHowever, more biotech companies are expected to tap the U.S. IPO market this year as the Federal Reserve dials down the size of its rate hikes and private investment rounds fail to raise adequate capital to fund expensive clinical trials, industry experts told Reuters.\nStill, companies that have not yet tested their drugs on humans may find it hard to attract equity investors' attention given tighter financial conditions and a slew of disappointments from preclinical companies that went public during the IPO boom of 2021.\n\"The pattern of the past few years has been to come to the market with almost anything, no matter how substantial the validation,\" said David Pinniger, fund manager of the Biotech fund at Polar Capital.\n\"In these more discerning days, the weight of clinical evidence is probably going to have to be that much greater,\" Pinniger added.\nSeveral preclinical-stage biotechs that went public in 2021 are now trading well below their IPO price, including Sana Biotechnology (SANA.O), Tenaya Therapeutics (TNYA.O) and Virpax Pharmaceuticals (VRPX.O).\nReuters Graphics\nAlong with challenging macro conditions, a string of disappointing clinical data and a dearth of large acquisitions had also sapped investor interest in the biotech sector in the first half of 2022, hammering company valuations.\nSmall drug developers without any approved products on the market were forced to cut costs by dropping some drug study programs and implementing layoffs as funding dried up.\nIllustration photo shows various medicine pills in their original packaging in Brussels, Belgium August 9, 2019. REUTERS/Yves Herman/Illustration\nSentiment started to rebound late in 2022 and has continued into this year, with the SPDR S&P Biotech ETF , considered a yardstick for the performance of small-cap biotech firms, having risen about 3% so far this year after posting its biggest annual loss last year.\nWhile the XBI is still trading 50% below its February 2021 closing high, analysts believe the downturn in biotech has bottomed out. They also believe the outlook for the rest of the year is much brighter given the likelihood of multi-billion dollar acquisitions and innovations such as genome editing and targeted cancer drug developments.\nBiopharma companies held more than $1.4 trillion in dealmaking capacity at the beginning of December 2022, according to a report by EY, with pharmaceutical giants facing patent expiries for their key drugs on the hunt for new promising assets.\n\"There was this dam holding back all this capital,\" said Sean Sun, portfolio manager at Thornburg Investment Management.\n\"Now we're in this sweet spot where you're seeing signs of disinflation, you're seeing risk appetite improve. All we need is one or two biotech IPOs to get good interest and the floodgates will open.\"\nAnalysts have pointed to developmental obesity treatments, Alzheimer's disease drugs, cell and gene therapies, and the breakthrough messenger-RNA technology among areas attracting investor interest.\nReuters Graphics\nThe second half of 2023 is more likely to see a significant step-up in biotech IPOs instead of the first half, as markets await further clarity on potential rate cuts, analysts said.\nAlong with robust clinical data, investors will be looking for companies with management teams that are capable of steering them to success after their stock market listings.\n\"A silver lining in the biotech downturn is that companies realize that they're not necessarily entitled to great valuations because they have some interesting science,\" SMBC Nikko Securities America analyst David Hoang said.\n\"The way private companies are messaging their story and thinking about pushing their pipelines forward has improved compared to the last two years,\" Hoang added.\nA few biotech firms have already filed for an IPO this year, with clinical-stage drug developers Mineralys Therapeutics (MLYS.O) and Structure Therapeutics (GPCR.O) having successful market debuts following their offerings.\nReporting by Amruta Khandekar and Bhanvi Satija; Editing by Alden Bentley\nOur Standards: The Thomson Reuters Trust Principles.", "date": "2023-02-13 00:00:00"}